// AnimBlueprintGeneratedClass B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C
// Size: 0x4500 (Inherited: 0x960)
struct UB_AnimBP_HightowerRadish_C : UFortPetAnimInstance_HighTowerRadish {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x960(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x968(0x58)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x9c0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x9c8(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x9d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x9f0(0x20)
	struct FAnimNode_ModifyBone ; // 0xa10(0x128)
	struct FAnimNode_ModifyBone ; // 0xb38(0x128)
	struct FAnimNode_TransitionResult ; // 0xc60(0x28)
	struct FAnimNode_TransitionResult ; // 0xc88(0x28)
	struct FAnimNode_TransitionResult ; // 0xcb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xcd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xd00(0x28)
	struct FAnimNode_TransitionResult ; // 0xd28(0x28)
	struct FAnimNode_TransitionResult ; // 0xd50(0x28)
	struct FAnimNode_TransitionResult ; // 0xd78(0x28)
	struct FAnimNode_TransitionResult ; // 0xda0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdc8(0x28)
	struct FAnimNode_SequencePlayer ; // 0xdf0(0x40)
	struct FAnimNode_StateResult ; // 0xe30(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xe50(0x68)
	struct FAnimNode_SequencePlayer ; // 0xeb8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0xef8(0xc8)
	struct FAnimNode_StateResult ; // 0xfc0(0x20)
	struct FAnimNode_TransitionResult ; // 0xfe0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1008(0x40)
	struct FAnimNode_StateResult ; // 0x1048(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1068(0x40)
	struct FAnimNode_StateResult ; // 0x10a8(0x20)
	struct FAnimNode_StateMachine ; // 0x10c8(0xc8)
	struct FAnimNode_StateResult ; // 0x1190(0x20)
	struct FAnimNode_TransitionResult ; // 0x11b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x11d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1200(0x28)
	struct FAnimNode_TransitionResult ; // 0x1228(0x28)
	struct FAnimNode_TransitionResult ; // 0x1250(0x28)
	struct FAnimNode_TransitionResult ; // 0x1278(0x28)
	struct FAnimNode_TransitionResult ; // 0x12a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x12c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x12f0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1318(0x40)
	struct FAnimNode_StateResult ; // 0x1358(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1378(0x40)
	struct FAnimNode_StateResult ; // 0x13b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x13d8(0x40)
	struct FAnimNode_StateResult ; // 0x1418(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1438(0x40)
	struct FAnimNode_StateResult ; // 0x1478(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1498(0x40)
	struct FAnimNode_StateResult ; // 0x14d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x14f8(0x40)
	struct FAnimNode_StateResult ; // 0x1538(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1558(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1598(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1660(0x68)
	struct FAnimNode_StateResult ; // 0x16c8(0x20)
	struct FAnimNode_StateMachine ; // 0x16e8(0xc8)
	struct FAnimNode_StateResult ; // 0x17b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x17d0(0x40)
	struct FAnimNode_StateResult ; // 0x1810(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1830(0x40)
	struct FAnimNode_StateResult ; // 0x1870(0x20)
	struct FAnimNode_TransitionResult ; // 0x1890(0x28)
	struct FAnimNode_TransitionResult ; // 0x18b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x18e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1908(0x28)
	struct FAnimNode_TransitionResult ; // 0x1930(0x28)
	struct FAnimNode_TransitionResult ; // 0x1958(0x28)
	struct FAnimNode_TransitionResult ; // 0x1980(0x28)
	struct FAnimNode_TransitionResult ; // 0x19a8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x19d0(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x1a90(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1ad0(0x40)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x1b10(0xd0)
	struct FAnimNode_BlendListByBool ; // 0x1be0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1c28(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1c68(0x40)
	struct FAnimNode_StateResult ; // 0x1ca8(0x20)
	struct FAnimNode_TransitionResult ; // 0x1cc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cf0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d18(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d40(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d68(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d90(0x28)
	struct FAnimNode_TransitionResult ; // 0x1db8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1de0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e08(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e30(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e58(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1e80(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1ec0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1f88(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1ff0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x20b8(0x68)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2120(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2168(0x40)
	struct FAnimNode_StateResult ; // 0x21a8(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x21c8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2290(0x68)
	struct FAnimNode_SequencePlayer ; // 0x22f8(0x40)
	struct FAnimNode_StateResult ; // 0x2338(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2358(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x2398(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2460(0x40)
	struct FAnimNode_StateResult ; // 0x24a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x24c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2500(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x2548(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2610(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2678(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2740(0x68)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x27a8(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x2878(0x40)
	struct FAnimNode_SequencePlayer ; // 0x28b8(0x40)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x28f8(0x10)
	struct FAnimNode_SequencePlayer ; // 0x2908(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2948(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x2990(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2a58(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x2aa0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2b68(0x68)
	struct FAnimNode_SequencePlayer ; // 0x2bd0(0x40)
	struct FAnimNode_StateResult ; // 0x2c10(0x20)
	struct FAnimNode_StateMachine ; // 0x2c30(0xc8)
	struct FAnimNode_StateResult ; // 0x2cf8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2d18(0x40)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x2d58(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x2e28(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2e68(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2eb0(0x40)
	struct FAnimNode_StateResult ; // 0x2ef0(0x20)
	struct FAnimNode_TransitionResult ; // 0x2f10(0x28)
	struct FAnimNode_TransitionResult ; // 0x2f38(0x28)
	struct FAnimNode_TransitionResult ; // 0x2f60(0x28)
	struct FAnimNode_TransitionResult ; // 0x2f88(0x28)
	struct FAnimNode_TransitionResult ; // 0x2fb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2fd8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3000(0x40)
	struct FAnimNode_StateResult ; // 0x3040(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3060(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x30a0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3168(0x40)
	struct FAnimNode_StateResult ; // 0x31a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x31c8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3208(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3250(0x40)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x3290(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x3360(0x40)
	struct FAnimNode_StateResult ; // 0x33a0(0x20)
	struct FAnimNode_StateMachine ; // 0x33c0(0xc8)
	struct FAnimNode_StateResult ; // 0x3488(0x20)
	struct FAnimNode_StateMachine ; // 0x34a8(0xc8)
	struct FAnimNode_StateResult ; // 0x3570(0x20)
	struct FAnimNode_StateMachine ; // 0x3590(0xc8)
	struct FAnimNode_CopyBone ; // 0x3658(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3740(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3760(0x100)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3860(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3888(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x38a8(0x48)
	struct FAnimNode_TransitionResult ; // 0x38f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3918(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3940(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3980(0x40)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x39c0(0xc8)
	struct FAnimNode_StateResult ; // 0x3a88(0x20)
	struct FAnimNode_TransitionResult ; // 0x3aa8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3ad0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3af8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3b20(0x28)
	struct FAnimNode_TransitionResult ; // 0x3b48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3b70(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3b98(0x40)
	struct FAnimNode_StateResult ; // 0x3bd8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3bf8(0x40)
	struct FAnimNode_StateResult ; // 0x3c38(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3c58(0x40)
	struct FAnimNode_StateResult ; // 0x3c98(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3cb8(0x40)
	struct FAnimNode_StateResult ; // 0x3cf8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3d18(0x40)
	struct FAnimNode_StateResult ; // 0x3d58(0x20)
	struct FAnimNode_StateMachine ; // 0x3d78(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3e40(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3e60(0xc8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x3f28(0xf8)
	struct FAnimNode_ModifyBone ; // 0x4020(0x128)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x4148(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4230(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x4250(0x48)
	struct FAnimNode_ModifyBone ; // 0x4298(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x43c0(0x128)
	bool bStoppedMovingOrMeleeForLongEnoughTime; // 0x44e8(0x01)
	bool bSharpDirectionChange; // 0x44e9(0x01)
	bool bHighTowerRadish_LobbySkyDive_Diving; // 0x44ea(0x01)
	bool bHighTowerRadish_LobbySkyDive_Gliding; // 0x44eb(0x01)
	bool bFrontEndIdleTransition; // 0x44ec(0x01)
	bool bIsPlayingMeleeAnimLastTick; // 0x44ed(0x01)
	char pad_44EE[0x2]; // 0x44ee(0x02)
	int32_t RandomLocomotionBreak; // 0x44f0(0x04)
	bool bAllowRandomLocomotionBreak; // 0x44f4(0x01)
	bool bHasTargettedInLastNSeconds; // 0x44f5(0x01)
	char pad_44F6[0x2]; // 0x44f6(0x02)
	double IsDBNOCarriedAlpha; // 0x44f8(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void HighTowerRadish_Lobby SkyDive Diving(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.HighTowerRadish_Lobby SkyDive Diving // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void HighTowerRadish_Lobby SkyDive Gliding(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.HighTowerRadish_Lobby SkyDive Gliding // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_RandomIdlePick(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimNotify_RandomIdlePick // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_BwdToFwd_Entered(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimNotify_BwdToFwd_Entered // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_FwdToBwd_Entered(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimNotify_FwdToBwd_Entered // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_TriggerRandomizer(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimNotify_TriggerRandomizer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_MoveLoopRandomEntered(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimNotify_MoveLoopRandomEntered // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_AnimBP_HightowerRadish_AnimGraphNode_TransitionResult_7063B86B4BA21930F893DBA578CF6DAD(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.EvaluateGraphExposedInputs_ExecuteUbergraph_B_AnimBP_HightowerRadish_AnimGraphNode_TransitionResult_7063B86B4BA21930F893DBA578CF6DAD // (BlueprintEvent) // @ game+0xd67374
	void OnEnteredVehicle(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.OnEnteredVehicle // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void OnExitedVehicle(); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.OnExitedVehicle // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_B_AnimBP_HightowerRadish(int32_t EntryPoint); // Function B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.ExecuteUbergraph_B_AnimBP_HightowerRadish // (Final|UbergraphFunction) // @ game+0xd67374
};

