// AnimBlueprintGeneratedClass B_MasterPetAnimBP.B_MasterPetAnimBP_C
// Size: 0x67f0 (Inherited: 0x730)
struct UB_MasterPetAnimBP_C : UFortPetAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x730(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x738(0x60)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x798(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x7a0(0x08)
	struct FAnimNode_Root ; // 0x7a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x7c8(0xc0)
	struct FAnimNode_Root ; // 0x888(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8a8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x8c8(0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9f0(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0xab0(0xc8)
	struct FAnimNode_BlendListByBool ; // 0xb78(0x48)
	struct FAnimNode_TransitionResult ; // 0xbc0(0x28)
	struct FAnimNode_TransitionResult ; // 0xbe8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc10(0x28)
	struct FAnimNode_TransitionResult ; // 0xc38(0x28)
	struct FAnimNode_TransitionResult ; // 0xc60(0x28)
	struct FAnimNode_TransitionResult ; // 0xc88(0x28)
	struct FAnimNode_TransitionResult ; // 0xcb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xcd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xd00(0x28)
	struct FAnimNode_TransitionResult ; // 0xd28(0x28)
	struct FAnimNode_TransitionResult ; // 0xd50(0x28)
	struct FAnimNode_TransitionResult ; // 0xd78(0x28)
	struct FAnimNode_TransitionResult ; // 0xda0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdc8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf0(0x28)
	struct FAnimNode_TransitionResult ; // 0xe18(0x28)
	struct FAnimNode_TransitionResult ; // 0xe40(0x28)
	struct FAnimNode_TransitionResult ; // 0xe68(0x28)
	struct FAnimNode_TransitionResult ; // 0xe90(0x28)
	struct FAnimNode_TransitionResult ; // 0xeb8(0x28)
	struct FAnimNode_TransitionResult ; // 0xee0(0x28)
	struct FAnimNode_TransitionResult ; // 0xf08(0x28)
	struct FAnimNode_TransitionResult ; // 0xf30(0x28)
	struct FAnimNode_TransitionResult ; // 0xf58(0x28)
	struct FAnimNode_TransitionResult ; // 0xf80(0x28)
	struct FAnimNode_TransitionResult ; // 0xfa8(0x28)
	struct FAnimNode_TransitionResult ; // 0xfd0(0x28)
	struct FAnimNode_TransitionResult ; // 0xff8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1020(0x28)
	struct FAnimNode_TransitionResult ; // 0x1048(0x28)
	struct FAnimNode_TransitionResult ; // 0x1070(0x28)
	struct FAnimNode_TransitionResult ; // 0x1098(0x28)
	struct FAnimNode_TransitionResult ; // 0x10c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x10e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1110(0x28)
	struct FAnimNode_TransitionResult ; // 0x1138(0x28)
	struct FAnimNode_TransitionResult ; // 0x1160(0x28)
	struct FAnimNode_TransitionResult ; // 0x1188(0x28)
	struct FAnimNode_TransitionResult ; // 0x11b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x11d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1200(0x28)
	struct FAnimNode_TransitionResult ; // 0x1228(0x28)
	struct FAnimNode_TransitionResult ; // 0x1250(0x28)
	struct FAnimNode_TransitionResult ; // 0x1278(0x28)
	struct FAnimNode_TransitionResult ; // 0x12a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x12c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x12f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1318(0x28)
	struct FAnimNode_TransitionResult ; // 0x1340(0x28)
	struct FAnimNode_TransitionResult ; // 0x1368(0x28)
	struct FAnimNode_TransitionResult ; // 0x1390(0x28)
	struct FAnimNode_TransitionResult ; // 0x13b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x13e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1408(0x28)
	struct FAnimNode_TransitionResult ; // 0x1430(0x28)
	struct FAnimNode_TransitionResult ; // 0x1458(0x28)
	struct FAnimNode_TransitionResult ; // 0x1480(0x28)
	struct FAnimNode_TransitionResult ; // 0x14a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x14d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x14f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1520(0x28)
	struct FAnimNode_TransitionResult ; // 0x1548(0x28)
	struct FAnimNode_TransitionResult ; // 0x1570(0x28)
	struct FAnimNode_TransitionResult ; // 0x1598(0x28)
	struct FAnimNode_TransitionResult ; // 0x15c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x15e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1610(0x28)
	struct FAnimNode_TransitionResult ; // 0x1638(0x28)
	struct FAnimNode_TransitionResult ; // 0x1660(0x28)
	struct FAnimNode_TransitionResult ; // 0x1688(0x28)
	struct FAnimNode_TransitionResult ; // 0x16b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x16d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1700(0x28)
	struct FAnimNode_TransitionResult ; // 0x1728(0x28)
	struct FAnimNode_TransitionResult ; // 0x1750(0x28)
	struct FAnimNode_TransitionResult ; // 0x1778(0x28)
	struct FAnimNode_TransitionResult ; // 0x17a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x17c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x17f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1818(0x28)
	struct FAnimNode_TransitionResult ; // 0x1840(0x28)
	struct FAnimNode_TransitionResult ; // 0x1868(0x28)
	struct FAnimNode_TransitionResult ; // 0x1890(0x28)
	struct FAnimNode_TransitionResult ; // 0x18b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x18e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1908(0x28)
	struct FAnimNode_TransitionResult ; // 0x1930(0x28)
	struct FAnimNode_TransitionResult ; // 0x1958(0x28)
	struct FAnimNode_TransitionResult ; // 0x1980(0x28)
	struct FAnimNode_TransitionResult ; // 0x19a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x19d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x19f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a20(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a48(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a70(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a98(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ac0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ae8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b10(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b38(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b60(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b88(0x28)
	struct FAnimNode_TransitionResult ; // 0x1bb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1bd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c00(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c28(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c50(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c78(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ca0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1cc8(0x40)
	struct FAnimNode_StateResult ; // 0x1d08(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1d28(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1d70(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1db0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1df0(0xc8)
	struct FAnimNode_TransitionResult ; // 0x1eb8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ee0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f08(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f30(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f58(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f80(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1fa8(0x40)
	struct FAnimNode_StateResult ; // 0x1fe8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2008(0x40)
	struct FAnimNode_StateResult ; // 0x2048(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2068(0x40)
	struct FAnimNode_StateResult ; // 0x20a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x20c8(0x40)
	struct FAnimNode_StateResult ; // 0x2108(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2128(0x40)
	struct FAnimNode_StateResult ; // 0x2168(0x20)
	struct FAnimNode_StateMachine ; // 0x2188(0xc8)
	struct FAnimNode_StateResult ; // 0x2250(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2270(0x40)
	struct FAnimNode_StateResult ; // 0x22b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x22d0(0x40)
	struct FAnimNode_StateResult ; // 0x2310(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2330(0x40)
	struct FAnimNode_StateResult ; // 0x2370(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2390(0x40)
	struct FAnimNode_SequencePlayer ; // 0x23d0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x2410(0xc8)
	struct FAnimNode_StateResult ; // 0x24d8(0x20)
	struct FAnimNode_TransitionResult ; // 0x24f8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2520(0x40)
	struct FAnimNode_StateResult ; // 0x2560(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2580(0x40)
	struct FAnimNode_StateResult ; // 0x25c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x25e0(0x40)
	struct FAnimNode_StateResult ; // 0x2620(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2640(0x40)
	struct FAnimNode_StateResult ; // 0x2680(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x26a0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2768(0x40)
	struct FAnimNode_SequencePlayer ; // 0x27a8(0x40)
	struct FAnimNode_StateResult ; // 0x27e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2808(0x40)
	struct FAnimNode_StateResult ; // 0x2848(0x20)
	struct FAnimNode_TransitionResult ; // 0x2868(0x28)
	struct FAnimNode_TransitionResult ; // 0x2890(0x28)
	struct FAnimNode_TransitionResult ; // 0x28b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x28e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2908(0x28)
	struct FAnimNode_TransitionResult ; // 0x2930(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2958(0x40)
	struct FAnimNode_StateResult ; // 0x2998(0x20)
	struct FAnimNode_SequencePlayer ; // 0x29b8(0x40)
	struct FAnimNode_StateResult ; // 0x29f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2a18(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x2a58(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2b20(0x40)
	struct FAnimNode_StateResult ; // 0x2b60(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x2b80(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2c48(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c88(0x40)
	struct FAnimNode_StateResult ; // 0x2cc8(0x20)
	struct FAnimNode_StateMachine ; // 0x2ce8(0xc8)
	struct FAnimNode_StateResult ; // 0x2db0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2dd0(0x40)
	struct FAnimNode_StateResult ; // 0x2e10(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2e30(0x40)
	struct FAnimNode_StateResult ; // 0x2e70(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2e90(0x40)
	struct FAnimNode_StateResult ; // 0x2ed0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ef0(0x40)
	struct FAnimNode_StateResult ; // 0x2f30(0x20)
	struct FAnimNode_TransitionResult ; // 0x2f50(0x28)
	struct FAnimNode_TransitionResult ; // 0x2f78(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2fa0(0x40)
	struct FAnimNode_StateResult ; // 0x2fe0(0x20)
	struct FAnimNode_TransitionResult ; // 0x3000(0x28)
	struct FAnimNode_TransitionResult ; // 0x3028(0x28)
	struct FAnimNode_TransitionResult ; // 0x3050(0x28)
	struct FAnimNode_TransitionResult ; // 0x3078(0x28)
	struct FAnimNode_TransitionResult ; // 0x30a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x30c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x30f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3118(0x28)
	struct FAnimNode_TransitionResult ; // 0x3140(0x28)
	struct FAnimNode_TransitionResult ; // 0x3168(0x28)
	struct FAnimNode_TransitionResult ; // 0x3190(0x28)
	struct FAnimNode_TransitionResult ; // 0x31b8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x31e0(0x40)
	struct FAnimNode_StateResult ; // 0x3220(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3240(0x40)
	struct FAnimNode_StateResult ; // 0x3280(0x20)
	struct FAnimNode_StateResult ; // 0x32a0(0x20)
	struct FAnimNode_TransitionResult ; // 0x32c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x32e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3310(0x28)
	struct FAnimNode_TransitionResult ; // 0x3338(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3360(0x40)
	struct FAnimNode_StateResult ; // 0x33a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x33c0(0x40)
	struct FAnimNode_StateResult ; // 0x3400(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3420(0x40)
	struct FAnimNode_StateResult ; // 0x3460(0x20)
	struct FAnimNode_TransitionResult ; // 0x3480(0x28)
	struct FAnimNode_TransitionResult ; // 0x34a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x34d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x34f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3520(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3548(0x40)
	struct FAnimNode_StateResult ; // 0x3588(0x20)
	struct FAnimNode_SequencePlayer ; // 0x35a8(0x40)
	struct FAnimNode_StateResult ; // 0x35e8(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x3608(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x36d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3710(0x40)
	struct FAnimNode_StateResult ; // 0x3750(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3770(0x40)
	struct FAnimNode_SequencePlayer ; // 0x37b0(0x40)
	struct FAnimNode_BlendListByInt ; // 0x37f0(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x3838(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3900(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3940(0x40)
	struct FAnimNode_StateResult ; // 0x3980(0x20)
	struct FAnimNode_SequencePlayer ; // 0x39a0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x39e0(0x40)
	struct FAnimNode_BlendListByInt ; // 0x3a20(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x3a68(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3b30(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3b70(0x40)
	struct FAnimNode_StateResult ; // 0x3bb0(0x20)
	struct FAnimNode_StateMachine ; // 0x3bd0(0xc8)
	struct FAnimNode_StateResult ; // 0x3c98(0x20)
	struct FAnimNode_StateMachine ; // 0x3cb8(0xc8)
	struct FAnimNode_StateResult ; // 0x3d80(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3da0(0x40)
	struct FAnimNode_StateResult ; // 0x3de0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3e00(0x40)
	struct FAnimNode_StateResult ; // 0x3e40(0x20)
	struct FAnimNode_StateMachine ; // 0x3e60(0xc8)
	struct FAnimNode_StateResult ; // 0x3f28(0x20)
	struct FAnimNode_TransitionResult ; // 0x3f48(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f70(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f98(0x28)
	struct FAnimNode_TransitionResult ; // 0x3fc0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3fe8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x4010(0x40)
	struct FAnimNode_StateResult ; // 0x4050(0x20)
	struct FAnimNode_TransitionResult ; // 0x4070(0x28)
	struct FAnimNode_TransitionResult ; // 0x4098(0x28)
	struct FAnimNode_TransitionResult ; // 0x40c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x40e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4110(0x28)
	struct FAnimNode_TransitionResult ; // 0x4138(0x28)
	struct FAnimNode_SequencePlayer ; // 0x4160(0x40)
	struct FAnimNode_StateResult ; // 0x41a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x41c0(0x40)
	struct FAnimNode_StateResult ; // 0x4200(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x4220(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4288(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x42f0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x43b8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4480(0x68)
	struct FAnimNode_BlendListByBool ; // 0x44e8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4530(0x68)
	struct FAnimNode_StateResult ; // 0x4598(0x20)
	struct FAnimNode_SequencePlayer ; // 0x45b8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x45f8(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x46c0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x4700(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x47c8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4830(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4878(0x68)
	struct FAnimNode_StateResult ; // 0x48e0(0x20)
	struct FAnimNode_StateMachine ; // 0x4900(0xc8)
	struct FAnimNode_StateResult ; // 0x49c8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x49e8(0x40)
	struct FAnimNode_StateResult ; // 0x4a28(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4a48(0x40)
	struct FAnimNode_StateResult ; // 0x4a88(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4aa8(0x40)
	struct FAnimNode_StateResult ; // 0x4ae8(0x20)
	struct FAnimNode_StateMachine ; // 0x4b08(0xc8)
	struct FAnimNode_StateResult ; // 0x4bd0(0x20)
	struct FAnimNode_RandomPlayer ; // 0x4bf0(0x78)
	struct FAnimNode_StateResult ; // 0x4c68(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4c88(0x40)
	struct FAnimNode_StateResult ; // 0x4cc8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4ce8(0x40)
	struct FAnimNode_StateResult ; // 0x4d28(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4d48(0x40)
	struct FAnimNode_StateResult ; // 0x4d88(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4da8(0x40)
	struct FAnimNode_StateResult ; // 0x4de8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4e08(0x40)
	struct FAnimNode_StateResult ; // 0x4e48(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4e68(0x40)
	struct FAnimNode_StateResult ; // 0x4ea8(0x20)
	struct FAnimNode_TransitionResult ; // 0x4ec8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4ef0(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f18(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f40(0x28)
	struct FAnimNode_SequencePlayer ; // 0x4f68(0x40)
	struct FAnimNode_StateResult ; // 0x4fa8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4fc8(0x40)
	struct FAnimNode_StateResult ; // 0x5008(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5028(0x40)
	struct FAnimNode_StateResult ; // 0x5068(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5088(0x40)
	struct FAnimNode_StateResult ; // 0x50c8(0x20)
	struct FAnimNode_StateMachine ; // 0x50e8(0xc8)
	struct FAnimNode_StateResult ; // 0x51b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x51d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5210(0x40)
	struct FAnimNode_BlendListByBool ; // 0x5250(0x48)
	struct FAnimNode_BlendListByInt ; // 0x5298(0x48)
	struct FAnimNode_SequencePlayer ; // 0x52e0(0x40)
	struct FAnimNode_StateResult ; // 0x5320(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5340(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5380(0x40)
	struct FAnimNode_BlendListByBool ; // 0x53c0(0x48)
	struct FAnimNode_BlendListByInt ; // 0x5408(0x48)
	struct FAnimNode_SequencePlayer ; // 0x5450(0x40)
	struct FAnimNode_StateResult ; // 0x5490(0x20)
	struct FAnimNode_SequencePlayer ; // 0x54b0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x54f0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x5530(0x48)
	struct FAnimNode_BlendListByInt ; // 0x5578(0x48)
	struct FAnimNode_SequencePlayer ; // 0x55c0(0x40)
	struct FAnimNode_StateResult ; // 0x5600(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5620(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5660(0x40)
	struct FAnimNode_BlendListByBool ; // 0x56a0(0x48)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x56e8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x5730(0x40)
	struct FAnimNode_StateResult ; // 0x5770(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5790(0x40)
	struct FAnimNode_SequencePlayer ; // 0x57d0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x5810(0xc8)
	struct FAnimNode_StateResult ; // 0x58d8(0x20)
	struct FAnimNode_TransitionResult ; // 0x58f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x5920(0x28)
	struct FAnimNode_TransitionResult ; // 0x5948(0x28)
	struct FAnimNode_TransitionResult ; // 0x5970(0x28)
	struct FAnimNode_TransitionResult ; // 0x5998(0x28)
	struct FAnimNode_TransitionResult ; // 0x59c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x59e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x5a10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5a38(0x28)
	struct FAnimNode_SequencePlayer ; // 0x5a60(0x40)
	struct FAnimNode_StateResult ; // 0x5aa0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5ac0(0x40)
	struct FAnimNode_StateResult ; // 0x5b00(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5b20(0x40)
	struct FAnimNode_StateResult ; // 0x5b60(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5b80(0x40)
	struct FAnimNode_StateResult ; // 0x5bc0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5be0(0x40)
	struct FAnimNode_StateResult ; // 0x5c20(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5c40(0x40)
	struct FAnimNode_StateResult ; // 0x5c80(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5ca0(0x40)
	struct FAnimNode_StateResult ; // 0x5ce0(0x20)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x5d00(0x78)
	struct FAnimNode_StateResult ; // 0x5d78(0x20)
	struct FAnimNode_StateMachine ; // 0x5d98(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5e60(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5e80(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5f48(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x6010(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6050(0x40)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x6090(0x48)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x60d8(0xb0)
	struct FAnimNode_SaveCachedPose ; // 0x6188(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6288(0x28)
	struct FAnimNode_UseCachedPose ; // 0x62b0(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x62d8(0xe0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x63b8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6400(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6500(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6528(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6550(0xe0)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x6630(0x10)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x6640(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x6660(0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6728(0x20)
	double HandIKAlphaOverride; // 0x6748(0x08)
	double LegIKAlphaOverride; // 0x6750(0x08)
	struct FVector LookAtTargetLocationInput; // 0x6758(0x18)
	double LookAtOverrideInput; // 0x6770(0x08)
	double __CustomProperty_HandIKAlphaOverride_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x6778(0x08)
	double __CustomProperty_LegIKAlphaOverride_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x6780(0x08)
	struct FVector __CustomProperty_LookAtTargetLocationInput_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x6788(0x18)
	double __CustomProperty_LookAtOverrideInput_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x67a0(0x08)
	struct FVector PlayerLocation; // 0x67a8(0x18)
	bool bHasPlayerLocationBeenSet; // 0x67c0(0x01)
	bool ; // 0x67c1(0x01)
	char pad_67C2[0x2]; // 0x67c2(0x02)
	int32_t JumpIndex; // 0x67c4(0x04)
	double DownSightsToLocomotionTimeRemaining_b; // 0x67c8(0x08)
	int32_t RandomIdle; // 0x67d0(0x04)
	int32_t RandomIdle2; // 0x67d4(0x04)
	double HandIKWeight; // 0x67d8(0x08)
	bool bIsMovingDuringJumpInitiated; // 0x67e0(0x01)
	bool bIsFox; // 0x67e1(0x01)
	bool bAllowSkippingIdleToCrouchTransition; // 0x67e2(0x01)
	bool BlockAnimRule; // 0x67e3(0x01)
	char pad_67E4[0x4]; // 0x67e4(0x04)
	struct UPoseAsset* FacePoseAsset; // 0x67e8(0x08)

	void PetSkeletalControlLayer(struct FPoseLink Pose, double LookAtOverrideInput, struct FVector LookAtTargetLocationInput, double LegIKAlphaOverride, double HandIKAlphaOverride, struct FPoseLink& PetSkeletalControlLayer); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.PetSkeletalControlLayer // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void PetFullOverrideLayer(struct FPoseLink InPose, struct FPoseLink& PetFullOverrideLayer); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.PetFullOverrideLayer // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_RollRandomIdle(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_RollRandomIdle // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_RollRandomIdle2(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_RollRandomIdle2 // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_StartJump_Entered(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_StartJump_Entered // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_StartJump_Entered_Test(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_StartJump_Entered_Test // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_CrouchIdle1_FullyBlended(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_CrouchIdle1_FullyBlended // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_CrouchIdle2_FullyBlended(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_CrouchIdle2_FullyBlended // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_Entered_Crouching(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_Entered_Crouching // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_Entered_DownSightsToCrouch(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimNotify_Entered_DownSightsToCrouch // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void LobbySkyDive_IsDiving(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.LobbySkyDive_IsDiving // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void LobbySkyDive_IsGliding(); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.LobbySkyDive_IsGliding // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_B_MasterPetAnimBP(int32_t EntryPoint); // Function B_MasterPetAnimBP.B_MasterPetAnimBP_C.ExecuteUbergraph_B_MasterPetAnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

