// ScriptStruct B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x5d (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	int32_t ; // 0x04(0x04)
	int32_t ; // 0x08(0x04)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	bool ; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float ; // 0x20(0x04)
	float ; // 0x24(0x04)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	bool ; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float ; // 0x34(0x04)
	float ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	int32_t ; // 0x40(0x04)
	bool ; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	int32_t ; // 0x48(0x04)
	bool ; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32_t ; // 0x50(0x04)
	bool ; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32_t ; // 0x58(0x04)
	bool ; // 0x5c(0x01)
};

// ScriptStruct B_MasterPetAnimBP.B_MasterPetAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x538 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	int32_t ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	struct FName ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct FName ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct FName ; // 0x50(0x04)
	int32_t ; // 0x54(0x04)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct FName ; // 0x60(0x04)
	int32_t ; // 0x64(0x04)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct FName ; // 0x70(0x04)
	int32_t ; // 0x74(0x04)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	int32_t ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	int32_t ; // 0x94(0x04)
	struct FName ; // 0x98(0x04)
	int32_t ; // 0x9c(0x04)
	struct FName ; // 0xa0(0x04)
	int32_t ; // 0xa4(0x04)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct UAnimSequenceBase* ; // 0xb0(0x08)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct FName ; // 0xc0(0x04)
	int32_t ; // 0xc4(0x04)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct FName ; // 0xd0(0x04)
	int32_t ; // 0xd4(0x04)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct FName ; // 0xe0(0x04)
	int32_t ; // 0xe4(0x04)
	struct FName ; // 0xe8(0x04)
	int32_t ; // 0xec(0x04)
	struct UAnimSequenceBase* ; // 0xf0(0x08)
	struct FName ; // 0xf8(0x04)
	int32_t ; // 0xfc(0x04)
	struct UAnimSequenceBase* ; // 0x100(0x08)
	struct FName ; // 0x108(0x04)
	int32_t ; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct FName ; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	struct FName ; // 0x128(0x04)
	struct FName ; // 0x12c(0x04)
	struct UAnimSequenceBase* ; // 0x130(0x08)
	struct FName ; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct UAnimSequenceBase* ; // 0x140(0x08)
	struct FName ; // 0x148(0x04)
	struct FName ; // 0x14c(0x04)
	struct FName ; // 0x150(0x04)
	struct FName ; // 0x154(0x04)
	struct FName ; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)
	struct UAnimSequenceBase* ; // 0x160(0x08)
	struct UAnimSequenceBase* ; // 0x168(0x08)
	struct TArray<float> ; // 0x170(0x10)
	struct FName ; // 0x180(0x04)
	struct FName ; // 0x184(0x04)
	struct UAnimSequenceBase* ; // 0x188(0x08)
	struct FName ; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)
	struct UAnimSequenceBase* ; // 0x198(0x08)
	struct FName ; // 0x1a0(0x04)
	struct FName ; // 0x1a4(0x04)
	int32_t ; // 0x1a8(0x04)
	struct FName ; // 0x1ac(0x04)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	struct FName ; // 0x1b8(0x04)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct UAnimSequenceBase* ; // 0x1c0(0x08)
	struct FName ; // 0x1c8(0x04)
	char pad_1CC[0x4]; // 0x1cc(0x04)
	struct UBlendSpace* ; // 0x1d0(0x08)
	struct UBlendSpace* ; // 0x1d8(0x08)
	struct UBlendSpace* ; // 0x1e0(0x08)
	struct FName ; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	struct UAnimSequenceBase* ; // 0x1f0(0x08)
	struct UBlendSpace* ; // 0x1f8(0x08)
	struct TArray<float> ; // 0x200(0x10)
	struct UBlendSpace* ; // 0x210(0x08)
	struct FName ; // 0x218(0x04)
	struct FName ; // 0x21c(0x04)
	struct UAnimSequenceBase* ; // 0x220(0x08)
	struct FName ; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UAnimSequenceBase* ; // 0x230(0x08)
	struct FName ; // 0x238(0x04)
	struct FName ; // 0x23c(0x04)
	int32_t ; // 0x240(0x04)
	struct FName ; // 0x244(0x04)
	int32_t ; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct UAnimSequenceBase* ; // 0x250(0x08)
	struct FName ; // 0x258(0x04)
	int32_t ; // 0x25c(0x04)
	struct UAnimSequenceBase* ; // 0x260(0x08)
	struct FName ; // 0x268(0x04)
	int32_t ; // 0x26c(0x04)
	struct UAnimSequenceBase* ; // 0x270(0x08)
	struct FName ; // 0x278(0x04)
	int32_t ; // 0x27c(0x04)
	struct UAnimSequenceBase* ; // 0x280(0x08)
	struct FName ; // 0x288(0x04)
	int32_t ; // 0x28c(0x04)
	struct UAnimSequenceBase* ; // 0x290(0x08)
	struct FName ; // 0x298(0x04)
	int32_t ; // 0x29c(0x04)
	struct UAnimSequenceBase* ; // 0x2a0(0x08)
	struct FName ; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct UAnimSequenceBase* ; // 0x2b0(0x08)
	struct FName ; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UAnimSequenceBase* ; // 0x2c0(0x08)
	struct FName ; // 0x2c8(0x04)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	struct UAnimSequenceBase* ; // 0x2d0(0x08)
	struct FName ; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct UAnimSequenceBase* ; // 0x2e0(0x08)
	struct FName ; // 0x2e8(0x04)
	struct FName ; // 0x2ec(0x04)
	struct UAnimSequenceBase* ; // 0x2f0(0x08)
	struct UAnimSequenceBase* ; // 0x2f8(0x08)
	struct UAnimSequenceBase* ; // 0x300(0x08)
	struct FName ; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct UAnimSequenceBase* ; // 0x310(0x08)
	struct UAnimSequenceBase* ; // 0x318(0x08)
	struct UAnimSequenceBase* ; // 0x320(0x08)
	struct FName ; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct UAnimSequenceBase* ; // 0x330(0x08)
	struct UAnimSequenceBase* ; // 0x338(0x08)
	struct UAnimSequenceBase* ; // 0x340(0x08)
	struct FName ; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct UAnimSequenceBase* ; // 0x350(0x08)
	struct UAnimSequenceBase* ; // 0x358(0x08)
	struct UAnimSequenceBase* ; // 0x360(0x08)
	struct FName ; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct UAnimSequenceBase* ; // 0x370(0x08)
	struct FName ; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UAnimSequenceBase* ; // 0x380(0x08)
	struct FName ; // 0x388(0x04)
	int32_t ; // 0x38c(0x04)
	struct UAnimSequenceBase* ; // 0x390(0x08)
	struct FName ; // 0x398(0x04)
	int32_t ; // 0x39c(0x04)
	struct UAnimSequenceBase* ; // 0x3a0(0x08)
	struct FName ; // 0x3a8(0x04)
	int32_t ; // 0x3ac(0x04)
	struct UAnimSequenceBase* ; // 0x3b0(0x08)
	struct FName ; // 0x3b8(0x04)
	int32_t ; // 0x3bc(0x04)
	struct UAnimSequenceBase* ; // 0x3c0(0x08)
	struct FName ; // 0x3c8(0x04)
	int32_t ; // 0x3cc(0x04)
	struct UAnimSequenceBase* ; // 0x3d0(0x08)
	struct FName ; // 0x3d8(0x04)
	int32_t ; // 0x3dc(0x04)
	struct UAnimSequenceBase* ; // 0x3e0(0x08)
	struct FName ; // 0x3e8(0x04)
	int32_t ; // 0x3ec(0x04)
	struct FName ; // 0x3f0(0x04)
	struct FName ; // 0x3f4(0x04)
	int32_t ; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct UAnimSequenceBase* ; // 0x400(0x08)
	bool ; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float ; // 0x40c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x410(0x2c)
	float ; // 0x43c(0x04)
	struct UAnimSequenceBase* ; // 0x440(0x08)
	enum class EAnimSyncMethod ; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	struct FName ; // 0x44c(0x04)
	struct UBlendProfile* ; // 0x450(0x08)
	struct UCurveFloat* ; // 0x458(0x08)
	bool ; // 0x460(0x01)
	enum class EAlphaBlendOption ; // 0x461(0x01)
	enum class EBlendListTransitionType ; // 0x462(0x01)
	char pad_463[0x5]; // 0x463(0x05)
	struct TArray<float> ; // 0x468(0x10)
	enum class ERefPoseType ; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	struct FName ; // 0x47c(0x04)
	struct FName ; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct FAnimNodeFunctionRef ; // 0x488(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x4a0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x520(0x18)
};

