// AnimBlueprintGeneratedClass BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C
// Size: 0x5994 (Inherited: 0xa90)
struct UBoarRidingPlayerLayerAnimBP_C : UFortVehicleLayerAnimInstance_Riding {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa90(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xa98(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xb28(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xb30(0x08)
	struct FAnimNode_Root ; // 0xb38(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xb58(0xc0)
	struct FAnimNode_ModifyBone ; // 0xc18(0x128)
	struct FAnimNode_ModifyBone ; // 0xd40(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xe68(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xe88(0x20)
	struct FAnimNode_ModifyBone ; // 0xea8(0x128)
	struct FAnimNode_ModifyBone ; // 0xfd0(0x128)
	struct FAnimNode_ApplyAdditive ; // 0x10f8(0xc8)
	struct FAnimNode_LegIK ; // 0x11c0(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x12b8(0xf8)
	struct FAnimNode_BlendSpacePlayer ; // 0x13b0(0x68)
	struct FAnimNode_Root ; // 0x1418(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1438(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x14f8(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x15f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1618(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1638(0x48)
	struct FAnimNode_ModifyBone ; // 0x1680(0x128)
	struct FAnimNode_ModifyBone ; // 0x17a8(0x128)
	struct FAnimNode_ModifyBone ; // 0x18d0(0x128)
	struct FAnimNode_ModifyBone ; // 0x19f8(0x128)
	struct FAnimNode_TransitionResult ; // 0x1b20(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b48(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b70(0x28)
	struct FAnimNode_TransitionResult ; // 0x1b98(0x28)
	struct FAnimNode_TransitionResult ; // 0x1bc0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1be8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c10(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c38(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c60(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c88(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d00(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d28(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d50(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d78(0x28)
	struct FAnimNode_TransitionResult ; // 0x1da0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1dc8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1df0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1e30(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1e70(0x48)
	struct FAnimNode_StateResult ; // 0x1eb8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1ed8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1f18(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1f58(0x48)
	struct FAnimNode_StateResult ; // 0x1fa0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1fc0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2000(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2048(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2088(0x40)
	struct FAnimNode_BlendListByBool ; // 0x20c8(0x48)
	struct FAnimNode_StateResult ; // 0x2110(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2130(0x40)
	struct FAnimNode_StateResult ; // 0x2170(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2190(0x68)
	struct FAnimNode_SequencePlayer ; // 0x21f8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x2238(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2300(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2348(0x40)
	struct FAnimNode_StateResult ; // 0x2388(0x20)
	struct FAnimNode_SequencePlayer ; // 0x23a8(0x40)
	struct FAnimNode_StateResult ; // 0x23e8(0x20)
	struct FAnimNode_TransitionResult ; // 0x2408(0x28)
	struct FAnimNode_TransitionResult ; // 0x2430(0x28)
	struct FAnimNode_TransitionResult ; // 0x2458(0x28)
	struct FAnimNode_TransitionResult ; // 0x2480(0x28)
	struct FAnimNode_TransitionResult ; // 0x24a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x24d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x24f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2520(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2548(0x40)
	struct FAnimNode_StateResult ; // 0x2588(0x20)
	struct FAnimNode_SequencePlayer ; // 0x25a8(0x40)
	struct FAnimNode_StateResult ; // 0x25e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2608(0x40)
	struct FAnimNode_StateResult ; // 0x2648(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2668(0x40)
	struct FAnimNode_StateResult ; // 0x26a8(0x20)
	struct FAnimNode_TransitionResult ; // 0x26c8(0x28)
	struct FAnimNode_StateMachine ; // 0x26f0(0xc8)
	struct FAnimNode_StateResult ; // 0x27b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x27d8(0x40)
	struct FAnimNode_StateResult ; // 0x2818(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2838(0x40)
	struct FAnimNode_StateResult ; // 0x2878(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2898(0x40)
	struct FAnimNode_StateResult ; // 0x28d8(0x20)
	struct FAnimNode_TransitionResult ; // 0x28f8(0x28)
	struct FAnimNode_StateMachine ; // 0x2920(0xc8)
	struct FAnimNode_StateResult ; // 0x29e8(0x20)
	struct FAnimNode_TransitionResult ; // 0x2a08(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a30(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2a58(0x40)
	struct FAnimNode_StateResult ; // 0x2a98(0x20)
	struct FAnimNode_StateResult ; // 0x2ab8(0x20)
	struct FAnimNode_StateMachine ; // 0x2ad8(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x2ba0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2c68(0x68)
	struct FAnimNode_SequencePlayer ; // 0x2cd0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2d10(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2d50(0x48)
	struct FAnimNode_BlendListByBool ; // 0x2d98(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2de0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2e48(0xc8)
	struct FAnimNode_StateResult ; // 0x2f10(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2f30(0x40)
	struct FAnimNode_StateResult ; // 0x2f70(0x20)
	struct FAnimNode_StateMachine ; // 0x2f90(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x3058(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x3138(0x28)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3160(0x100)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3260(0x110)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3370(0xe0)
	struct FAnimNode_TransitionResult ; // 0x3450(0x28)
	struct FAnimNode_TransitionResult ; // 0x3478(0x28)
	struct FAnimNode_TransitionResult ; // 0x34a0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x34c8(0x28)
	struct FAnimNode_StateResult ; // 0x34f0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3510(0x68)
	struct FAnimNode_StateResult ; // 0x3578(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3598(0x28)
	struct FAnimNode_StateResult ; // 0x35c0(0x20)
	struct FAnimNode_StateMachine ; // 0x35e0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x36a8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x37a8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x37d0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x38d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38f8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3920(0x110)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x3a30(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3b00(0x110)
	struct FAnimNode_TransitionResult ; // 0x3c10(0x28)
	struct FAnimNode_TransitionResult ; // 0x3c38(0x28)
	struct FAnimNode_TransitionResult ; // 0x3c60(0x28)
	struct FAnimNode_TransitionResult ; // 0x3c88(0x28)
	struct FAnimNode_TransitionResult ; // 0x3cb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3cd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d00(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d28(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d50(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d78(0x28)
	struct FAnimNode_TransitionResult ; // 0x3da0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3dc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3df0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e18(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e40(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e68(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e90(0x28)
	struct FAnimNode_TransitionResult ; // 0x3eb8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3ee0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3f20(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3f60(0x48)
	struct FAnimNode_StateResult ; // 0x3fa8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3fc8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4008(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4048(0x48)
	struct FAnimNode_StateResult ; // 0x4090(0x20)
	struct FAnimNode_SequencePlayer ; // 0x40b0(0x40)
	struct FAnimNode_StateResult ; // 0x40f0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4110(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4150(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4190(0x48)
	struct FAnimNode_StateResult ; // 0x41d8(0x20)
	struct FAnimNode_TransitionResult ; // 0x41f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4220(0x28)
	struct FAnimNode_TransitionResult ; // 0x4248(0x28)
	struct FAnimNode_TransitionResult ; // 0x4270(0x28)
	struct FAnimNode_TransitionResult ; // 0x4298(0x28)
	struct FAnimNode_TransitionResult ; // 0x42c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x42e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4310(0x28)
	struct FAnimNode_SequencePlayer ; // 0x4338(0x40)
	struct FAnimNode_StateResult ; // 0x4378(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4398(0x40)
	struct FAnimNode_StateResult ; // 0x43d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x43f8(0x40)
	struct FAnimNode_StateResult ; // 0x4438(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4458(0x40)
	struct FAnimNode_StateResult ; // 0x4498(0x20)
	struct FAnimNode_TransitionResult ; // 0x44b8(0x28)
	struct FAnimNode_StateMachine ; // 0x44e0(0xc8)
	struct FAnimNode_StateResult ; // 0x45a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x45c8(0x40)
	struct FAnimNode_StateResult ; // 0x4608(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4628(0x40)
	struct FAnimNode_StateResult ; // 0x4668(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4688(0x40)
	struct FAnimNode_StateResult ; // 0x46c8(0x20)
	struct FAnimNode_TransitionResult ; // 0x46e8(0x28)
	struct FAnimNode_StateMachine ; // 0x4710(0xc8)
	struct FAnimNode_StateResult ; // 0x47d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x47f8(0x40)
	struct FAnimNode_StateResult ; // 0x4838(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4858(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4898(0x48)
	struct FAnimNode_SequencePlayer ; // 0x48e0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4920(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4960(0x48)
	struct FAnimNode_StateResult ; // 0x49a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x49c8(0x40)
	struct FAnimNode_StateResult ; // 0x4a08(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4a28(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4a68(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4ab0(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x4af0(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4b58(0x48)
	struct FAnimNode_StateResult ; // 0x4ba0(0x20)
	struct FAnimNode_StateMachine ; // 0x4bc0(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4c88(0x128)
	struct FAnimNode_TransitionResult ; // 0x4db0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4dd8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e00(0x40)
	struct FAnimNode_StateResult ; // 0x4e40(0x20)
	struct FAnimNode_RefPose ; // 0x4e60(0x10)
	struct FAnimNode_StateResult ; // 0x4e70(0x20)
	struct FAnimNode_StateMachine ; // 0x4e90(0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x4f58(0xd0)
	struct FAnimNode_ApplyAdditive ; // 0x5028(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x50f0(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5158(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x5220(0x68)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5288(0x10)
	struct FAnimNode_BlendListByBool ; // 0x5298(0x48)
	struct FAnimNode_BlendListByBool ; // 0x52e0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5328(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5390(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x53f8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5440(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5460(0xc8)
	struct FAnimNode_Root ; // 0x5528(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x5548(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5608(0xc0)
	struct FAnimNode_Root ; // 0x56c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x56e8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x57a8(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5868(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5928(0x20)
	struct AFortPlayerPawn* FortPlayer; // 0x5948(0x08)
	struct AFortPawn* WildlifePawn; // 0x5950(0x08)
	bool State Rule Moving Idle; // 0x5958(0x01)
	bool Is Jumping; // 0x5959(0x01)
	bool Is Falling; // 0x595a(0x01)
	bool Is Surface Swimming; // 0x595b(0x01)
	char pad_595C[0x4]; // 0x595c(0x04)
	double BodyRoll; // 0x5960(0x08)
	double BoarSpeed2D; // 0x5968(0x08)
	bool Is Moving Backwards; // 0x5970(0x01)
	bool Is Boosting; // 0x5971(0x01)
	bool Can Transition Fall To Moving; // 0x5972(0x01)
	bool Can Transition Fall To Idle; // 0x5973(0x01)
	bool Can Transition Idle To Moving; // 0x5974(0x01)
	bool Is Turning in Place; // 0x5975(0x01)
	char pad_5976[0x2]; // 0x5976(0x02)
	double Turn in Place Angle Delta; // 0x5978(0x08)
	bool Should Play Stop Backwards; // 0x5980(0x01)
	bool Play Land Additive; // 0x5981(0x01)
	bool Was Turning Right; // 0x5982(0x01)
	char pad_5983[0x5]; // 0x5983(0x05)
	double Backwards Play Rate; // 0x5988(0x08)
	float SlopeRoll; // 0x5990(0x04)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void GetMainAnimBPData_Boar(struct UObject* AnimInstance); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Boar // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BoarRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_3AC2A6BB409F97D93A87FE8016464FEE(); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BoarRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_3AC2A6BB409F97D93A87FE8016464FEE // (BlueprintEvent) // @ game+0xd67374
	void BlueprintCollectRidableAnimBPData(struct UAnimInstance* RidableAnimInstance); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_BoarRidingPlayerLayerAnimBP(int32_t EntryPoint); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.ExecuteUbergraph_BoarRidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xd67374
};

