// ScriptStruct Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x358 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	struct FName ; // 0x2c(0x04)
	struct TArray<float> ; // 0x30(0x10)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	struct TArray<float> ; // 0x60(0x10)
	float ; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	int32_t ; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct FName ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct FName ; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct FName ; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct FName ; // 0xd0(0x04)
	struct FName ; // 0xd4(0x04)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct FName ; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct UAnimSequenceBase* ; // 0xe8(0x08)
	struct FName ; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct UAnimSequenceBase* ; // 0xf8(0x08)
	struct FName ; // 0x100(0x04)
	struct FName ; // 0x104(0x04)
	int32_t ; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	struct TArray<float> ; // 0x120(0x10)
	struct FName ; // 0x130(0x04)
	int32_t ; // 0x134(0x04)
	enum class EBlendListTransitionType ; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)
	struct TArray<float> ; // 0x140(0x10)
	struct UAnimSequenceBase* ; // 0x150(0x08)
	struct UAnimSequenceBase* ; // 0x158(0x08)
	struct UAnimSequenceBase* ; // 0x160(0x08)
	struct TArray<float> ; // 0x168(0x10)
	struct FName ; // 0x178(0x04)
	int32_t ; // 0x17c(0x04)
	struct UAnimSequenceBase* ; // 0x180(0x08)
	struct UBlendSpace* ; // 0x188(0x08)
	struct UAnimSequenceBase* ; // 0x190(0x08)
	struct FName ; // 0x198(0x04)
	int32_t ; // 0x19c(0x04)
	struct UAnimSequenceBase* ; // 0x1a0(0x08)
	struct FName ; // 0x1a8(0x04)
	int32_t ; // 0x1ac(0x04)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	struct FName ; // 0x1b8(0x04)
	int32_t ; // 0x1bc(0x04)
	struct UBlendSpace* ; // 0x1c0(0x08)
	struct UAnimSequenceBase* ; // 0x1c8(0x08)
	struct TArray<float> ; // 0x1d0(0x10)
	struct UBlendSpace* ; // 0x1e0(0x08)
	struct UAnimSequenceBase* ; // 0x1e8(0x08)
	struct UBlendProfile* ; // 0x1f0(0x08)
	struct UCurveFloat* ; // 0x1f8(0x08)
	enum class EAlphaBlendOption ; // 0x200(0x01)
	enum class EBlendListTransitionType ; // 0x201(0x01)
	char pad_202[0x6]; // 0x202(0x06)
	struct TArray<float> ; // 0x208(0x10)
	struct UBlendSpace* ; // 0x218(0x08)
	struct UBlendSpace* ; // 0x220(0x08)
	enum class EAnimSyncMethod ; // 0x228(0x01)
	char pad_229[0x3]; // 0x229(0x03)
	struct FName ; // 0x22c(0x04)
	struct FName ; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct UAnimSequenceBase* ; // 0x238(0x08)
	struct FName ; // 0x240(0x04)
	bool ; // 0x244(0x01)
	char pad_245[0x3]; // 0x245(0x03)
	float ; // 0x248(0x04)
	struct FInputScaleBiasClampConstants ; // 0x24c(0x2c)
	float ; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct UAnimSequenceBase* ; // 0x280(0x08)
	bool ; // 0x288(0x01)
	enum class EAnimSyncMethod ; // 0x289(0x01)
	enum class EAnimGroupRole ; // 0x28a(0x01)
	char pad_28B[0x1]; // 0x28b(0x01)
	struct FName ; // 0x28c(0x04)
	int32_t ; // 0x290(0x04)
	enum class ERefPoseType ; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)
	struct FName ; // 0x298(0x04)
	struct FName ; // 0x29c(0x04)
	int32_t ; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct FAnimNodeFunctionRef ; // 0x2a8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x2c0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x340(0x18)
};

// ScriptStruct Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x68 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float ; // 0x04(0x04)
	bool ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	bool ; // 0x18(0x01)
	bool ; // 0x19(0x01)
	char pad_1A[0x2]; // 0x1a(0x02)
	float ; // 0x1c(0x04)
	float ; // 0x20(0x04)
	float ; // 0x24(0x04)
	bool ; // 0x28(0x01)
	bool ; // 0x29(0x01)
	bool ; // 0x2a(0x01)
	bool ; // 0x2b(0x01)
	bool ; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	float ; // 0x30(0x04)
	bool ; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float ; // 0x38(0x04)
	float ; // 0x3c(0x04)
	bool ; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ; // 0x44(0x04)
	bool ; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float ; // 0x4c(0x04)
	float ; // 0x50(0x04)
	float ; // 0x54(0x04)
	bool ; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float ; // 0x5c(0x04)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
};

