// AnimBlueprintGeneratedClass Burt_AnimBP.Burt_AnimBP_C
// Size: 0x44a0 (Inherited: 0x780)
struct UBurt_AnimBP_C : UFortAIFaunaAnimInstance_Burt {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x780(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x788(0x68)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x7f0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x7f8(0x08)
	struct FAnimNode_Root ; // 0x800(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x820(0xc0)
	struct FAnimNode_BlendListByBool ; // 0x8e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x928(0x40)
	struct FAnimNode_SequencePlayer ; // 0x968(0x40)
	struct FAnimNode_Root ; // 0x9a8(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9c8(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xa88(0x40)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xac8(0x20)
	struct FAnimNode_TransitionResult ; // 0xae8(0x28)
	struct FAnimNode_TransitionResult ; // 0xb10(0x28)
	struct FAnimNode_TransitionResult ; // 0xb38(0x28)
	struct FAnimNode_TransitionResult ; // 0xb60(0x28)
	struct FAnimNode_TransitionResult ; // 0xb88(0x28)
	struct FAnimNode_TransitionResult ; // 0xbb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xbd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc00(0x28)
	struct FAnimNode_TransitionResult ; // 0xc28(0x28)
	struct FAnimNode_TransitionResult ; // 0xc50(0x28)
	struct FAnimNode_TransitionResult ; // 0xc78(0x28)
	struct FAnimNode_TransitionResult ; // 0xca0(0x28)
	struct FAnimNode_TransitionResult ; // 0xcc8(0x28)
	struct FAnimNode_TransitionResult ; // 0xcf0(0x28)
	struct FAnimNode_TransitionResult ; // 0xd18(0x28)
	struct FAnimNode_TransitionResult ; // 0xd40(0x28)
	struct FAnimNode_TransitionResult ; // 0xd68(0x28)
	struct FAnimNode_TransitionResult ; // 0xd90(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0xdb8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0xe20(0xc8)
	struct FAnimNode_SequencePlayer ; // 0xee8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xf28(0x40)
	struct FAnimNode_BlendListByBool ; // 0xf68(0x48)
	struct FAnimNode_StateResult ; // 0xfb0(0x20)
	struct FAnimNode_SequencePlayer ; // 0xfd0(0x40)
	struct FAnimNode_StateResult ; // 0x1010(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1030(0x40)
	struct FAnimNode_StateResult ; // 0x1070(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1090(0x40)
	struct FAnimNode_StateResult ; // 0x10d0(0x20)
	struct FAnimNode_TransitionResult ; // 0x10f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1118(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1140(0x40)
	struct FAnimNode_StateResult ; // 0x1180(0x20)
	struct FAnimNode_RefPose ; // 0x11a0(0x10)
	struct FAnimNode_StateResult ; // 0x11b0(0x20)
	struct FAnimNode_StateMachine ; // 0x11d0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1298(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1360(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1428(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1490(0x68)
	struct FAnimNode_StateResult ; // 0x14f8(0x20)
	struct FAnimNode_UseCachedPose ; // 0x1518(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1540(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1588(0xe0)
	struct FAnimNode_BlendListByBool ; // 0x1668(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x16b0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x16d8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1718(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1758(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1820(0x68)
	struct FAnimNode_StateResult ; // 0x1888(0x20)
	struct FAnimNode_StateMachine ; // 0x18a8(0xc8)
	struct FAnimNode_Slot ; // 0x1970(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x19b8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x19d8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x19f8(0x48)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1a40(0xf8)
	struct FAnimNode_ApplyAdditive ; // 0x1b38(0xc8)
	struct FAnimNode_TransitionResult ; // 0x1c00(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c28(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1c50(0x40)
	struct FAnimNode_StateResult ; // 0x1c90(0x20)
	struct FAnimNode_RefPose ; // 0x1cb0(0x10)
	struct FAnimNode_StateResult ; // 0x1cc0(0x20)
	struct FAnimNode_StateMachine ; // 0x1ce0(0xc8)
	struct FFortAnimNode_QuadrupedSlopeWarping FortAnimGraphNode_QuadrupedSlopeWarping; // 0x1da8(0x5c0)
	char pad_2368[0x8]; // 0x2368(0x08)
	struct FFortAnimNode_WeightedLookAt FortAnimGraphNode_WeightedLookAt; // 0x2370(0x250)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x25c0(0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x26c0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2788(0x100)
	struct FAnimNode_BlendListByBool ; // 0x2888(0x48)
	struct FAnimNode_SequencePlayer ; // 0x28d0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2910(0x48)
	struct FAnimNode_TransitionResult ; // 0x2958(0x28)
	struct FAnimNode_TransitionResult ; // 0x2980(0x28)
	struct FAnimNode_TransitionResult ; // 0x29a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x29d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x29f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a20(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a48(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a70(0x28)
	struct FAnimNode_TransitionResult ; // 0x2a98(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ac0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ae8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b10(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b38(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b60(0x28)
	struct FAnimNode_TransitionResult ; // 0x2b88(0x28)
	struct FAnimNode_TransitionResult ; // 0x2bb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2bd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c00(0x28)
	struct FAnimNode_BlendListByBool ; // 0x2c28(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2c70(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2cb0(0x40)
	struct FAnimNode_StateResult ; // 0x2cf0(0x20)
	struct FAnimNode_TransitionResult ; // 0x2d10(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d38(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d60(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d88(0x28)
	struct FAnimNode_TransitionResult ; // 0x2db0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2dd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2e00(0x28)
	struct FAnimNode_TransitionResult ; // 0x2e28(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2e50(0x40)
	struct FAnimNode_StateResult ; // 0x2e90(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2eb0(0x40)
	struct FAnimNode_StateResult ; // 0x2ef0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2f10(0x40)
	struct FAnimNode_StateResult ; // 0x2f50(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2f70(0x40)
	struct FAnimNode_StateResult ; // 0x2fb0(0x20)
	struct FAnimNode_TransitionResult ; // 0x2fd0(0x28)
	struct FAnimNode_StateMachine ; // 0x2ff8(0xc8)
	struct FAnimNode_StateResult ; // 0x30c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x30e0(0x40)
	struct FAnimNode_StateResult ; // 0x3120(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3140(0x40)
	struct FAnimNode_StateResult ; // 0x3180(0x20)
	struct FAnimNode_SequencePlayer ; // 0x31a0(0x40)
	struct FAnimNode_StateResult ; // 0x31e0(0x20)
	struct FAnimNode_TransitionResult ; // 0x3200(0x28)
	struct FAnimNode_StateMachine ; // 0x3228(0xc8)
	struct FAnimNode_StateResult ; // 0x32f0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3310(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3350(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3390(0x48)
	struct FAnimNode_StateResult ; // 0x33d8(0x20)
	struct FAnimNode_BlendListByBool ; // 0x33f8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3440(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x3480(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x34e8(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x35b0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x35f0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3630(0x48)
	struct FAnimNode_StateResult ; // 0x3678(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3698(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x36d8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x3740(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x3808(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3850(0x40)
	struct FAnimNode_StateResult ; // 0x3890(0x20)
	struct FAnimNode_SequencePlayer ; // 0x38b0(0x40)
	struct FAnimNode_StateResult ; // 0x38f0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3910(0x40)
	struct FAnimNode_StateResult ; // 0x3950(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3970(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x39d8(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3aa0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3ae0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x3b28(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x3b90(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3c58(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3c98(0x48)
	struct FAnimNode_TransitionResult ; // 0x3ce0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d08(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3d30(0x40)
	struct FAnimNode_StateResult ; // 0x3d70(0x20)
	struct FAnimNode_RefPose ; // 0x3d90(0x10)
	struct FAnimNode_StateResult ; // 0x3da0(0x20)
	struct FAnimNode_StateMachine ; // 0x3dc0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3e88(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3f50(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4018(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4080(0x68)
	struct FAnimNode_StateResult ; // 0x40e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4108(0x40)
	struct FAnimNode_StateResult ; // 0x4148(0x20)
	struct FAnimNode_StateMachine ; // 0x4168(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4230(0xc8)
	struct FAnimNode_TransitionResult ; // 0x42f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4320(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4348(0x40)
	struct FAnimNode_StateResult ; // 0x4388(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x43a8(0x10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x43b8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x43d8(0xc8)

	void Fauna IdleTurn(struct FPoseLink InPose IdleTurn, struct FPoseLink& Fauna IdleTurn); // Function Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void Fauna Idle(struct FPoseLink InPose Idle, struct FPoseLink& Fauna Idle); // Function Burt_AnimBP.Burt_AnimBP_C.Fauna Idle // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function Burt_AnimBP.Burt_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3(); // Function Burt_AnimBP.Burt_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3 // (BlueprintEvent) // @ game+0xd67374
	void AnimNotify_FallExit(); // Function Burt_AnimBP.Burt_AnimBP_C.AnimNotify_FallExit // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LandAddExit(); // Function Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandAddExit // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LandEnter(); // Function Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandEnter // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Burt_AnimBP(int32_t EntryPoint); // Function Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

