// Class ChromePlayerGameplayRuntime.FortAthenaAIBotEvaluator_ChromedBlob
// Size: 0x120 (Inherited: 0x88)
struct UFortAthenaAIBotEvaluator_ChromedBlob : UFortAthenaAIBotEvaluator {
	struct FName TacticalSprintExecutionStatusName; // 0x88(0x04)
	struct FName TacticalSprintOverridenName; // 0x8c(0x04)
	char pad_90[0x4]; // 0x90(0x04)
	struct FGameplayTag ChromedTag; // 0x94(0x04)
	struct FGameplayTag ChromeBlobAbilityTag; // 0x98(0x04)
	struct FGameplayTag ChromeBlobbedTag; // 0x9c(0x04)
	struct FScalableFloat BlobDuration; // 0xa0(0x28)
	struct FScalableFloat BlobDurationRandomDeviation; // 0xc8(0x28)
	char pad_F0[0x30]; // 0xf0(0x30)
};

