// VerseClass CompanionAI.$SolarisSignatureFunctionOuter
// Size: 0x28 (Inherited: 0x28)
struct U$SolarisSignatureFunctionOuter : UObject {
};

// VerseClass CompanionAI.companion_ai
// Size: 0x370 (Inherited: 0x1c0)
struct Ucompanion_ai : Uscript_component {
	OptionProperty __verse_0xC81F8A41_NPCComponent; // 0x1c0(0x08)
	OptionProperty __verse_0x7F57F536_PositionComponent; // 0x1c8(0x08)
	OptionProperty __verse_0xA783EA89_PingComponent; // 0x1d0(0x08)
	char __verse_0x4222121E_DebugDisplay : 1; // 0x1d8(0x01)
	char pad_1D8_1 : 7; // 0x1d8(0x01)
	char pad_1D9[0x7]; // 0x1d9(0x07)
	double __verse_0x2CDB4F82_LeashDistance; // 0x1e0(0x08)
	double __verse_0x115C86C1_AttackTargetDistance; // 0x1e8(0x08)
	double __verse_0xCE8DFDAA_TacticalSprintThreshold; // 0x1f0(0x08)
	double __verse_0x9F079D21_MovevementThreshold; // 0x1f8(0x08)
	double __verse_0x8D041DAB_HoldPositionLeashDistance; // 0x200(0x08)
	struct FDelegate __verse_0x401DFA2B_CrouchService_L_Nfort__npc__component_R; // 0x208(0x0c)
	struct FDelegate __verse_0xFCB9A9C5_DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R; // 0x214(0x0c)
	struct FDelegate __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0x220(0x0c)
	struct FDelegate __verse_0xB75D1E95_GameLoop_L_Nfort__npc__component_M_Nping__component_R; // 0x22c(0x0c)
	struct FDelegate __verse_0xD45B9503_GetNewObstacle_L_Nfort__npc__component_R; // 0x238(0x0c)
	struct FDelegate __verse_0x50E31FEA_GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R; // 0x244(0x0c)
	struct FDelegate __verse_0x789B8C66_GetNewThreat_L_Nfort__npc__component_R; // 0x250(0x0c)
	struct FDelegate __verse_0x0BBD9327_GetObstacle_L_Nfort__npc__component_R; // 0x25c(0x0c)
	struct FDelegate __verse_0x1D0677C7_GetThreat_L_Nfort__npc__component_R; // 0x268(0x0c)
	struct FDelegate __verse_0x9AECEC46_GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R; // 0x274(0x0c)
	struct FDelegate __verse_0x4544FFC6_GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R; // 0x280(0x0c)
	struct FDelegate __verse_0xC914E946_HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R; // 0x28c(0x0c)
	struct FDelegate __verse_0x9A497FF8_HandleGoTo_L_Nfort__npc__component_M_Nping__info_R; // 0x298(0x0c)
	struct FDelegate __verse_0xBDF7F425_HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R; // 0x2a4(0x0c)
	struct FDelegate __verse_0x5107186B_HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R; // 0x2b0(0x0c)
	struct FDelegate __verse_0xE20A4857_HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R; // 0x2bc(0x0c)
	struct FDelegate __verse_0x0B03967D_HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R; // 0x2c8(0x0c)
	struct FDelegate __verse_0x0471E5EE_HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R; // 0x2d4(0x0c)
	struct FDelegate __verse_0x04AD69E3_HandleTarget_L_Nfort__npc__component_R; // 0x2e0(0x0c)
	struct FDelegate __verse_0x6D8FB021_HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R; // 0x2ec(0x0c)
	struct FDelegate __verse_0x3ED65A6D__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x2f8(0x0c)
	struct FDelegate __verse_0xE7F43F5D_LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R; // 0x304(0x0c)
	struct FDelegate __verse_0xA978BB72_LookAtThreatTask_L_Nfort__npc__component_R; // 0x310(0x0c)
	struct FDelegate __verse_0x609C9D1E_OnDamagedBy_L_Nfort__npc__component_R; // 0x31c(0x0c)
	struct FDelegate __verse_0xD20B8886_ReviveCommand_L_Nfort__npc__component_M_Nentity_R; // 0x328(0x0c)
	struct FDelegate __verse_0x2A3D4860_SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R; // 0x334(0x0c)
	struct FDelegate __verse_0x607570FD_ShootTargetService_L_Nfort__npc__component_M_Nfloat_R; // 0x340(0x0c)
	struct FDelegate __verse_0x841083E9_SprintService_L_Nfort__npc__component_R; // 0x34c(0x0c)
	struct FDelegate __verse_0x057E1910_TacticalSprintService_L_Nfort__npc__component_R; // 0x358(0x0c)
	struct FDelegate __verse_0xD52E5C4D_WaitForEntityMovement_L_Nentity_M_Nfloat_R; // 0x364(0x0c)

	struct Utask(:type)* WaitForEntityMovement_L_Nentity_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lentity_Mfloat_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.WaitForEntityMovement_L_Nentity_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* TacticalSprintService_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.TacticalSprintService_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* SprintService_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.SprintService_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* ShootTargetService_L_Nfort__npc__component_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mfloat_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.ShootTargetService_L_Nfort__npc__component_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mentity_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* ReviveCommand_L_Nfort__npc__component_M_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mentity_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.ReviveCommand_L_Nfort__npc__component_M_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* OnDamagedBy_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.OnDamagedBy_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	void _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin // (Public|HasDefaults|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* LookAtThreatTask_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.LookAtThreatTask_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mvector3_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleTarget_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleTarget_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_M_Qentity_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleGoTo_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleGoTo_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GetThreat_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GetThreat_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GetObstacle_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GetObstacle_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GetNewThreat_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GetNewThreat_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_M_Qthreat__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GetNewObstacle_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GetNewObstacle_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* GameLoop_L_Nfort__npc__component_M_Nping__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__component_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.GameLoop_L_Nfort__npc__component_M_Nping__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lvector3_Mfloat_Mcolor_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	struct Utask(:type)* CrouchService_L_Nfort__npc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ufort_npc_component* __verse_0xB2CDDD72_Argument); // Function CompanionAI.companion_ai.CrouchService_L_Nfort__npc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	void $InitInstance(); // Function CompanionAI.companion_ai.$InitInstance // (None) // @ game+0xd67374
	void $Block(); // Function CompanionAI.companion_ai.$Block // (None) // @ game+0xd67374
	void $InitCDO(); // Function CompanionAI.companion_ai.$InitCDO // (None) // @ game+0xd67374
};

// VerseClass CompanionAI.CompanionAI
// Size: 0x28 (Inherited: 0x28)
struct UCompanionAI : UObject {

	VerseStringProperty _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R(enum class command_type __verse_0xB2CDDD72_Argument); // Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xd67374
	VerseStringProperty _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R(enum class entity_type __verse_0xB2CDDD72_Argument); // Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xd67374
	struct Fping_info ping_info$Factory(); // Function CompanionAI.CompanionAI.ping_info$Factory // (Static|HasOutParms) // @ game+0xd67374
	void $InitCDO(); // Function CompanionAI.CompanionAI.$InitCDO // (None) // @ game+0xd67374
};

// VerseClass CompanionAI.fort_npc_component
// Size: 0x290 (Inherited: 0x278)
struct Ufort_npc_component : Unpc_component {
	struct FDelegate __verse_0xECDDAB04_RunDefaultBehavior; // 0x278(0x0c)
	struct FDelegate __verse_0x7271EEC2__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__npc__component_N_RSetLeashActor_L_Nentity_R; // 0x284(0x0c)

	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__npc__component_N_RSetLeashActor_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function CompanionAI.fort_npc_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__npc__component_N_RSetLeashActor_L_Nentity_R // (Native|Public|BlueprintCallable) // @ game+0x65100b8
	struct Utask(:type)* RunDefaultBehavior(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.fort_npc_component.RunDefaultBehavior // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	void $InitInstance(); // Function CompanionAI.fort_npc_component.$InitInstance // (None) // @ game+0xd67374
	void $Block(); // Function CompanionAI.fort_npc_component.$Block // (None) // @ game+0xd67374
	void $InitCDO(); // Function CompanionAI.fort_npc_component.$InitCDO // (None) // @ game+0xd67374
};

// VerseClass CompanionAI.log_companion_ai
// Size: 0x28 (Inherited: 0x28)
struct Ulog_companion_ai : Ulog_channel {

	void $InitInstance(); // Function CompanionAI.log_companion_ai.$InitInstance // (None) // @ game+0xd67374
	void $Block(); // Function CompanionAI.log_companion_ai.$Block // (None) // @ game+0xd67374
	void $InitCDO(); // Function CompanionAI.log_companion_ai.$InitCDO // (None) // @ game+0xd67374
};

// VerseClass CompanionAI.ping_component
// Size: 0xc8 (Inherited: 0x98)
struct Uping_component : UPingComponentBase {
	struct FDelegate __verse_0x01FF985B__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RAreNPCCommandsEnabled; // 0x98(0x0c)
	char pad_A4[0x18]; // 0xa4(0x18)
	struct FDelegate __verse_0x5766A220__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RDeclineNPCCommand_L_Nlogic_R; // 0xbc(0x0c)
	struct FDelegate __verse_0xB58E74CF__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RGetCurrentNPCCommand; // 0xa4(0x0c)
	struct FDelegate __verse_0x68114BBA_OnNPCCommand; // 0xb0(0x0c)

	struct Utask(:type)* OnNPCCommand(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.ping_component.OnNPCCommand // (Public|HasOutParms|BlueprintCallable) // @ game+0xd67374
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RGetCurrentNPCCommand(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RGetCurrentNPCCommand // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x65100d0
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RDeclineNPCCommand_L_Nlogic_R(char __verse_0xB2CDDD72_Argument); // Function CompanionAI.ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RDeclineNPCCommand_L_Nlogic_R // (Native|Public|BlueprintCallable) // @ game+0x65100c8
	char _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RAreNPCCommandsEnabled(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function CompanionAI.ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RAreNPCCommandsEnabled // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x65100c0
	void $InitInstance(); // Function CompanionAI.ping_component.$InitInstance // (None) // @ game+0xd67374
	void $Block(); // Function CompanionAI.ping_component.$Block // (None) // @ game+0xd67374
	void $InitCDO(); // Function CompanionAI.ping_component.$InitCDO // (None) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$CrouchService_L_Nfort__npc__component_R
// Size: 0x1b8 (Inherited: 0x120)
struct Utask_companion_ai$CrouchService_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Utask(:type)* ; // 0x150(0x08)
	struct FDelegate ; // 0x158(0x0c)
	char pad_164[0x4]; // 0x164(0x04)
	int64_t ; // 0x168(0x08)
	struct Ufort_npc_component* ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	struct Ftuple_L_R ; // 0x184(0x01)
	char pad_185[0x3]; // 0x185(0x03)
	struct FDelegate ; // 0x188(0x0c)
	enum class EVerseTrue ; // 0x194(0x01)
	char pad_195[0x3]; // 0x195(0x03)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	VerseStringProperty ; // 0x1a8(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$CrouchService_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x508 (Inherited: 0x120)
struct Utask_companion_ai$DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x1a0(0x40)
	int64_t ; // 0x1e0(0x08)
	OptionProperty ; // 0x1e8(0x39)
	char pad_221[0x3]; // 0x221(0x03)
	struct FDelegate ; // 0x224(0x0c)
	int64_t ; // 0x230(0x08)
	OptionProperty ; // 0x238(0x39)
	char pad_271[0x7]; // 0x271(0x07)
	struct Utask(:type)* ; // 0x278(0x08)
	struct FDelegate ; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct Ftuple_Lfort__npc__component_M_Qthreat__info_R ; // 0x290(0x48)
	int64_t ; // 0x2d8(0x08)
	OptionProperty ; // 0x2e0(0x39)
	char pad_319[0x7]; // 0x319(0x07)
	struct Utask(:type)* ; // 0x320(0x08)
	struct FDelegate ; // 0x328(0x0c)
	char pad_334[0x4]; // 0x334(0x04)
	int64_t ; // 0x338(0x08)
	struct Fthreat_info ; // 0x340(0x38)
	OptionProperty ; // 0x378(0x39)
	char pad_3B1[0x7]; // 0x3b1(0x07)
	VerseDynamicProperty ; // 0x3b8(0x10)
	OptionProperty ; // 0x3c8(0x11)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	VerseDynamicProperty ; // 0x3e0(0x10)
	VerseDynamicProperty ; // 0x3f0(0x10)
	struct Utask(:type)* ; // 0x400(0x08)
	struct FDelegate ; // 0x408(0x0c)
	char pad_414[0x4]; // 0x414(0x04)
	struct Ftuple_Lfort__npc__component_Mthreat__info_R ; // 0x418(0x40)
	int64_t ; // 0x458(0x08)
	OptionProperty ; // 0x460(0x39)
	char pad_499[0x3]; // 0x499(0x03)
	struct FDelegate ; // 0x49c(0x0c)
	struct FDelegate ; // 0x4a8(0x0c)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mfloat_R ; // 0x4b8(0x30)
	enum class EVerseTrue ; // 0x4e8(0x01)
	char pad_4E9[0x3]; // 0x4e9(0x03)
	struct FDelegate ; // 0x4ec(0x0c)
	VerseStringProperty ; // 0x4f8(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$DispatchGoTo_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
// Size: 0x2c1 (Inherited: 0x120)
struct Utask_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	OptionProperty ; // 0x168(0x02)
	enum class EVerseTrue ; // 0x16a(0x01)
	char pad_16B[0x1]; // 0x16b(0x01)
	struct FDelegate ; // 0x16c(0x0c)
	struct Ftuple_Lvector3_M_QParams_Nsphere__draw__params_R ; // 0x178(0x70)
	OptionProperty ; // 0x1e8(0x51)
	char pad_239[0x7]; // 0x239(0x07)
	struct Fsphere_draw_params ; // 0x240(0x50)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	int64_t ; // 0x2a8(0x08)
	enum class EVerseTrue ; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	struct FDelegate ; // 0x2b4(0x0c)
	struct Ftuple_L_R ; // 0x2c0(0x01)

	int64_t Update(); // Function CompanionAI.task_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GameLoop_L_Nfort__npc__component_M_Nping__component_R
// Size: 0x438 (Inherited: 0x120)
struct Utask_companion_ai$GameLoop_L_Nfort__npc__component_M_Nping__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__component_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	VerseDynamicProperty ; // 0x138(0x10)
	OptionProperty ; // 0x148(0x11)
	char pad_159[0x7]; // 0x159(0x07)
	VerseDynamicProperty ; // 0x160(0x10)
	char  : 1; // 0x170(0x01)
	char pad_170_1 : 7; // 0x170(0x01)
	char pad_171[0x7]; // 0x171(0x07)
	struct Uping_component* ; // 0x178(0x08)
	struct FDelegate ; // 0x180(0x0c)
	struct Ftuple_L_R ; // 0x18c(0x01)
	char pad_18D[0x3]; // 0x18d(0x03)
	VerseDynamicProperty ; // 0x190(0x10)
	struct Ufort_npc_component* ; // 0x1a0(0x08)
	struct Utask(:type)* ; // 0x1a8(0x08)
	struct FDelegate ; // 0x1b0(0x0c)
	struct Ftuple_L_R ; // 0x1bc(0x01)
	char pad_1BD[0x3]; // 0x1bd(0x03)
	int64_t ; // 0x1c0(0x08)
	OptionProperty ; // 0x1c8(0x39)
	char pad_201[0x7]; // 0x201(0x07)
	struct Fping_info ; // 0x208(0x38)
	OptionProperty ; // 0x240(0x39)
	enum class EVerseTrue ; // 0x279(0x01)
	char pad_27A[0x2]; // 0x27a(0x02)
	struct FDelegate ; // 0x27c(0x0c)
	VerseStringProperty ; // 0x288(0x10)
	int64_t ; // 0x298(0x08)
	OptionProperty ; // 0x2a0(0x39)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct Uping_component* ; // 0x2e0(0x08)
	struct Utask(:type)* ; // 0x2e8(0x08)
	struct FDelegate ; // 0x2f0(0x0c)
	struct Ftuple_L_R ; // 0x2fc(0x01)
	char pad_2FD[0x3]; // 0x2fd(0x03)
	int64_t ; // 0x300(0x08)
	struct Utask(:type)* ; // 0x308(0x08)
	struct FDelegate ; // 0x310(0x0c)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x320(0x40)
	int64_t ; // 0x360(0x08)
	OptionProperty ; // 0x368(0x39)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	struct Ufort_npc_component* ; // 0x3a8(0x08)
	struct Utask(:type)* ; // 0x3b0(0x08)
	struct FDelegate ; // 0x3b8(0x0c)
	struct Ftuple_L_R ; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
	int64_t ; // 0x3c8(0x08)
	OptionProperty ; // 0x3d0(0x39)
	char pad_409[0x7]; // 0x409(0x07)
	struct Uping_component* ; // 0x410(0x08)
	struct Utask(:type)* ; // 0x418(0x08)
	struct FDelegate ; // 0x420(0x0c)
	struct Ftuple_L_R ; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	int64_t ; // 0x430(0x08)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GameLoop_L_Nfort__npc__component_M_Nping__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GetNewObstacle_L_Nfort__npc__component_R
// Size: 0x209 (Inherited: 0x120)
struct Utask_companion_ai$GetNewObstacle_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x29)
	char pad_159[0x7]; // 0x159(0x07)
	OptionProperty ; // 0x160(0x29)
	char pad_189[0x7]; // 0x189(0x07)
	struct Ufort_npc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	int64_t ; // 0x1b0(0x08)
	struct Fobstacle_info ; // 0x1b8(0x28)
	OptionProperty ; // 0x1e0(0x29)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GetNewObstacle_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R
// Size: 0x398 (Inherited: 0x120)
struct Utask_companion_ai$GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_M_Qthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x48)
	OptionProperty _RetVal; // 0x170(0x39)
	enum class EVerseTrue ; // 0x1a9(0x01)
	char pad_1AA[0x2]; // 0x1aa(0x02)
	struct FDelegate ; // 0x1ac(0x0c)
	VerseStringProperty ; // 0x1b8(0x10)
	struct Fthreat_info ; // 0x1c8(0x38)
	OptionProperty ; // 0x200(0x39)
	char pad_239[0x7]; // 0x239(0x07)
	OptionProperty ; // 0x240(0x39)
	char pad_279[0x7]; // 0x279(0x07)
	struct Ufort_npc_component* ; // 0x280(0x08)
	struct Utask(:type)* ; // 0x288(0x08)
	struct FDelegate ; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	int64_t ; // 0x2a0(0x08)
	struct Fthreat_info ; // 0x2a8(0x38)
	OptionProperty ; // 0x2e0(0x39)
	char pad_319[0x7]; // 0x319(0x07)
	VerseDynamicProperty ; // 0x320(0x10)
	OptionProperty ; // 0x330(0x11)
	char pad_341[0x7]; // 0x341(0x07)
	VerseDynamicProperty ; // 0x348(0x10)
	VerseDynamicProperty ; // 0x358(0x10)
	struct FDelegate ; // 0x368(0x0c)
	enum class EVerseTrue ; // 0x374(0x01)
	char pad_375[0x3]; // 0x375(0x03)
	struct FDelegate ; // 0x378(0x0c)
	char pad_384[0x4]; // 0x384(0x04)
	VerseStringProperty ; // 0x388(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GetNewTargetPerception_L_Nfort__npc__component_M_N_Qthreat__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GetNewThreat_L_Nfort__npc__component_R
// Size: 0x280 (Inherited: 0x120)
struct Utask_companion_ai$GetNewThreat_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	enum class EVerseTrue ; // 0x169(0x01)
	char pad_16A[0x2]; // 0x16a(0x02)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	OptionProperty ; // 0x188(0x39)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct Ufort_npc_component* ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	struct Ftuple_L_R ; // 0x1e4(0x01)
	char pad_1E5[0x3]; // 0x1e5(0x03)
	int64_t ; // 0x1e8(0x08)
	struct Fthreat_info ; // 0x1f0(0x38)
	OptionProperty ; // 0x228(0x39)
	enum class EVerseTrue ; // 0x261(0x01)
	char pad_262[0x2]; // 0x262(0x02)
	struct FDelegate ; // 0x264(0x0c)
	VerseStringProperty ; // 0x270(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GetNewThreat_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GetObstacle_L_Nfort__npc__component_R
// Size: 0x1c9 (Inherited: 0x120)
struct Utask_companion_ai$GetObstacle_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x29)
	char pad_159[0x7]; // 0x159(0x07)
	struct Fobstacle_info ; // 0x160(0x28)
	struct Ufort_npc_component* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x29)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FDelegate ; // 0x1bc(0x0c)
	struct Ftuple_L_R ; // 0x1c8(0x01)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GetObstacle_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GetThreat_L_Nfort__npc__component_R
// Size: 0x1f9 (Inherited: 0x120)
struct Utask_companion_ai$GetThreat_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	char pad_169[0x7]; // 0x169(0x07)
	struct Fthreat_info ; // 0x170(0x38)
	struct Ufort_npc_component* ; // 0x1a8(0x08)
	OptionProperty ; // 0x1b0(0x39)
	char pad_1E9[0x3]; // 0x1e9(0x03)
	struct FDelegate ; // 0x1ec(0x0c)
	struct Ftuple_L_R ; // 0x1f8(0x01)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GetThreat_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R
// Size: 0x228 (Inherited: 0x120)
struct Utask_companion_ai$GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Utask(:type)* ; // 0x190(0x08)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	int64_t ; // 0x1a8(0x08)
	int64_t ; // 0x1b0(0x08)
	struct Ufort_npc_component* ; // 0x1b8(0x08)
	struct Utask(:type)* ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	int64_t ; // 0x1d8(0x08)
	struct Ufort_npc_component* ; // 0x1e0(0x08)
	struct Utask(:type)* ; // 0x1e8(0x08)
	struct FDelegate ; // 0x1f0(0x0c)
	struct Ftuple_L_R ; // 0x1fc(0x01)
	char pad_1FD[0x3]; // 0x1fd(0x03)
	int64_t ; // 0x200(0x08)
	enum class EVerseTrue ; // 0x208(0x01)
	char pad_209[0x3]; // 0x209(0x03)
	struct FDelegate ; // 0x20c(0x0c)
	VerseStringProperty ; // 0x218(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GoToAndAttackTask_L_Nfort__npc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R
// Size: 0x880 (Inherited: 0x120)
struct Utask_companion_ai$GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x128(0x48)
	char _RetVal : 1; // 0x170(0x01)
	char pad_170_1 : 7; // 0x170(0x01)
	char pad_171[0x7]; // 0x171(0x07)
	struct Fnavigation_parameters ; // 0x178(0x10)
	enum class EVerseTrue ; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	struct FDelegate ; // 0x18c(0x0c)
	VerseStringProperty ; // 0x198(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x1a8(0x10)
	struct FDelegate ; // 0x1b8(0x0c)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1c8(0x10)
	struct TArray<VerseStringProperty> ; // 0x1d8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x1e8(0x20)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	VerseStringProperty ; // 0x238(0x10)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	VerseStringProperty ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x278(0x10)
	int64_t ; // 0x288(0x08)
	int64_t ; // 0x290(0x08)
	VerseStringProperty ; // 0x298(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2a8(0x10)
	VerseStringProperty ; // 0x2b8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2c8(0x10)
	int64_t ; // 0x2d8(0x08)
	int64_t ; // 0x2e0(0x08)
	char ; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	VerseDynamicProperty ; // 0x2f0(0x10)
	VerseStringProperty ; // 0x300(0x10)
	int64_t ; // 0x310(0x08)
	int64_t ; // 0x318(0x08)
	VerseDynamicProperty ; // 0x320(0x10)
	char ; // 0x330(0x01)
	OptionProperty ; // 0x331(0x02)
	char pad_333[0x5]; // 0x333(0x05)
	int64_t ; // 0x338(0x08)
	struct Utask(:type)* ; // 0x340(0x08)
	struct FDelegate ; // 0x348(0x0c)
	char pad_354[0x4]; // 0x354(0x04)
	int64_t ; // 0x358(0x08)
	int64_t ; // 0x360(0x08)
	struct UEntity* ; // 0x368(0x08)
	OptionProperty ; // 0x370(0x08)
	enum class navigate_result ; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct Ufort_npc_component* ; // 0x380(0x08)
	struct Utask(:type)* ; // 0x388(0x08)
	struct FDelegate ; // 0x390(0x0c)
	char pad_39C[0x4]; // 0x39c(0x04)
	struct Ftuple_Lentity_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x3a0(0x20)
	OptionProperty ; // 0x3c0(0x11)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	int64_t ; // 0x3d8(0x08)
	VerseDynamicProperty ; // 0x3e0(0x10)
	OptionProperty ; // 0x3f0(0x11)
	char pad_401[0x7]; // 0x401(0x07)
	VerseDynamicProperty ; // 0x408(0x10)
	VerseDynamicProperty ; // 0x418(0x10)
	enum class EVerseTrue ; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	struct FDelegate ; // 0x42c(0x0c)
	VerseStringProperty ; // 0x438(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x448(0x10)
	struct FDelegate ; // 0x458(0x0c)
	char pad_464[0x4]; // 0x464(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x468(0x10)
	struct TArray<VerseStringProperty> ; // 0x478(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x488(0x20)
	VerseStringProperty ; // 0x4a8(0x10)
	VerseStringProperty ; // 0x4b8(0x10)
	struct FDelegate ; // 0x4c8(0x0c)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	VerseStringProperty ; // 0x4d8(0x10)
	struct FDelegate ; // 0x4e8(0x0c)
	char pad_4F4[0x4]; // 0x4f4(0x04)
	VerseStringProperty ; // 0x4f8(0x10)
	VerseStringProperty ; // 0x508(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x518(0x10)
	int64_t ; // 0x528(0x08)
	int64_t ; // 0x530(0x08)
	VerseStringProperty ; // 0x538(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x548(0x10)
	VerseStringProperty ; // 0x558(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x568(0x10)
	int64_t ; // 0x578(0x08)
	int64_t ; // 0x580(0x08)
	char ; // 0x588(0x01)
	char pad_589[0x7]; // 0x589(0x07)
	VerseDynamicProperty ; // 0x590(0x10)
	VerseStringProperty ; // 0x5a0(0x10)
	int64_t ; // 0x5b0(0x08)
	int64_t ; // 0x5b8(0x08)
	VerseDynamicProperty ; // 0x5c0(0x10)
	char ; // 0x5d0(0x01)
	enum class navigate_result ; // 0x5d1(0x01)
	char pad_5D2[0x6]; // 0x5d2(0x06)
	struct Ufort_npc_component* ; // 0x5d8(0x08)
	struct FDelegate ; // 0x5e0(0x0c)
	char pad_5EC[0x4]; // 0x5ec(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x5f0(0x30)
	OptionProperty ; // 0x620(0x11)
	char pad_631[0x7]; // 0x631(0x07)
	VerseDynamicProperty ; // 0x638(0x10)
	OptionProperty ; // 0x648(0x11)
	char pad_659[0x7]; // 0x659(0x07)
	VerseDynamicProperty ; // 0x660(0x10)
	VerseDynamicProperty ; // 0x670(0x10)
	enum class EVerseTrue ; // 0x680(0x01)
	char pad_681[0x3]; // 0x681(0x03)
	struct FDelegate ; // 0x684(0x0c)
	VerseStringProperty ; // 0x690(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x6a0(0x10)
	struct FDelegate ; // 0x6b0(0x0c)
	char pad_6BC[0x4]; // 0x6bc(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x6c0(0x10)
	struct TArray<VerseStringProperty> ; // 0x6d0(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x6e0(0x20)
	VerseStringProperty ; // 0x700(0x10)
	VerseStringProperty ; // 0x710(0x10)
	struct FDelegate ; // 0x720(0x0c)
	char pad_72C[0x4]; // 0x72c(0x04)
	VerseStringProperty ; // 0x730(0x10)
	struct FDelegate ; // 0x740(0x0c)
	char pad_74C[0x4]; // 0x74c(0x04)
	VerseStringProperty ; // 0x750(0x10)
	VerseStringProperty ; // 0x760(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x770(0x10)
	int64_t ; // 0x780(0x08)
	int64_t ; // 0x788(0x08)
	VerseStringProperty ; // 0x790(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x7a0(0x10)
	VerseStringProperty ; // 0x7b0(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x7c0(0x10)
	int64_t ; // 0x7d0(0x08)
	int64_t ; // 0x7d8(0x08)
	char ; // 0x7e0(0x01)
	char pad_7E1[0x7]; // 0x7e1(0x07)
	VerseDynamicProperty ; // 0x7e8(0x10)
	VerseStringProperty ; // 0x7f8(0x10)
	int64_t ; // 0x808(0x08)
	int64_t ; // 0x810(0x08)
	VerseDynamicProperty ; // 0x818(0x10)
	char ; // 0x828(0x01)
	char pad_829[0x7]; // 0x829(0x07)
	struct Utask(:type)* ; // 0x830(0x08)
	struct FDelegate ; // 0x838(0x0c)
	char pad_844[0x4]; // 0x844(0x04)
	struct Ftuple_Lfort__npc__component_M_Qentity_R ; // 0x848(0x10)
	int64_t ; // 0x858(0x08)
	enum class EVerseTrue ; // 0x860(0x01)
	char pad_861[0x3]; // 0x861(0x03)
	struct FDelegate ; // 0x864(0x0c)
	VerseStringProperty ; // 0x870(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$GoToPositionTask_L_Nfort__npc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x2f8 (Inherited: 0x120)
struct Utask_companion_ai$HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct UEntity* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x08)
	char  : 1; // 0x198(0x01)
	char pad_198_1 : 7; // 0x198(0x01)
	char pad_199[0x7]; // 0x199(0x07)
	struct Utask(:type)* ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x1b8(0x48)
	struct Fvector3 ; // 0x200(0x18)
	OptionProperty ; // 0x218(0x11)
	char pad_229[0x7]; // 0x229(0x07)
	struct Fnavigation_parameters ; // 0x230(0x10)
	int64_t ; // 0x240(0x08)
	OptionProperty ; // 0x248(0x02)
	char pad_24A[0x6]; // 0x24a(0x06)
	int64_t ; // 0x250(0x08)
	struct Utask(:type)* ; // 0x258(0x08)
	struct FDelegate ; // 0x260(0x0c)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct Ftuple_Lentity_Mfloat_R ; // 0x270(0x10)
	int64_t ; // 0x280(0x08)
	struct Ufort_npc_component* ; // 0x288(0x08)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	struct Ftuple_L_R ; // 0x2a4(0x01)
	char pad_2A5[0x3]; // 0x2a5(0x03)
	int64_t ; // 0x2a8(0x08)
	struct Uping_component* ; // 0x2b0(0x08)
	OptionProperty ; // 0x2b8(0x08)
	struct Uping_component* ; // 0x2c0(0x08)
	enum class EVerseTrue ; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	struct FDelegate ; // 0x2cc(0x0c)
	enum class EVerseTrue ; // 0x2d8(0x01)
	char pad_2D9[0x3]; // 0x2d9(0x03)
	struct FDelegate ; // 0x2dc(0x0c)
	VerseStringProperty ; // 0x2e8(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleBackToMeCommand_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleGoTo_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x4a0 (Inherited: 0x120)
struct Utask_companion_ai$HandleGoTo_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Utask(:type)* ; // 0x190(0x08)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct Ftuple_Lfort__npc__component_Mfloat_R ; // 0x1a8(0x10)
	int64_t ; // 0x1b8(0x08)
	VerseDynamicProperty ; // 0x1c0(0x10)
	OptionProperty ; // 0x1d0(0x11)
	char pad_1E1[0x7]; // 0x1e1(0x07)
	VerseDynamicProperty ; // 0x1e8(0x10)
	VerseDynamicProperty ; // 0x1f8(0x10)
	VerseDynamicProperty ; // 0x208(0x10)
	OptionProperty ; // 0x218(0x11)
	char pad_229[0x7]; // 0x229(0x07)
	VerseDynamicProperty ; // 0x230(0x10)
	VerseDynamicProperty ; // 0x240(0x10)
	VerseDynamicProperty ; // 0x250(0x10)
	OptionProperty ; // 0x260(0x11)
	char pad_271[0x7]; // 0x271(0x07)
	VerseDynamicProperty ; // 0x278(0x10)
	VerseDynamicProperty ; // 0x288(0x10)
	VerseDynamicProperty ; // 0x298(0x10)
	OptionProperty ; // 0x2a8(0x11)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	VerseDynamicProperty ; // 0x2c0(0x10)
	VerseDynamicProperty ; // 0x2d0(0x10)
	struct Utask(:type)* ; // 0x2e0(0x08)
	struct FDelegate ; // 0x2e8(0x0c)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x2f8(0x48)
	OptionProperty ; // 0x340(0x11)
	char pad_351[0x7]; // 0x351(0x07)
	struct Fnavigation_parameters ; // 0x358(0x10)
	int64_t ; // 0x368(0x08)
	OptionProperty ; // 0x370(0x02)
	char pad_372[0x2]; // 0x372(0x02)
	struct FDelegate ; // 0x374(0x0c)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x380(0x48)
	OptionProperty ; // 0x3c8(0x08)
	OptionProperty ; // 0x3d0(0x11)
	char pad_3E1[0x7]; // 0x3e1(0x07)
	struct Fnavigation_parameters ; // 0x3e8(0x10)
	struct FDelegate ; // 0x3f8(0x0c)
	char pad_404[0x4]; // 0x404(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x408(0x48)
	OptionProperty ; // 0x450(0x08)
	OptionProperty ; // 0x458(0x11)
	char pad_469[0x7]; // 0x469(0x07)
	struct Fnavigation_parameters ; // 0x470(0x10)
	enum class EVerseTrue ; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	struct FDelegate ; // 0x484(0x0c)
	VerseStringProperty ; // 0x490(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleGoTo_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x270 (Inherited: 0x120)
struct Utask_companion_ai$HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct UEntity* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x08)
	int64_t ; // 0x198(0x08)
	struct Utask(:type)* ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mentity_R ; // 0x1b8(0x30)
	int64_t ; // 0x1e8(0x08)
	struct Utask(:type)* ; // 0x1f0(0x08)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x208(0x40)
	int64_t ; // 0x248(0x08)
	enum class EVerseTrue ; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FDelegate ; // 0x254(0x0c)
	VerseStringProperty ; // 0x260(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleGoToCommand_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x2b0 (Inherited: 0x120)
struct Utask_companion_ai$HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct Fvector3 ; // 0x188(0x18)
	struct Fvector3 ; // 0x1a0(0x18)
	struct Uposition_component* ; // 0x1b8(0x08)
	OptionProperty ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	struct Ftuple_L_R ; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
	struct UEntity* ; // 0x1d8(0x08)
	OptionProperty ; // 0x1e0(0x08)
	int64_t ; // 0x1e8(0x08)
	struct Utask(:type)* ; // 0x1f0(0x08)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mentity_R ; // 0x208(0x30)
	int64_t ; // 0x238(0x08)
	struct Utask(:type)* ; // 0x240(0x08)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_R ; // 0x258(0x20)
	int64_t ; // 0x278(0x08)
	struct FDelegate ; // 0x280(0x0c)
	enum class EVerseTrue ; // 0x28c(0x01)
	char pad_28D[0x3]; // 0x28d(0x03)
	struct FDelegate ; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	VerseStringProperty ; // 0x2a0(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleHoldPositionCommand_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x6c0 (Inherited: 0x120)
struct Utask_companion_ai$HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x188(0x10)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1a8(0x10)
	struct TArray<VerseStringProperty> ; // 0x1b8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R ; // 0x1c8(0x40)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	VerseStringProperty ; // 0x238(0x10)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	VerseStringProperty ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct FDelegate ; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)
	VerseStringProperty ; // 0x288(0x10)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	VerseStringProperty ; // 0x2a8(0x10)
	VerseStringProperty ; // 0x2b8(0x10)
	VerseStringProperty ; // 0x2c8(0x10)
	VerseStringProperty ; // 0x2d8(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2e8(0x10)
	int64_t ; // 0x2f8(0x08)
	int64_t ; // 0x300(0x08)
	VerseStringProperty ; // 0x308(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x318(0x10)
	VerseStringProperty ; // 0x328(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x338(0x10)
	int64_t ; // 0x348(0x08)
	int64_t ; // 0x350(0x08)
	char ; // 0x358(0x01)
	char pad_359[0x7]; // 0x359(0x07)
	VerseDynamicProperty ; // 0x360(0x10)
	VerseStringProperty ; // 0x370(0x10)
	int64_t ; // 0x380(0x08)
	int64_t ; // 0x388(0x08)
	VerseDynamicProperty ; // 0x390(0x10)
	char ; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	VerseDynamicProperty ; // 0x3a8(0x10)
	OptionProperty ; // 0x3b8(0x11)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	VerseDynamicProperty ; // 0x3d0(0x10)
	VerseDynamicProperty ; // 0x3e0(0x10)
	struct Utask(:type)* ; // 0x3f0(0x08)
	struct FDelegate ; // 0x3f8(0x0c)
	char pad_404[0x4]; // 0x404(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x408(0x40)
	int64_t ; // 0x448(0x08)
	VerseDynamicProperty ; // 0x450(0x10)
	OptionProperty ; // 0x460(0x11)
	char pad_471[0x7]; // 0x471(0x07)
	VerseDynamicProperty ; // 0x478(0x10)
	VerseDynamicProperty ; // 0x488(0x10)
	struct FDelegate ; // 0x498(0x0c)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x4a8(0x40)
	VerseDynamicProperty ; // 0x4e8(0x10)
	OptionProperty ; // 0x4f8(0x11)
	char pad_509[0x7]; // 0x509(0x07)
	VerseDynamicProperty ; // 0x510(0x10)
	VerseDynamicProperty ; // 0x520(0x10)
	struct FDelegate ; // 0x530(0x0c)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x540(0x40)
	VerseDynamicProperty ; // 0x580(0x10)
	OptionProperty ; // 0x590(0x11)
	char pad_5A1[0x7]; // 0x5a1(0x07)
	VerseDynamicProperty ; // 0x5a8(0x10)
	VerseDynamicProperty ; // 0x5b8(0x10)
	struct FDelegate ; // 0x5c8(0x0c)
	char pad_5D4[0x4]; // 0x5d4(0x04)
	struct Ftuple_Lfort__npc__component_Mping__info_R ; // 0x5d8(0x40)
	VerseDynamicProperty ; // 0x618(0x10)
	OptionProperty ; // 0x628(0x11)
	char pad_639[0x7]; // 0x639(0x07)
	VerseDynamicProperty ; // 0x640(0x10)
	VerseDynamicProperty ; // 0x650(0x10)
	struct Uping_component* ; // 0x660(0x08)
	OptionProperty ; // 0x668(0x08)
	struct Uping_component* ; // 0x670(0x08)
	enum class EVerseTrue ; // 0x678(0x01)
	char pad_679[0x3]; // 0x679(0x03)
	struct FDelegate ; // 0x67c(0x0c)
	struct Ufort_npc_component* ; // 0x688(0x08)
	struct FDelegate ; // 0x690(0x0c)
	struct Ftuple_L_R ; // 0x69c(0x01)
	enum class EVerseTrue ; // 0x69d(0x01)
	char pad_69E[0x2]; // 0x69e(0x02)
	struct FDelegate ; // 0x6a0(0x0c)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	VerseStringProperty ; // 0x6b0(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleNPCCommand_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R
// Size: 0x4a0 (Inherited: 0x120)
struct Utask_companion_ai$HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_M_Qentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	enum class EVerseTrue ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	OptionProperty ; // 0x158(0x29)
	char pad_181[0x7]; // 0x181(0x07)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	int64_t ; // 0x1a0(0x08)
	int64_t ; // 0x1a8(0x08)
	struct Fobstacle_info ; // 0x1b0(0x28)
	OptionProperty ; // 0x1d8(0x29)
	enum class EVerseTrue ; // 0x201(0x01)
	char pad_202[0x2]; // 0x202(0x02)
	struct FDelegate ; // 0x204(0x0c)
	VerseStringProperty ; // 0x210(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x220(0x10)
	struct FDelegate ; // 0x230(0x0c)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x240(0x10)
	struct TArray<VerseStringProperty> ; // 0x250(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x260(0x20)
	VerseStringProperty ; // 0x280(0x10)
	VerseStringProperty ; // 0x290(0x10)
	struct FDelegate ; // 0x2a0(0x0c)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	VerseStringProperty ; // 0x2b0(0x10)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	VerseStringProperty ; // 0x2d0(0x10)
	VerseStringProperty ; // 0x2e0(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2f0(0x10)
	int64_t ; // 0x300(0x08)
	int64_t ; // 0x308(0x08)
	VerseStringProperty ; // 0x310(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x340(0x10)
	int64_t ; // 0x350(0x08)
	int64_t ; // 0x358(0x08)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	VerseDynamicProperty ; // 0x368(0x10)
	VerseStringProperty ; // 0x378(0x10)
	int64_t ; // 0x388(0x08)
	int64_t ; // 0x390(0x08)
	VerseDynamicProperty ; // 0x398(0x10)
	char ; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct UEntity* ; // 0x3b0(0x08)
	OptionProperty ; // 0x3b8(0x08)
	OptionProperty ; // 0x3c0(0x02)
	char  : 1; // 0x3c2(0x01)
	char pad_3C2_1 : 7; // 0x3c2(0x01)
	char pad_3C3[0x5]; // 0x3c3(0x05)
	struct UEntity* ; // 0x3c8(0x08)
	struct FDelegate ; // 0x3d0(0x0c)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct Utask(:type)* ; // 0x3e0(0x08)
	struct FDelegate ; // 0x3e8(0x0c)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	int64_t ; // 0x3f8(0x08)
	struct FDelegate ; // 0x400(0x0c)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct Ufort_npc_component* ; // 0x410(0x08)
	struct FDelegate ; // 0x418(0x0c)
	struct FDelegate ; // 0x424(0x0c)
	OptionProperty ; // 0x430(0x29)
	char pad_459[0x7]; // 0x459(0x07)
	struct Utask(:type)* ; // 0x460(0x08)
	struct FDelegate ; // 0x468(0x0c)
	char pad_474[0x4]; // 0x474(0x04)
	int64_t ; // 0x478(0x08)
	enum class EVerseTrue ; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	struct FDelegate ; // 0x484(0x0c)
	VerseStringProperty ; // 0x490(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleObstacleTask_L_Nfort__npc__component_M_N_Qentity_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R
// Size: 0x288 (Inherited: 0x120)
struct Utask_companion_ai$HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	char  : 1; // 0x188(0x01)
	char pad_188_1 : 7; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	struct UEntity* ; // 0x190(0x08)
	OptionProperty ; // 0x198(0x08)
	char  : 1; // 0x1a0(0x01)
	char pad_1A0_1 : 7; // 0x1a0(0x01)
	char pad_1A1[0x7]; // 0x1a1(0x07)
	struct Utask(:type)* ; // 0x1a8(0x08)
	struct FDelegate ; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct Ftuple_Lfort__npc__component_Mentity_R ; // 0x1c0(0x10)
	int64_t ; // 0x1d0(0x08)
	OptionProperty ; // 0x1d8(0x02)
	char pad_1DA[0x6]; // 0x1da(0x06)
	struct TArray<struct UEntity*> ; // 0x1e0(0x10)
	struct FDelegate ; // 0x1f0(0x0c)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	int64_t ; // 0x200(0x08)
	int64_t ; // 0x208(0x08)
	struct UEntity* ; // 0x210(0x08)
	char  : 1; // 0x218(0x01)
	char pad_218_1 : 7; // 0x218(0x01)
	char pad_219[0x3]; // 0x219(0x03)
	struct FDelegate ; // 0x21c(0x0c)
	struct Ftuple_Lfort__npc__component_Mentity_R ; // 0x228(0x10)
	OptionProperty ; // 0x238(0x02)
	char pad_23A[0x6]; // 0x23a(0x06)
	struct Uping_component* ; // 0x240(0x08)
	OptionProperty ; // 0x248(0x08)
	struct Uping_component* ; // 0x250(0x08)
	enum class EVerseTrue ; // 0x258(0x01)
	char pad_259[0x3]; // 0x259(0x03)
	struct FDelegate ; // 0x25c(0x0c)
	enum class EVerseTrue ; // 0x268(0x01)
	char pad_269[0x3]; // 0x269(0x03)
	struct FDelegate ; // 0x26c(0x0c)
	VerseStringProperty ; // 0x278(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleReviveCommand_L_Nfort__npc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HandleTarget_L_Nfort__npc__component_R
// Size: 0x708 (Inherited: 0x120)
struct Utask_companion_ai$HandleTarget_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	struct Fthreat_info ; // 0x130(0x38)
	struct Ufort_npc_component* ; // 0x168(0x08)
	OptionProperty ; // 0x170(0x39)
	char pad_1A9[0x3]; // 0x1a9(0x03)
	struct FDelegate ; // 0x1ac(0x0c)
	struct Ftuple_L_R ; // 0x1b8(0x01)
	enum class EVerseTrue ; // 0x1b9(0x01)
	char pad_1BA[0x2]; // 0x1ba(0x02)
	struct FDelegate ; // 0x1bc(0x0c)
	VerseStringProperty ; // 0x1c8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x1d8(0x10)
	struct FDelegate ; // 0x1e8(0x0c)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1f8(0x10)
	struct TArray<VerseStringProperty> ; // 0x208(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x218(0x20)
	VerseStringProperty ; // 0x238(0x10)
	VerseStringProperty ; // 0x248(0x10)
	struct FDelegate ; // 0x258(0x0c)
	char pad_264[0x4]; // 0x264(0x04)
	VerseStringProperty ; // 0x268(0x10)
	struct FDelegate ; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)
	VerseStringProperty ; // 0x288(0x10)
	VerseStringProperty ; // 0x298(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2a8(0x10)
	int64_t ; // 0x2b8(0x08)
	int64_t ; // 0x2c0(0x08)
	VerseStringProperty ; // 0x2c8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2d8(0x10)
	VerseStringProperty ; // 0x2e8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2f8(0x10)
	int64_t ; // 0x308(0x08)
	int64_t ; // 0x310(0x08)
	char ; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	VerseDynamicProperty ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	int64_t ; // 0x340(0x08)
	int64_t ; // 0x348(0x08)
	VerseDynamicProperty ; // 0x350(0x10)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	int64_t ; // 0x368(0x08)
	struct Utask(:type)* ; // 0x370(0x08)
	struct FDelegate ; // 0x378(0x0c)
	char pad_384[0x4]; // 0x384(0x04)
	int64_t ; // 0x388(0x08)
	struct Utask(:type)* ; // 0x390(0x08)
	struct FDelegate ; // 0x398(0x0c)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct Ftuple_Lfort__npc__component_M_Qthreat__info_R ; // 0x3a8(0x48)
	OptionProperty ; // 0x3f0(0x39)
	char pad_429[0x7]; // 0x429(0x07)
	int64_t ; // 0x430(0x08)
	VerseDynamicProperty ; // 0x438(0x10)
	OptionProperty ; // 0x448(0x11)
	char pad_459[0x7]; // 0x459(0x07)
	VerseDynamicProperty ; // 0x460(0x10)
	VerseDynamicProperty ; // 0x470(0x10)
	enum class EVerseTrue ; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	struct FDelegate ; // 0x484(0x0c)
	VerseStringProperty ; // 0x490(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x4a0(0x10)
	struct FDelegate ; // 0x4b0(0x0c)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x4c0(0x10)
	struct TArray<VerseStringProperty> ; // 0x4d0(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x4e0(0x20)
	VerseStringProperty ; // 0x500(0x10)
	VerseStringProperty ; // 0x510(0x10)
	struct FDelegate ; // 0x520(0x0c)
	char pad_52C[0x4]; // 0x52c(0x04)
	VerseStringProperty ; // 0x530(0x10)
	struct FDelegate ; // 0x540(0x0c)
	char pad_54C[0x4]; // 0x54c(0x04)
	VerseStringProperty ; // 0x550(0x10)
	VerseStringProperty ; // 0x560(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x570(0x10)
	int64_t ; // 0x580(0x08)
	int64_t ; // 0x588(0x08)
	VerseStringProperty ; // 0x590(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x5a0(0x10)
	VerseStringProperty ; // 0x5b0(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x5c0(0x10)
	int64_t ; // 0x5d0(0x08)
	int64_t ; // 0x5d8(0x08)
	char ; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	VerseDynamicProperty ; // 0x5e8(0x10)
	VerseStringProperty ; // 0x5f8(0x10)
	int64_t ; // 0x608(0x08)
	int64_t ; // 0x610(0x08)
	VerseDynamicProperty ; // 0x618(0x10)
	char ; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct Utask(:type)* ; // 0x630(0x08)
	struct FDelegate ; // 0x638(0x0c)
	char pad_644[0x4]; // 0x644(0x04)
	struct Ftuple_Lfort__npc__component_Mthreat__info_R ; // 0x648(0x40)
	int64_t ; // 0x688(0x08)
	int64_t ; // 0x690(0x08)
	struct Utask(:type)* ; // 0x698(0x08)
	struct FDelegate ; // 0x6a0(0x0c)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	int64_t ; // 0x6b0(0x08)
	struct Ufort_npc_component* ; // 0x6b8(0x08)
	struct Utask(:type)* ; // 0x6c0(0x08)
	struct FDelegate ; // 0x6c8(0x0c)
	char pad_6D4[0x4]; // 0x6d4(0x04)
	struct Fvector3 ; // 0x6d8(0x18)
	struct FDelegate ; // 0x6f0(0x0c)
	char pad_6FC[0x4]; // 0x6fc(0x04)
	int64_t ; // 0x700(0x08)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HandleTarget_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R
// Size: 0x224 (Inherited: 0x120)
struct Utask_companion_ai$HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mvector3_R __verse_0xB2CDDD72_Argument; // 0x128(0x20)
	struct Ufort_npc_component* ; // 0x148(0x08)
	struct Utask(:type)* ; // 0x150(0x08)
	struct FDelegate ; // 0x158(0x0c)
	char pad_164[0x4]; // 0x164(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x168(0x30)
	OptionProperty ; // 0x198(0x11)
	char pad_1A9[0x7]; // 0x1a9(0x07)
	struct Fnavigation_parameters ; // 0x1b0(0x10)
	int64_t ; // 0x1c0(0x08)
	int64_t ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	int64_t ; // 0x1e8(0x08)
	int64_t ; // 0x1f0(0x08)
	struct Utask(:type)* ; // 0x1f8(0x08)
	struct FDelegate ; // 0x200(0x0c)
	char pad_20C[0x4]; // 0x20c(0x04)
	int64_t ; // 0x210(0x08)
	struct FDelegate ; // 0x218(0x0c)

	int64_t Update(); // Function CompanionAI.task_companion_ai$HoldPositionCommand_L_Nfort__npc__component_M_Nvector3_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R
// Size: 0x2c0 (Inherited: 0x120)
struct Utask_companion_ai$LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	struct Fvector3 ; // 0x158(0x18)
	double ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	char pad_184[0x4]; // 0x184(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x188(0x10)
	double ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x1b0(0x10)
	double ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x1d8(0x10)
	int64_t ; // 0x1e8(0x08)
	struct Ufort_npc_component* ; // 0x1f0(0x08)
	struct Utask(:type)* ; // 0x1f8(0x08)
	struct FDelegate ; // 0x200(0x0c)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct Fvector3 ; // 0x210(0x18)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x238(0x30)
	int64_t ; // 0x268(0x08)
	struct Ufort_npc_component* ; // 0x270(0x08)
	struct Utask(:type)* ; // 0x278(0x08)
	struct FDelegate ; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	double ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x2a8(0x10)
	int64_t ; // 0x2b8(0x08)

	int64_t Update(); // Function CompanionAI.task_companion_ai$LookAroundTask_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$LookAtThreatTask_L_Nfort__npc__component_R
// Size: 0x358 (Inherited: 0x120)
struct Utask_companion_ai$LookAtThreatTask_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Fthreat_info ; // 0x150(0x38)
	struct Ufort_npc_component* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x39)
	char pad_1C9[0x3]; // 0x1c9(0x03)
	struct FDelegate ; // 0x1cc(0x0c)
	struct Ftuple_L_R ; // 0x1d8(0x01)
	char pad_1D9[0x7]; // 0x1d9(0x07)
	int64_t ; // 0x1e0(0x08)
	struct Utask(:type)* ; // 0x1e8(0x08)
	struct FDelegate ; // 0x1f0(0x0c)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	struct Ftuple_Lfort__npc__component_M_Qthreat__info_R ; // 0x200(0x48)
	OptionProperty ; // 0x248(0x39)
	char pad_281[0x7]; // 0x281(0x07)
	int64_t ; // 0x288(0x08)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	int64_t ; // 0x2a8(0x08)
	struct Ufort_npc_component* ; // 0x2b0(0x08)
	struct Utask(:type)* ; // 0x2b8(0x08)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	struct Fvector3 ; // 0x2d0(0x18)
	struct FDelegate ; // 0x2e8(0x0c)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	int64_t ; // 0x2f8(0x08)
	struct Ufort_npc_component* ; // 0x300(0x08)
	struct FDelegate ; // 0x308(0x0c)
	char pad_314[0x4]; // 0x314(0x04)
	struct Utask(:type)* ; // 0x318(0x08)
	struct FDelegate ; // 0x320(0x0c)
	char pad_32C[0x4]; // 0x32c(0x04)
	int64_t ; // 0x330(0x08)
	enum class EVerseTrue ; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	struct FDelegate ; // 0x33c(0x0c)
	VerseStringProperty ; // 0x348(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$LookAtThreatTask_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$OnDamagedBy_L_Nfort__npc__component_R
// Size: 0x1d8 (Inherited: 0x120)
struct Utask_companion_ai$OnDamagedBy_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	struct Fdamage_info _RetVal; // 0x130(0x40)
	enum class EVerseTrue ; // 0x170(0x01)
	char pad_171[0x3]; // 0x171(0x03)
	struct FDelegate ; // 0x174(0x0c)
	VerseStringProperty ; // 0x180(0x10)
	struct Ufort_npc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	int64_t ; // 0x1b0(0x08)
	enum class EVerseTrue ; // 0x1b8(0x01)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FDelegate ; // 0x1bc(0x0c)
	VerseStringProperty ; // 0x1c8(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$OnDamagedBy_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$ReviveCommand_L_Nfort__npc__component_M_Nentity_R
// Size: 0x328 (Inherited: 0x120)
struct Utask_companion_ai$ReviveCommand_L_Nfort__npc__component_M_Nentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	char _RetVal : 1; // 0x138(0x01)
	char pad_138_1 : 7; // 0x138(0x01)
	enum class EVerseTrue ; // 0x139(0x01)
	char pad_13A[0x2]; // 0x13a(0x02)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	OptionProperty ; // 0x158(0x08)
	struct UEntity* ; // 0x160(0x08)
	struct FDelegate ; // 0x168(0x0c)
	OptionProperty ; // 0x174(0x02)
	char  : 1; // 0x176(0x01)
	char pad_176_1 : 7; // 0x176(0x01)
	char pad_177[0x1]; // 0x177(0x01)
	struct Uhealth_component* ; // 0x178(0x08)
	OptionProperty ; // 0x180(0x08)
	OptionProperty ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	struct Ftuple_L_R ; // 0x19c(0x01)
	enum class EVerseTrue ; // 0x19d(0x01)
	char pad_19E[0x2]; // 0x19e(0x02)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	VerseStringProperty ; // 0x1b0(0x10)
	int64_t ; // 0x1c0(0x08)
	struct Utask(:type)* ; // 0x1c8(0x08)
	struct FDelegate ; // 0x1d0(0x0c)
	char pad_1DC[0x4]; // 0x1dc(0x04)
	int64_t ; // 0x1e0(0x08)
	char  : 1; // 0x1e8(0x01)
	char pad_1E8_1 : 7; // 0x1e8(0x01)
	char pad_1E9[0x7]; // 0x1e9(0x07)
	struct Utask(:type)* ; // 0x1f0(0x08)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	struct Ftuple_Lfort__npc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x208(0x48)
	struct Fvector3 ; // 0x250(0x18)
	OptionProperty ; // 0x268(0x08)
	OptionProperty ; // 0x270(0x11)
	char pad_281[0x7]; // 0x281(0x07)
	struct Fnavigation_parameters ; // 0x288(0x10)
	int64_t ; // 0x298(0x08)
	OptionProperty ; // 0x2a0(0x02)
	enum class action_result ; // 0x2a2(0x01)
	char pad_2A3[0x5]; // 0x2a3(0x05)
	struct Ufort_npc_component* ; // 0x2a8(0x08)
	struct FDelegate ; // 0x2b0(0x0c)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	VerseDynamicProperty ; // 0x2c0(0x10)
	OptionProperty ; // 0x2d0(0x11)
	char pad_2E1[0x7]; // 0x2e1(0x07)
	VerseDynamicProperty ; // 0x2e8(0x10)
	VerseDynamicProperty ; // 0x2f8(0x10)
	enum class EVerseTrue ; // 0x308(0x01)
	char pad_309[0x3]; // 0x309(0x03)
	struct FDelegate ; // 0x30c(0x0c)
	VerseStringProperty ; // 0x318(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$ReviveCommand_L_Nfort__npc__component_M_Nentity_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R
// Size: 0x418 (Inherited: 0x120)
struct Utask_companion_ai$SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mvector3_Mfloat_Mentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	enum class EVerseTrue ; // 0x158(0x01)
	char pad_159[0x3]; // 0x159(0x03)
	struct FDelegate ; // 0x15c(0x0c)
	VerseStringProperty ; // 0x168(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x178(0x10)
	struct FDelegate ; // 0x188(0x0c)
	char pad_194[0x4]; // 0x194(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x198(0x10)
	struct TArray<VerseStringProperty> ; // 0x1a8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x1b8(0x20)
	VerseStringProperty ; // 0x1d8(0x10)
	VerseStringProperty ; // 0x1e8(0x10)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x228(0x10)
	int64_t ; // 0x238(0x08)
	int64_t ; // 0x240(0x08)
	VerseStringProperty ; // 0x248(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x278(0x10)
	int64_t ; // 0x288(0x08)
	int64_t ; // 0x290(0x08)
	char ; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	VerseDynamicProperty ; // 0x2a0(0x10)
	VerseStringProperty ; // 0x2b0(0x10)
	int64_t ; // 0x2c0(0x08)
	int64_t ; // 0x2c8(0x08)
	VerseDynamicProperty ; // 0x2d0(0x10)
	char ; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)
	int64_t ; // 0x2e8(0x08)
	struct Utask(:type)* ; // 0x2f0(0x08)
	struct FDelegate ; // 0x2f8(0x0c)
	char pad_304[0x4]; // 0x304(0x04)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R ; // 0x308(0x40)
	struct FColor ; // 0x348(0x20)
	struct FDelegate ; // 0x368(0x0c)
	char pad_374[0x4]; // 0x374(0x04)
	int64_t ; // 0x378(0x08)
	struct Ufort_npc_component* ; // 0x380(0x08)
	enum class EVerseTrue ; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	struct FDelegate ; // 0x38c(0x0c)
	struct Ftuple_Lvector3_Mfloat_Mfloat_R ; // 0x398(0x28)
	struct Utask(:type)* ; // 0x3c0(0x08)
	struct FDelegate ; // 0x3c8(0x0c)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	int64_t ; // 0x3d8(0x08)
	enum class EVerseTrue ; // 0x3e0(0x01)
	char pad_3E1[0x3]; // 0x3e1(0x03)
	struct FDelegate ; // 0x3e4(0x0c)
	VerseStringProperty ; // 0x3f0(0x10)
	struct Ufort_npc_component* ; // 0x400(0x08)
	enum class EVerseTrue ; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	struct FDelegate ; // 0x40c(0x0c)

	int64_t Update(); // Function CompanionAI.task_companion_ai$SetLeashPosition_L_Nfort__npc__component_M_Nvector3_M_Nfloat_M_Nentity_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$ShootTargetService_L_Nfort__npc__component_M_Nfloat_R
// Size: 0x500 (Inherited: 0x120)
struct Utask_companion_ai$ShootTargetService_L_Nfort__npc__component_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lfort__npc__component_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	enum class EVerseTrue ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	char pad_16C[0x4]; // 0x16c(0x04)
	int64_t ; // 0x170(0x08)
	struct Fthreat_info ; // 0x178(0x38)
	struct Ufort_npc_component* ; // 0x1b0(0x08)
	OptionProperty ; // 0x1b8(0x39)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	struct FDelegate ; // 0x1f4(0x0c)
	struct Ftuple_L_R ; // 0x200(0x01)
	char pad_201[0x7]; // 0x201(0x07)
	int64_t ; // 0x208(0x08)
	struct Utask(:type)* ; // 0x210(0x08)
	struct FDelegate ; // 0x218(0x0c)
	char pad_224[0x4]; // 0x224(0x04)
	struct Ftuple_Lfort__npc__component_M_Qthreat__info_R ; // 0x228(0x48)
	OptionProperty ; // 0x270(0x39)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	int64_t ; // 0x2b0(0x08)
	struct Utask(:type)* ; // 0x2b8(0x08)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	int64_t ; // 0x2d0(0x08)
	VerseDynamicProperty ; // 0x2d8(0x10)
	OptionProperty ; // 0x2e8(0x11)
	char pad_2F9[0x7]; // 0x2f9(0x07)
	VerseDynamicProperty ; // 0x300(0x10)
	VerseDynamicProperty ; // 0x310(0x10)
	struct Fvector3 ; // 0x320(0x18)
	struct Ufort_npc_component* ; // 0x338(0x08)
	OptionProperty ; // 0x340(0x19)
	char pad_359[0x3]; // 0x359(0x03)
	struct FDelegate ; // 0x35c(0x0c)
	struct Ftuple_L_R ; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	OptionProperty ; // 0x370(0x09)
	char pad_379[0x7]; // 0x379(0x07)
	double ; // 0x380(0x08)
	struct FDelegate ; // 0x388(0x0c)
	char pad_394[0x4]; // 0x394(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x398(0x30)
	struct Fvector3 ; // 0x3c8(0x18)
	struct Uposition_component* ; // 0x3e0(0x08)
	OptionProperty ; // 0x3e8(0x08)
	struct FDelegate ; // 0x3f0(0x0c)
	struct Ftuple_L_R ; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	OptionProperty ; // 0x400(0x09)
	char pad_409[0x7]; // 0x409(0x07)
	double ; // 0x410(0x08)
	struct FDelegate ; // 0x418(0x0c)
	char pad_424[0x4]; // 0x424(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x428(0x30)
	struct Fvector3 ; // 0x458(0x18)
	struct FDelegate ; // 0x470(0x0c)
	enum class EVerseTrue ; // 0x47c(0x01)
	char pad_47D[0x3]; // 0x47d(0x03)
	struct FDelegate ; // 0x480(0x0c)
	char pad_48C[0x4]; // 0x48c(0x04)
	VerseStringProperty ; // 0x490(0x10)
	struct Ufort_npc_component* ; // 0x4a0(0x08)
	struct Utask(:type)* ; // 0x4a8(0x08)
	struct FDelegate ; // 0x4b0(0x0c)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	int64_t ; // 0x4c0(0x08)
	struct FDelegate ; // 0x4c8(0x0c)
	struct FDelegate ; // 0x4d4(0x0c)
	enum class EVerseTrue ; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	struct FDelegate ; // 0x4e4(0x0c)
	VerseStringProperty ; // 0x4f0(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$ShootTargetService_L_Nfort__npc__component_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$SprintService_L_Nfort__npc__component_R
// Size: 0x198 (Inherited: 0x120)
struct Utask_companion_ai$SprintService_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Ufort_npc_component* ; // 0x150(0x08)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	struct Ftuple_L_R ; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	int64_t ; // 0x170(0x08)
	enum class EVerseTrue ; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	struct FDelegate ; // 0x17c(0x0c)
	VerseStringProperty ; // 0x188(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$SprintService_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$TacticalSprintService_L_Nfort__npc__component_R
// Size: 0x198 (Inherited: 0x120)
struct Utask_companion_ai$TacticalSprintService_L_Nfort__npc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ufort_npc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Ufort_npc_component* ; // 0x150(0x08)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	struct Ftuple_L_R ; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	int64_t ; // 0x170(0x08)
	enum class EVerseTrue ; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	struct FDelegate ; // 0x17c(0x0c)
	VerseStringProperty ; // 0x188(0x10)

	int64_t Update(); // Function CompanionAI.task_companion_ai$TacticalSprintService_L_Nfort__npc__component_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R
// Size: 0x3d0 (Inherited: 0x120)
struct Utask_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lentity_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	OptionProperty ; // 0x138(0x08)
	struct UEntity* ; // 0x140(0x08)
	struct FDelegate ; // 0x148(0x0c)
	char pad_154[0x4]; // 0x154(0x04)
	struct Uposition_component* ; // 0x158(0x08)
	OptionProperty ; // 0x160(0x08)
	OptionProperty ; // 0x168(0x08)
	struct Fvector3 ; // 0x170(0x18)
	struct Uposition_component* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	struct Ftuple_L_R ; // 0x19c(0x01)
	char pad_19D[0x3]; // 0x19d(0x03)
	double ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x1b8(0x30)
	struct Fvector3 ; // 0x1e8(0x18)
	struct Uposition_component* ; // 0x200(0x08)
	struct FDelegate ; // 0x208(0x0c)
	struct Ftuple_L_R ; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	OptionProperty ; // 0x218(0x09)
	enum class EVerseTrue ; // 0x221(0x01)
	char pad_222[0x2]; // 0x222(0x02)
	struct FDelegate ; // 0x224(0x0c)
	VerseStringProperty ; // 0x230(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x240(0x10)
	struct FDelegate ; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x260(0x10)
	struct TArray<VerseStringProperty> ; // 0x270(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x280(0x20)
	VerseStringProperty ; // 0x2a0(0x10)
	VerseStringProperty ; // 0x2b0(0x10)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	VerseStringProperty ; // 0x2d0(0x10)
	VerseStringProperty ; // 0x2e0(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2f0(0x10)
	int64_t ; // 0x300(0x08)
	int64_t ; // 0x308(0x08)
	VerseStringProperty ; // 0x310(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x340(0x10)
	int64_t ; // 0x350(0x08)
	int64_t ; // 0x358(0x08)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	VerseDynamicProperty ; // 0x368(0x10)
	VerseStringProperty ; // 0x378(0x10)
	int64_t ; // 0x388(0x08)
	int64_t ; // 0x390(0x08)
	VerseDynamicProperty ; // 0x398(0x10)
	char ; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct Utask(:type)* ; // 0x3b0(0x08)
	struct FDelegate ; // 0x3b8(0x0c)
	char pad_3C4[0x4]; // 0x3c4(0x04)
	int64_t ; // 0x3c8(0x08)

	int64_t Update(); // Function CompanionAI.task_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xd67374
};

// VerseClass CompanionAI.task_fort_npc_component$RunDefaultBehavior
// Size: 0x12a (Inherited: 0x120)
struct Utask_fort_npc_component$RunDefaultBehavior : Utask(:type) {
	struct Ufort_npc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function CompanionAI.task_fort_npc_component$RunDefaultBehavior.Update // (Native|Public|HasOutParms) // @ game+0x6510090
};

// VerseClass CompanionAI.task_ping_component$OnNPCCommand
// Size: 0x169 (Inherited: 0x120)
struct Utask_ping_component$OnNPCCommand : Utask(:type) {
	struct Uping_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	OptionProperty _RetVal; // 0x130(0x39)

	int64_t Update(); // Function CompanionAI.task_ping_component$OnNPCCommand.Update // (Native|Public|HasOutParms) // @ game+0x6510060
};

