// Enum ContextualAnimation.EContextualAnimPointType
enum class EContextualAnimPointType : uint8 {
	FirstFrame = 0,
	SyncFrame = 1,
	LastFrame = 2,
	EContextualAnimPointType_MAX = 3
};

// Enum ContextualAnimation.EContextualAnimCriterionToConsider
enum class EContextualAnimCriterionToConsider : uint8 {
	All = 0,
	Spatial = 1,
	Other = 2,
	EContextualAnimCriterionToConsider_MAX = 3
};

// Enum ContextualAnimation.EContextualAnimCriterionType
enum class EContextualAnimCriterionType : uint8 {
	Spatial = 0,
	Other = 1,
	EContextualAnimCriterionType_MAX = 2
};

// Enum ContextualAnimation.EContextualAnimCriterionConeMode
enum class EContextualAnimCriterionConeMode : uint8 {
	ToPrimary = 0,
	FromPrimary = 1,
	EContextualAnimCriterionConeMode_MAX = 2
};

// Enum ContextualAnimation.EContextualAnimCriterionDistanceMode
enum class EContextualAnimCriterionDistanceMode : uint8 {
	Distance_3D = 0,
	Distance_2D = 1,
	Distance_MAX = 2
};

// Enum ContextualAnimation.EContextualAnimJoinRule
enum class EContextualAnimJoinRule : uint8 {
	Default = 0,
	Late = 1,
	EContextualAnimJoinRule_MAX = 2
};

// Enum ContextualAnimation.EContextualAnimIKTargetProvider
enum class EContextualAnimIKTargetProvider : uint8 {
	Autogenerated = 0,
	Bone = 1,
	EContextualAnimIKTargetProvider_MAX = 2
};

// ScriptStruct ContextualAnimation.ContextualAnimSet
// Size: 0x20 (Inherited: 0x00)
struct FContextualAnimSet {
	struct TArray<struct FContextualAnimTrack> Tracks; // 0x00(0x10)
	struct TArray<struct FTransform> ScenePivots; // 0x10(0x10)
};

// ScriptStruct ContextualAnimation.ContextualAnimTrack
// Size: 0xe0 (Inherited: 0x00)
struct FContextualAnimTrack {
	struct UAnimSequenceBase* Animation; // 0x00(0x08)
	float AnimMaxStartTime; // 0x08(0x04)
	bool bRequireFlyingMode; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FContextualAnimAlignmentTrackContainer AlignmentData; // 0x10(0x28)
	struct FContextualAnimAlignmentTrackContainer IKTargetData; // 0x38(0x28)
	struct TArray<struct UContextualAnimSelectionCriterion*> SelectionCriteria; // 0x60(0x10)
	struct FTransform MeshToScene; // 0x70(0x60)
	struct FName Role; // 0xd0(0x04)
	int32_t SectionIdx; // 0xd4(0x04)
	int32_t AnimSetIdx; // 0xd8(0x04)
	int32_t AnimTrackIdx; // 0xdc(0x04)
};

// ScriptStruct ContextualAnimation.ContextualAnimAlignmentTrackContainer
// Size: 0x28 (Inherited: 0x00)
struct FContextualAnimAlignmentTrackContainer {
	struct FAnimSequenceTrackContainer Tracks; // 0x00(0x20)
	float SampleInterval; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneSection
// Size: 0x78 (Inherited: 0x00)
struct FContextualAnimSceneSection {
	struct FName Name; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FContextualAnimSet> AnimSets; // 0x08(0x10)
	struct TMap<struct FName, struct FContextualAnimIKTargetDefContainer> RoleToIKTargetDefsMap; // 0x18(0x50)
	struct TArray<struct FContextualAnimSetPivotDefinition> AnimSetPivotDefinitions; // 0x68(0x10)
};

// ScriptStruct ContextualAnimation.ContextualAnimSetPivotDefinition
// Size: 0x14 (Inherited: 0x00)
struct FContextualAnimSetPivotDefinition {
	struct FName Name; // 0x00(0x04)
	struct FName Origin; // 0x04(0x04)
	bool bAlongClosestDistance; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FName OtherRole; // 0x0c(0x04)
	float Weight; // 0x10(0x04)
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefContainer
// Size: 0x10 (Inherited: 0x00)
struct FContextualAnimIKTargetDefContainer {
	struct TArray<struct FContextualAnimIKTargetDefinition> IKTargetDefs; // 0x00(0x10)
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefinition
// Size: 0x14 (Inherited: 0x00)
struct FContextualAnimIKTargetDefinition {
	struct FName GoalName; // 0x00(0x04)
	struct FName BoneName; // 0x04(0x04)
	enum class EContextualAnimIKTargetProvider Provider; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FName TargetRoleName; // 0x0c(0x04)
	struct FName TargetBoneName; // 0x10(0x04)
};

// ScriptStruct ContextualAnimation.ContextualAnimPoint
// Size: 0x70 (Inherited: 0x00)
struct FContextualAnimPoint {
	struct FTransform Transform; // 0x00(0x60)
	float Speed; // 0x60(0x04)
	int32_t SectionIdx; // 0x64(0x04)
	int32_t AnimSetIdx; // 0x68(0x04)
	int32_t AnimTrackIdx; // 0x6c(0x04)
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTarget
// Size: 0x70 (Inherited: 0x00)
struct FContextualAnimIKTarget {
	struct FName GoalName; // 0x00(0x04)
	float Alpha; // 0x04(0x04)
	char pad_8[0x8]; // 0x08(0x08)
	struct FTransform Transform; // 0x10(0x60)
};

// ScriptStruct ContextualAnimation.ContextualAnimRoleDefinition
// Size: 0x70 (Inherited: 0x00)
struct FContextualAnimRoleDefinition {
	struct FName Name; // 0x00(0x04)
	bool bIsCharacter; // 0x04(0x01)
	char pad_5[0xb]; // 0x05(0x0b)
	struct FTransform MeshToComponent; // 0x10(0x60)
};

// ScriptStruct ContextualAnimation.ContextualAnimSetPivot
// Size: 0x70 (Inherited: 0x00)
struct FContextualAnimSetPivot {
	struct FName Name; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
	struct FTransform Transform; // 0x10(0x60)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBindingContext
// Size: 0xc0 (Inherited: 0x00)
struct FContextualAnimSceneBindingContext {
	char pad_0[0xc0]; // 0x00(0xc0)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBinding
// Size: 0xe0 (Inherited: 0x00)
struct FContextualAnimSceneBinding {
	char pad_0[0xe0]; // 0x00(0xe0)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBindings
// Size: 0x10 (Inherited: 0x00)
struct FContextualAnimSceneBindings {
	struct TArray<struct FContextualAnimSceneBinding> Data; // 0x00(0x10)
};

// ScriptStruct ContextualAnimation.ContextualAnimStartSceneParams
// Size: 0x68 (Inherited: 0x00)
struct FContextualAnimStartSceneParams {
	struct TMap<struct FName, struct FContextualAnimSceneBindingContext> RoleToActorMap; // 0x00(0x50)
	int32_t SectionIdx; // 0x50(0x04)
	int32_t AnimSetIdx; // 0x54(0x04)
	char pad_58[0x10]; // 0x58(0x10)
};

// ScriptStruct ContextualAnimation.ContextualAnimQueryResult
// Size: 0xe0 (Inherited: 0x00)
struct FContextualAnimQueryResult {
	struct TWeakObjectPtr<struct UAnimMontage> Animation; // 0x00(0x08)
	char pad_8[0x8]; // 0x08(0x08)
	struct FTransform EntryTransform; // 0x10(0x60)
	struct FTransform SyncTransform; // 0x70(0x60)
	float AnimStartTime; // 0xd0(0x04)
	int32_t AnimSetIdx; // 0xd4(0x04)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// ScriptStruct ContextualAnimation.ContextualAnimQueryParams
// Size: 0x80 (Inherited: 0x00)
struct FContextualAnimQueryParams {
	struct TWeakObjectPtr<struct AActor> Querier; // 0x00(0x08)
	char pad_8[0x8]; // 0x08(0x08)
	struct FTransform QueryTransform; // 0x10(0x60)
	bool bComplexQuery; // 0x70(0x01)
	bool bFindAnimStartTime; // 0x71(0x01)
	char pad_72[0xe]; // 0x72(0x0e)
};

