// WidgetBlueprintGeneratedClass CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C
// Size: 0x468 (Inherited: 0x408)
struct UCrewSubscriptionErrorModal_C : UCrewSubscriptionErrorModal {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x408(0x08)
	struct UWidgetAnimation* ShowUp; // 0x410(0x08)
	struct UImage* Badge; // 0x418(0x08)
	struct UImage* Containment; // 0x420(0x08)
	struct USafeZone* ContentSZ; // 0x428(0x08)
	struct UImage* Glow; // 0x430(0x08)
	struct UImage* Image_BackgroundBottomBar; // 0x438(0x08)
	struct UImage* Lightbox_HitTestBlocker; // 0x440(0x08)
	struct USafeZone* MobileClose; // 0x448(0x08)
	struct UScrollBox* PrimaryScrollBox; // 0x450(0x08)
	struct UVerticalBox* VBox_PlatformSpecific; // 0x458(0x08)
	struct UImage* Wordmark; // 0x460(0x08)

	void BP_OnActivated(); // Function CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C.BP_OnActivated // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_CrewSubscriptionErrorModal(int32_t EntryPoint); // Function CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C.ExecuteUbergraph_CrewSubscriptionErrorModal // (Final|UbergraphFunction) // @ game+0xd67374
};

