// WidgetBlueprintGeneratedClass CrewBenefitsAnim.CrewBenefitsAnim_C
// Size: 0x4b0 (Inherited: 0x430)
struct UCrewBenefitsAnim_C : USubscriptionWelcomePreMessage {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x430(0x08)
	struct UWidgetAnimation* Intro; // 0x438(0x08)
	struct UImage* Image_arcs; // 0x440(0x08)
	struct UImage* Image_Arcs2; // 0x448(0x08)
	struct UImage* Image_Arcs3; // 0x450(0x08)
	struct UImage* Image_Arcs4; // 0x458(0x08)
	struct UImage* Image_BG_Crown; // 0x460(0x08)
	struct UImage* Image_BGPattern; // 0x468(0x08)
	struct UImage* Image_Blackout; // 0x470(0x08)
	struct UImage* Image_Cross; // 0x478(0x08)
	struct UImage* Image_FireAdd; // 0x480(0x08)
	struct UImage* Image_FireSolid; // 0x488(0x08)
	struct UImage* Image_Glow; // 0x490(0x08)
	struct UImage* Image_HazardGlow; // 0x498(0x08)
	struct UImage* Image_Lightning1; // 0x4a0(0x08)
	struct UImage* ; // 0x4a8(0x08)

	void EventPlayIntro(); // Function CrewBenefitsAnim.CrewBenefitsAnim_C.EventPlayIntro // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_CrewBenefitsAnim(int32_t EntryPoint); // Function CrewBenefitsAnim.CrewBenefitsAnim_C.ExecuteUbergraph_CrewBenefitsAnim // (Final|UbergraphFunction) // @ game+0xd67374
};

