// VerseStruct EpicGamesTemporary.Transform
// Size: 0x50 (Inherited: 0x00)
struct FTransform {
	struct Fvector3 __verse_0xA376805D_Scale; // 0x00(0x18)
	char pad_18[0x8]; // 0x18(0x08)
	struct FVerseRotation __verse_0x78C70FF3_Rotation; // 0x20(0x20)
	struct Fvector3 __verse_0x4E05BF15_Translation; // 0x40(0x18)
};

// VerseStruct EpicGamesTemporary.tuple_L_R
// Size: 0x01 (Inherited: 0x00)
struct Ftuple_L_R {
	char $StructPaddingDummy; // 0x00(0x01)
};

// VerseStruct EpicGamesTemporary.tuple_Lfloat_Mfloat_Mfloat_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lfloat_Mfloat_Mfloat_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	double __verse_0x7D844C3C_Elem1; // 0x08(0x08)
	double __verse_0x932BF92E_Elem2; // 0x10(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lfloat_Mvector2_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lfloat_Mvector2_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	struct Fvector2 __verse_0x7D844C3C_Elem1; // 0x08(0x10)
};

// VerseStruct EpicGamesTemporary.tuple_Lfloat_Mvector3_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lfloat_Mvector3_R {
	double __verse_0x18E3F084_Elem0; // 0x00(0x08)
	struct Fvector3 __verse_0x7D844C3C_Elem1; // 0x08(0x18)
};

// VerseStruct EpicGamesTemporary.tuple_Lint_Mvector2i_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lint_Mvector2i_R {
	int64_t __verse_0x18E3F084_Elem0; // 0x00(0x08)
	struct Fvector2i __verse_0x7D844C3C_Elem1; // 0x08(0x10)
};

// VerseStruct EpicGamesTemporary.tuple_Lrotation_Mfloat_R
// Size: 0x28 (Inherited: 0x00)
struct Ftuple_Lrotation_Mfloat_R {
	struct FVerseRotation __verse_0x18E3F084_Elem0; // 0x00(0x20)
	double __verse_0x7D844C3C_Elem1; // 0x20(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lrotation_Mrotation_Mfloat_R
// Size: 0x48 (Inherited: 0x00)
struct Ftuple_Lrotation_Mrotation_Mfloat_R {
	struct FVerseRotation __verse_0x18E3F084_Elem0; // 0x00(0x20)
	struct FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
	double __verse_0x932BF92E_Elem2; // 0x40(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lrotation_Mrotation_R
// Size: 0x40 (Inherited: 0x00)
struct Ftuple_Lrotation_Mrotation_R {
	struct FVerseRotation __verse_0x18E3F084_Elem0; // 0x00(0x20)
	struct FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
};

// VerseStruct EpicGamesTemporary.tuple_Lrotation_Mvector3_R
// Size: 0x38 (Inherited: 0x00)
struct Ftuple_Lrotation_Mvector3_R {
	struct FVerseRotation __verse_0x18E3F084_Elem0; // 0x00(0x20)
	struct Fvector3 __verse_0x7D844C3C_Elem1; // 0x20(0x18)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector2_Mfloat_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lvector2_Mfloat_R {
	struct Fvector2 __verse_0x18E3F084_Elem0; // 0x00(0x10)
	double __verse_0x7D844C3C_Elem1; // 0x10(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector2_Mvector2_Mfloat_R
// Size: 0x28 (Inherited: 0x00)
struct Ftuple_Lvector2_Mvector2_Mfloat_R {
	struct Fvector2 __verse_0x18E3F084_Elem0; // 0x00(0x10)
	struct Fvector2 __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	double __verse_0x932BF92E_Elem2; // 0x20(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector2_Mvector2_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lvector2_Mvector2_R {
	struct Fvector2 __verse_0x18E3F084_Elem0; // 0x00(0x10)
	struct Fvector2 __verse_0x7D844C3C_Elem1; // 0x10(0x10)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector2i_Mint_R
// Size: 0x18 (Inherited: 0x00)
struct Ftuple_Lvector2i_Mint_R {
	struct Fvector2i __verse_0x18E3F084_Elem0; // 0x00(0x10)
	int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector2i_Mvector2i_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lvector2i_Mvector2i_R {
	struct Fvector2i __verse_0x18E3F084_Elem0; // 0x00(0x10)
	struct Fvector2i __verse_0x7D844C3C_Elem1; // 0x10(0x10)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector3_Mfloat_R
// Size: 0x20 (Inherited: 0x00)
struct Ftuple_Lvector3_Mfloat_R {
	struct Fvector3 __verse_0x18E3F084_Elem0; // 0x00(0x18)
	double __verse_0x7D844C3C_Elem1; // 0x18(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector3_Mvector3_Mfloat_R
// Size: 0x38 (Inherited: 0x00)
struct Ftuple_Lvector3_Mvector3_Mfloat_R {
	struct Fvector3 __verse_0x18E3F084_Elem0; // 0x00(0x18)
	struct Fvector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	double __verse_0x932BF92E_Elem2; // 0x30(0x08)
};

// VerseStruct EpicGamesTemporary.tuple_Lvector3_Mvector3_R
// Size: 0x30 (Inherited: 0x00)
struct Ftuple_Lvector3_Mvector3_R {
	struct Fvector3 __verse_0x18E3F084_Elem0; // 0x00(0x18)
	struct Fvector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
};

// VerseStruct EpicGamesTemporary.vector2
// Size: 0x10 (Inherited: 0x00)
struct Fvector2 {
	double __verse_0x51F8FD2F_X; // 0x00(0x08)
	double __verse_0x349F4197_Y; // 0x08(0x08)
};

// VerseStruct EpicGamesTemporary.vector2i
// Size: 0x10 (Inherited: 0x00)
struct Fvector2i {
	int64_t __verse_0x51F8FD2F_X; // 0x00(0x08)
	int64_t __verse_0x349F4197_Y; // 0x08(0x08)
};

// VerseStruct EpicGamesTemporary.vector3
// Size: 0x18 (Inherited: 0x00)
struct Fvector3 {
	double __verse_0x51F8FD2F_X; // 0x00(0x08)
	double __verse_0x349F4197_Y; // 0x08(0x08)
	double __verse_0xDA30F485_Z; // 0x10(0x08)
};

