// AnimBlueprintGeneratedClass F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C
// Size: 0x6450 (Inherited: 0x6f0)
struct UF_MED_Prime_Skeleton_AnimBlueprint_C : UCustomCharacterPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6f0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x6f8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x700(0x08)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x708(0x1d0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8d8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8f8(0x20)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x918(0x470)
	struct FAnimNode_Constraint ; // 0xd88(0x108)
	struct FAnimNode_Constraint ; // 0xe90(0x108)
	struct FAnimNode_Constraint ; // 0xf98(0x108)
	struct FAnimNode_Constraint ; // 0x10a0(0x108)
	struct FAnimNode_Constraint ; // 0x11a8(0x108)
	struct FAnimNode_Constraint ; // 0x12b0(0x108)
	struct FAnimNode_Constraint ; // 0x13b8(0x108)
	struct FAnimNode_Constraint ; // 0x14c0(0x108)
	struct FAnimNode_ModifyBone ; // 0x15c8(0x128)
	struct FAnimNode_Constraint ; // 0x16f0(0x108)
	char pad_17F8[0x8]; // 0x17f8(0x08)
	struct FAnimNode_RigidBody ; // 0x1800(0x990)
	struct FAnimNode_AnimDynamics ; // 0x2190(0x510)
	struct FAnimNode_AnimDynamics ; // 0x26a0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x2bb0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x30c0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x35d0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x3ae0(0x510)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3ff0(0x510)
	struct FAnimNode_ModifyBone ; // 0x4500(0x128)
	char pad_4628[0x8]; // 0x4628(0x08)
	struct FAnimNode_RigidBody ; // 0x4630(0x990)
	struct FAnimNode_ModifyBone ; // 0x4fc0(0x128)
	struct FAnimNode_Constraint AnimGraphNode_Constraint; // 0x50e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x51f0(0x128)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5318(0x20)
	char pad_5338[0x8]; // 0x5338(0x08)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x5340(0x990)
	struct FGravityOverrideParamsStruct Gravity Override Params; // 0x5cd0(0x750)
	struct FVector Gravity Override; // 0x6420(0x18)
	double Neck Alpha; // 0x6438(0x08)
	double Head Tilt Alpha; // 0x6440(0x08)
	double Skydive Alpha; // 0x6448(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint(int32_t EntryPoint); // Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint // (Final|UbergraphFunction|HasDefaults) // @ game+0xd67374
};

