// RigVMMemoryStorageGeneratorClass F_MED_Prime_CtrlRig.RigVMMemory_Work
// Size: 0x19e0 (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	struct FControlRigExecuteContext ExecuteContext_; // 0x28(0x30)
	char pad_58[0x8]; // 0x58(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_Result; // 0x60(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_Result; // 0x80(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_4_Result; // 0x98(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_4_Transform; // 0xb0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_4_CachedBone; // 0x110(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_4_Value; // 0x120(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_BoneToModify__IO; // 0x140(0x10)
	float RigVMModel___MathFloatRemap_Result; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_Result; // 0x158(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_Transform; // 0x170(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_CachedBone; // 0x1d0(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_CachedSpace; // 0x1e0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_Value; // 0x1f0(0x20)
	float RigVMModel___MathFloatRemap_Value; // 0x210(0x04)
	char pad_214[0x4]; // 0x214(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_WorkData; // 0x218(0x10)
	char pad_228[0x8]; // 0x228(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_Result; // 0x230(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_Result; // 0x250(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_4_1_Result; // 0x268(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_Transform; // 0x280(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_CachedBone; // 0x2e0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_4_1_Value; // 0x2f0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_BoneToModify__IO; // 0x310(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_WorkData; // 0x320(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_2_Result; // 0x330(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_2_Result; // 0x350(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_BoneToModify__IO; // 0x368(0x10)
	float RigVMModel___MathFloatRemap_1_Result; // 0x378(0x04)
	float RigVMModel___MathFloatRemap_1_Value; // 0x37c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_2_WorkData; // 0x380(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_1_Result; // 0x390(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_1_Result; // 0x3b0(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_BoneToModify__IO; // 0x3c8(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_1_WorkData; // 0x3d8(0x10)
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_5_Result; // 0x3f0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_3_Result; // 0x410(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_4_2_Result; // 0x428(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_4_2_Transform; // 0x440(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_4_2_CachedBone; // 0x4a0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_4_2_Value; // 0x4b0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_4_BoneToModify__IO; // 0x4d0(0x10)
	float RigVMModel___MathFloatRemap_3_Result; // 0x4e0(0x04)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_2_Result; // 0x4e8(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_2_Transform; // 0x500(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_2_CachedBone; // 0x560(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_2_CachedSpace; // 0x570(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_2_Value; // 0x580(0x20)
	float RigVMModel___MathFloatRemap_3_Value; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_4_WorkData; // 0x5a8(0x10)
	char pad_5B8[0x8]; // 0x5b8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_3_Result; // 0x5c0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_2_Result; // 0x5e0(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_4_1_1_Result; // 0x5f8(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_1_Transform; // 0x610(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_1_CachedBone; // 0x670(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_4_1_1_Value; // 0x680(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_3_BoneToModify__IO; // 0x6a0(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_3_WorkData; // 0x6b0(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_2_3_Result; // 0x6c0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_2_1_Result; // 0x6e0(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_2_BoneToModify__IO; // 0x6f8(0x10)
	float RigVMModel___MathFloatRemap_1_2_Result; // 0x708(0x04)
	float RigVMModel___MathFloatRemap_1_2_Value; // 0x70c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_2_2_WorkData; // 0x710(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_1_2_Result; // 0x720(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_1_1_Result; // 0x740(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_2_BoneToModify__IO; // 0x758(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_1_2_WorkData; // 0x768(0x10)
	char pad_778[0x8]; // 0x778(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_3_Result; // 0x780(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_3_Result; // 0x7a0(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_Result; // 0x7b8(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_Transform; // 0x7d0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_CachedBone; // 0x830(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_Value; // 0x840(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_3_BoneToModify__IO; // 0x860(0x10)
	float RigVMModel___MathFloatRemap_2_Result; // 0x870(0x04)
	char pad_874[0x4]; // 0x874(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_1_Result; // 0x878(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_1_Transform; // 0x890(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_1_CachedBone; // 0x8f0(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_1_CachedSpace; // 0x900(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_1_Value; // 0x910(0x20)
	float RigVMModel___MathFloatRemap_2_Value; // 0x930(0x04)
	char pad_934[0x4]; // 0x934(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_3_WorkData; // 0x938(0x10)
	char pad_948[0x8]; // 0x948(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_2_Result; // 0x950(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_Result; // 0x970(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_1_Result; // 0x988(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_1_Transform; // 0x9a0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_1_CachedBone; // 0xa00(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_1_Value; // 0xa10(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_2_BoneToModify__IO; // 0xa30(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_2_WorkData; // 0xa40(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_2_2_Result; // 0xa50(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_1_Result; // 0xa70(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_1_BoneToModify__IO; // 0xa88(0x10)
	float RigVMModel___MathFloatRemap_1_1_Result; // 0xa98(0x04)
	float RigVMModel___MathFloatRemap_1_1_Value; // 0xa9c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_2_1_WorkData; // 0xaa0(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_1_1_Result; // 0xab0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_4_1_1_Result; // 0xad0(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_1_BoneToModify__IO; // 0xae8(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_1_1_WorkData; // 0xaf8(0x10)
	char pad_B08[0x8]; // 0xb08(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_3_1_Result; // 0xb10(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_3_Result; // 0xb30(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_3_Result; // 0xb48(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_3_Transform; // 0xb60(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_3_CachedBone; // 0xbc0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_3_Value; // 0xbd0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_3_1_BoneToModify__IO; // 0xbf0(0x10)
	float RigVMModel___MathFloatRemap_2_1_Result; // 0xc00(0x04)
	char pad_C04[0x4]; // 0xc04(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_1_2_Result; // 0xc08(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_1_1_Transform; // 0xc20(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_1_1_CachedBone; // 0xc80(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_1_1_CachedSpace; // 0xc90(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_1_2_Value; // 0xca0(0x20)
	float RigVMModel___MathFloatRemap_2_1_Value; // 0xcc0(0x04)
	char pad_CC4[0x4]; // 0xcc4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_3_1_WorkData; // 0xcc8(0x10)
	char pad_CD8[0x8]; // 0xcd8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_2_1_Result; // 0xce0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_2_Result; // 0xd00(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_2_2_Result; // 0xd18(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_2_2_Transform; // 0xd30(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_2_2_CachedBone; // 0xd90(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_2_2_Value; // 0xda0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_2_1_BoneToModify__IO; // 0xdc0(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_2_1_WorkData; // 0xdd0(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_2_2_1_Result; // 0xde0(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_1_Result; // 0xe00(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_1_1_BoneToModify__IO; // 0xe18(0x10)
	float RigVMModel___MathFloatRemap_1_1_1_Result; // 0xe28(0x04)
	float RigVMModel___MathFloatRemap_1_1_1_Value; // 0xe2c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_2_1_1_WorkData; // 0xe30(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_1_1_1_Result; // 0xe40(0x20)
	struct FVector RigVMModel___MathVectorAdd_2_Result; // 0xe60(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_1_1_BoneToModify__IO; // 0xe78(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_1_1_1_WorkData; // 0xe88(0x10)
	char pad_E98[0x8]; // 0xe98(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_Result; // 0xea0(0x20)
	struct FVector RigVMModel___MathVectorAdd_3_Result; // 0xec0(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_3_Result; // 0xed8(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_3_Transform; // 0xef0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_3_CachedBone; // 0xf50(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_3_Value; // 0xf60(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_BoneToModify__IO; // 0xf80(0x10)
	float RigVMModel___MathFloatRemap_4_1_Result; // 0xf90(0x04)
	float RigVMModel___MathFloatAbs_Result; // 0xf94(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_Result; // 0xf98(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_Transform; // 0xfb0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_CachedBone; // 0x1010(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_CachedSpace; // 0x1020(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_Value; // 0x1030(0x20)
	float RigVMModel___MathFloatAbs_Value; // 0x1050(0x04)
	char pad_1054[0x4]; // 0x1054(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_5_1_WorkData; // 0x1058(0x10)
	char pad_1068[0x8]; // 0x1068(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_4_1_1_Result; // 0x1070(0x20)
	struct FVector RigVMModel___MathVectorAdd_1_1_Result; // 0x1090(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_1_1_Result; // 0x10a8(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_1_1_Transform; // 0x10c0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_1_1_CachedBone; // 0x1120(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_1_1_Value; // 0x1130(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_BoneToModify__IO; // 0x1150(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_4_1_WorkData; // 0x1160(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_Result; // 0x1170(0x20)
	struct FVector RigVMModel___MathVectorAdd_Result; // 0x1190(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_Result; // 0x11a8(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_Transform; // 0x11c0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_CachedBone; // 0x1220(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_Value; // 0x1230(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_BoneToModify__IO; // 0x1250(0x10)
	float RigVMModel___MathFloatRemap_4_Result; // 0x1260(0x04)
	float RigVMModel___MathFloatAbs_1_Result; // 0x1264(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_3_Result; // 0x1268(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_3_Transform; // 0x1280(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_CachedBone; // 0x12e0(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_CachedSpace; // 0x12f0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_Value; // 0x1300(0x20)
	float RigVMModel___MathFloatAbs_1_Value; // 0x1320(0x04)
	char pad_1324[0x4]; // 0x1324(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_5_WorkData; // 0x1328(0x10)
	char pad_1338[0x8]; // 0x1338(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_4_1_Result; // 0x1340(0x20)
	struct FVector RigVMModel___MathVectorAdd_1_Result; // 0x1360(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_1_Result; // 0x1378(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_1_Transform; // 0x1390(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_1_CachedBone; // 0x13f0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_1_Value; // 0x1400(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_BoneToModify__IO; // 0x1420(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_4_WorkData; // 0x1430(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_Result; // 0x1440(0x20)
	struct FVector RigVMModel___MathVectorAdd_3_1_Result; // 0x1460(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_3_1_Result; // 0x1478(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_3_1_Transform; // 0x1490(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_3_1_CachedBone; // 0x14f0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_3_1_Value; // 0x1500(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_1_BoneToModify__IO; // 0x1520(0x10)
	float RigVMModel___MathFloatRemap_4_1_1_Result; // 0x1530(0x04)
	float RigVMModel___MathFloatAbs_2_Result; // 0x1534(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_1_Result; // 0x1538(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_Transform; // 0x1550(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_CachedBone; // 0x15b0(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_CachedSpace; // 0x15c0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_1_Value; // 0x15d0(0x20)
	float RigVMModel___MathFloatAbs_2_Value; // 0x15f0(0x04)
	char pad_15F4[0x4]; // 0x15f4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_5_1_1_WorkData; // 0x15f8(0x10)
	char pad_1608[0x8]; // 0x1608(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_4_1_1_1_Result; // 0x1610(0x20)
	struct FVector RigVMModel___MathVectorAdd_1_1_1_Result; // 0x1630(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_1_1_1_Result; // 0x1648(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_Transform; // 0x1660(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_CachedBone; // 0x16c0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_1_1_1_Value; // 0x16d0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_1_BoneToModify__IO; // 0x16f0(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_4_1_1_WorkData; // 0x1700(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_1_Result; // 0x1710(0x20)
	struct FVector RigVMModel___MathVectorAdd_3_1_1_Result; // 0x1730(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_3_1_1_Result; // 0x1748(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_3_1_1_Transform; // 0x1760(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_3_1_1_CachedBone; // 0x17c0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_3_1_1_Value; // 0x17d0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_1_1_BoneToModify__IO; // 0x17f0(0x10)
	float RigVMModel___MathFloatRemap_4_1_1_1_Result; // 0x1800(0x04)
	float RigVMModel___MathFloatAbs_2_1_Result; // 0x1804(0x04)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_1_1_Result; // 0x1808(0x18)
	struct FTransform RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_1_Transform; // 0x1820(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_1_CachedBone; // 0x1880(0x10)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_1_CachedSpace; // 0x1890(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_1_1_Value; // 0x18a0(0x20)
	float RigVMModel___MathFloatAbs_2_1_Value; // 0x18c0(0x04)
	char pad_18C4[0x4]; // 0x18c4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_5_1_1_1_WorkData; // 0x18c8(0x10)
	char pad_18D8[0x8]; // 0x18d8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_1_4_1_1_1_1_Result; // 0x18e0(0x20)
	struct FVector RigVMModel___MathVectorAdd_1_1_1_1_Result; // 0x1900(0x18)
	struct FVector RigVMModel___MathQuaternionToEuler_4_1_1_1_1_Result; // 0x1918(0x18)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_1_Transform; // 0x1930(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_1_CachedBone; // 0x1990(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_4_1_1_1_1_Value; // 0x19a0(0x20)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_1_1_BoneToModify__IO; // 0x19c0(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> RigVMModel___ModifyBoneTransforms_1_4_1_1_1_WorkData; // 0x19d0(0x10)
};

// RigVMMemoryStorageGeneratorClass F_MED_Prime_CtrlRig.RigVMMemory_Literal
// Size: 0x410 (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_BoneToModify__Const; // 0x28(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_4_Bone__Const; // 0x38(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_GetInitialBoneTransform_2_4_Space__Const; // 0x3c(0x01)
	enum class EEulerRotationOrder RigVMModel___MathQuaternionToEuler_4_2_4_RotationOrder__Const; // 0x3d(0x01)
	char pad_3E[0x2]; // 0x3e(0x02)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_B__Const; // 0x40(0x18)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_Bone__Const; // 0x58(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_Space__Const; // 0x5c(0x04)
	float RigVMModel___MathFloatRemap_SourceMinimum__Const; // 0x60(0x04)
	float RigVMModel___MathFloatRemap_SourceMaximum__Const; // 0x64(0x04)
	float RigVMModel___MathFloatRemap_TargetMinimum__Const; // 0x68(0x04)
	float RigVMModel___MathFloatRemap_TargetMaximum__Const; // 0x6c(0x04)
	char RigVMModel___MathFloatRemap_bClamp__Const : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	enum class EControlRigModifyBoneMode RigVMModel___ModifyBoneTransforms_Mode__Const; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_BoneToModify__Const; // 0x78(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_Bone__Const; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_B__Const; // 0x90(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_BoneToModify__Const; // 0xa8(0x10)
	float RigVMModel___MathFloatRemap_1_SourceMinimum__Const; // 0xb8(0x04)
	float RigVMModel___MathFloatRemap_1_SourceMaximum__Const; // 0xbc(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_BoneToModify__Const; // 0xc0(0x10)
	struct FVector RigVMModel___MathVectorAdd_2_4_2_1_1_B__Const; // 0xd0(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_4_BoneToModify__Const; // 0xe8(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_4_2_Bone__Const; // 0xf8(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_2_Bone__Const; // 0xfc(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_2_Space__Const; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_3_BoneToModify__Const; // 0x108(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_4_1_1_Bone__Const; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_2_BoneToModify__Const; // 0x120(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_2_BoneToModify__Const; // 0x130(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_3_BoneToModify__Const; // 0x140(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_Bone__Const; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FVector RigVMModel___MathVectorAdd_2_4_3_B__Const; // 0x158(0x18)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_1_Bone__Const; // 0x170(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_1_Space__Const; // 0x174(0x04)
	float RigVMModel___MathFloatRemap_2_SourceMinimum__Const; // 0x178(0x04)
	float RigVMModel___MathFloatRemap_2_SourceMaximum__Const; // 0x17c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_2_BoneToModify__Const; // 0x180(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_1_Bone__Const; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_1_BoneToModify__Const; // 0x198(0x10)
	struct FVector RigVMModel___MathVectorAdd_2_4_1_B__Const; // 0x1a8(0x18)
	float RigVMModel___MathFloatRemap_1_1_SourceMinimum__Const; // 0x1c0(0x04)
	float RigVMModel___MathFloatRemap_1_1_SourceMaximum__Const; // 0x1c4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_1_BoneToModify__Const; // 0x1c8(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_3_1_BoneToModify__Const; // 0x1d8(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_3_Bone__Const; // 0x1e8(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_1_1_Bone__Const; // 0x1ec(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_1_1_Space__Const; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_2_1_BoneToModify__Const; // 0x1f8(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_2_2_Bone__Const; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_2_1_1_BoneToModify__Const; // 0x210(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_1_1_1_BoneToModify__Const; // 0x220(0x10)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_BoneToModify__Const; // 0x230(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_3_Bone__Const; // 0x240(0x04)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_Space__Const; // 0x244(0x04)
	float RigVMModel___MathFloatRemap_4_1_SourceMinimum__Const; // 0x248(0x04)
	float RigVMModel___MathFloatRemap_4_1_SourceMaximum__Const; // 0x24c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_BoneToModify__Const; // 0x250(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_1_1_Bone__Const; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_BoneToModify__Const; // 0x268(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_Bone__Const; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct FVector RigVMModel___MathVectorAdd_B__Const; // 0x280(0x18)
	float RigVMModel___MathFloatRemap_4_SourceMinimum__Const; // 0x298(0x04)
	float RigVMModel___MathFloatRemap_4_SourceMaximum__Const; // 0x29c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_BoneToModify__Const; // 0x2a0(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_1_Bone__Const; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct FVector RigVMModel___MathVectorAdd_1_B__Const; // 0x2b8(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_1_BoneToModify__Const; // 0x2d0(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_3_1_Bone__Const; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct FVector RigVMModel___MathVectorAdd_3_1_B__Const; // 0x2e8(0x18)
	struct FName RigVMModel___RigUnit_GetRelativeBoneTransform_3_1_1_Space__Const; // 0x300(0x04)
	float RigVMModel___MathFloatRemap_4_1_1_SourceMinimum__Const; // 0x304(0x04)
	float RigVMModel___MathFloatRemap_4_1_1_SourceMaximum__Const; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_1_BoneToModify__Const; // 0x310(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_Bone__Const; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct FVector RigVMModel___MathVectorAdd_1_1_1_B__Const; // 0x328(0x18)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_5_1_1_1_BoneToModify__Const; // 0x340(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_3_1_1_Bone__Const; // 0x350(0x04)
	float RigVMModel___MathFloatRemap_4_1_1_1_SourceMinimum__Const; // 0x354(0x04)
	float RigVMModel___MathFloatRemap_4_1_1_1_SourceMaximum__Const; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
	struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> RigVMModel___ModifyBoneTransforms_1_4_1_1_1_BoneToModify__Const; // 0x360(0x10)
	struct FName RigVMModel___RigUnit_GetInitialBoneTransform_1_1_1_1_Bone__Const; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct FVector RigVMModel___MathVectorAdd_1_1_1_1_B__Const; // 0x378(0x18)
	float RigVMModel___DebugHierarchy_1_Scale__Const; // 0x390(0x04)
	struct FLinearColor RigVMModel___DebugHierarchy_1_Color__Const; // 0x394(0x10)
	float RigVMModel___DebugHierarchy_1_Thickness__Const; // 0x3a4(0x04)
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct FTransform RigVMModel___DebugHierarchy_1_WorldOffset__Const; // 0x3b0(0x60)
};

// ControlRigBlueprintGeneratedClass F_MED_Prime_CtrlRig.F_MED_Prime_CtrlRig_C
// Size: 0x558 (Inherited: 0x558)
struct UF_MED_Prime_CtrlRig_C : UControlRig {
};

