// ScriptStruct Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1b8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct FName ; // 0x40(0x04)
	struct FName ; // 0x44(0x04)
	int32_t ; // 0x48(0x04)
	struct FName ; // 0x4c(0x04)
	int32_t ; // 0x50(0x04)
	enum class EBlendListTransitionType ; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	struct TArray<float> ; // 0x58(0x10)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct UBlendSpace* ; // 0x70(0x08)
	struct FInputScaleBiasClampConstants ; // 0x78(0x2c)
	float ; // 0xa4(0x04)
	enum class EAnimSyncMethod ; // 0xa8(0x01)
	enum class EAnimGroupRole ; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)
	struct UBlendSpace* ; // 0xb0(0x08)
	struct UBlendSpace* ; // 0xb8(0x08)
	bool ; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	float ; // 0xc4(0x04)
	enum class EAnimSyncMethod ; // 0xc8(0x01)
	enum class EAnimGroupRole ; // 0xc9(0x01)
	char pad_CA[0x2]; // 0xca(0x02)
	struct FName ; // 0xcc(0x04)
	struct UBlendProfile* ; // 0xd0(0x08)
	struct UCurveFloat* ; // 0xd8(0x08)
	bool ; // 0xe0(0x01)
	enum class EAlphaBlendOption ; // 0xe1(0x01)
	enum class EBlendListTransitionType ; // 0xe2(0x01)
	char pad_E3[0x5]; // 0xe3(0x05)
	struct TArray<float> ; // 0xe8(0x10)
	struct FName ; // 0xf8(0x04)
	struct FName ; // 0xfc(0x04)
	int32_t ; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct FAnimNodeFunctionRef ; // 0x108(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x120(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1a0(0x18)
};

// ScriptStruct Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x89 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	float ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	bool ; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	bool ; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float ; // 0x3c(0x04)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	bool ; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	bool ; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	float ; // 0x78(0x04)
	float ; // 0x7c(0x04)
	float ; // 0x80(0x04)
	float ; // 0x84(0x04)
	bool ; // 0x88(0x01)
};

