// Enum FortniteGame.EFortMutatorOverridePriority
enum class EFortMutatorOverridePriority : uint8 {
	None = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	EFortMutatorOverridePriority_MAX = 4
};

// Enum FortniteGame.EAthenaGamePhase
enum class EAthenaGamePhase : uint8 {
	None = 0,
	Setup = 1,
	Warmup = 2,
	Aircraft = 3,
	SafeZones = 4,
	EndGame = 5,
	Count = 6,
	EAthenaGamePhase_MAX = 7
};

// Enum FortniteGame.EAthenaGamePhaseStep
enum class EAthenaGamePhaseStep : uint8 {
	None = 0,
	Setup = 1,
	Warmup = 2,
	GetReady = 3,
	BusLocked = 4,
	BusFlying = 5,
	StormForming = 6,
	StormHolding = 7,
	StormShrinking = 8,
	Countdown = 9,
	FinalCountdown = 10,
	EndGame = 11,
	Count = 12,
	EAthenaGamePhaseStep_MAX = 13
};

// Enum FortniteGame.EAthenaGameMessageDataFlags
enum class EAthenaGameMessageDataFlags : uint8 {
	None = 0,
	DisableCreativeExclamation = 1,
	EAthenaGameMessageDataFlags_MAX = 2
};

// Enum FortniteGame.EAthenaGameMsgType
enum class EAthenaGameMsgType : uint8 {
	None = 0,
	DefaultIntro = 1,
	DefaultMessage = 2,
	DefaultCriticalMessage = 3,
	CommIntro = 4,
	CommMessage = 5,
	CommCriticalMessage = 6,
	CornerIntro = 7,
	CornerMessage = 8,
	CornerCriticalMessage = 9,
	RespawnTurningOffWarning = 10,
	RespawnOffWarning = 11,
	CenterMessage = 12,
	CenterImportantMessage = 13,
	CenterCriticalMessage = 14,
	EAthenaGameMsgType_MAX = 15
};

// Enum FortniteGame.EUraniumRoundPhase
enum class EUraniumRoundPhase : uint8 {
	None = 0,
	EndOfRoundStart = 1,
	ShowRoundEnd = 2,
	HideRoundEnd = 3,
	FadeOut = 4,
	SetupForNextRound = 5,
	ShowRoundIntro = 6,
	ShowPOICamera = 7,
	PerkSelect = 8,
	RoundActive = 9,
	FadeIn = 10,
	EndOfRoundFinish = 11,
	FadeBeforeReleasePlayerIntoGameplay = 12,
	ReleasePlayersIntoGameplay = 13,
	EndGame = 14,
	MAX = 15
};

// Enum FortniteGame.EUraniumEventId
enum class EUraniumEventId : uint8 {
	Intro = 0,
	CartBecomesPushable = 1,
	CheckPointReached = 2,
	NearCheckPoint = 3,
	NearFinalCheckPoint = 4,
	TimeIsLow = 5,
	TimeIsExtraLow = 6,
	OvertimeStarted = 7,
	RoundEnd_PushersWin = 8,
	RoundEnd_DefendersWin = 9,
	RoundStart = 10,
	GameEnded_AllRoundsPlayed = 11,
	GameEndedEarly_BlowOut = 12,
	GameEndedEarly_OutNumbered = 13,
	EUraniumEventId_MAX = 14
};

// Enum FortniteGame.EUraniumCartMovementRuleOnNewRound
enum class EUraniumCartMovementRuleOnNewRound : uint8 {
	NoChange = 0,
	MoveToNextCheckpoint = 1,
	MoveToStartOfNewSpline = 2,
	MoveToRandomCheckPointOfNewSpline = 3,
	MoveToNextCheckPointOfNewSpline = 4,
	EUraniumCartMovementRuleOnNewRound_MAX = 5
};

// Enum FortniteGame.EUraniumRoundEndCondition
enum class EUraniumRoundEndCondition : uint8 {
	RanOutOfTime_Or_CheckpointReached = 0,
	RanOutOfTime_Or_LastCheckpointReached = 1,
	RanOutOfTime_Or_MAX = 2
};

// Enum FortniteGame.EFortItemType
enum class EFortItemType : uint8 {
	WorldItem = 0,
	Ammo = 1,
	Badge = 2,
	BackpackPickup = 3,
	BuildingPiece = 4,
	CharacterPart = 5,
	Consumable = 6,
	Deco = 7,
	EditTool = 8,
	Ingredient = 9,
	ItemCache = 10,
	Food = 11,
	Gadget = 12,
	AthenaGadget = 13,
	HomebaseGadget = 14,
	BattleLabDevice = 15,
	SpyTechPerk = 16,
	HeroAbility = 17,
	MissionItem = 18,
	Trap = 19,
	MultiItem = 20,
	Weapon = 21,
	WeaponMelee = 22,
	WeaponRanged = 23,
	WeaponHarvest = 24,
	WeaponCreativePhone = 25,
	WeaponMod = 26,
	WorldResource = 27,
	CreativeUserPrefab = 28,
	CreativePlayset = 29,
	Vehicle = 30,
	Npc = 31,
	AccountItem = 32,
	AccountResource = 33,
	CollectedResource = 34,
	Alteration = 35,
	CardPack = 36,
	Currency = 37,
	Hero = 38,
	Schematic = 39,
	Worker = 40,
	TeamPerk = 41,
	PlayerTech = 42,
	PlayerAugment = 43,
	Token = 44,
	DailyRewardScheduleToken = 45,
	CodeToken = 46,
	Stat = 47,
	Buff = 48,
	BuffCredit = 49,
	Quest = 50,
	Accolades = 51,
	FriendChest = 52,
	MedalsPunchCard = 53,
	RepeatableDailiesCard = 54,
	ChallengeBundle = 55,
	ChallengeBundleSchedule = 56,
	ChallengeBundleCompletionToken = 57,
	GameplayModifier = 58,
	Outpost = 59,
	HomebaseNode = 60,
	Defender = 61,
	ConversionControl = 62,
	DeployableBaseCloudSave = 63,
	ConsumableAccountItem = 64,
	Quota = 65,
	Expedition = 66,
	HomebaseBannerIcon = 67,
	HomebaseBannerColor = 68,
	AthenaSkyDiveContrail = 69,
	PersonalVehicle = 70,
	AthenaGlider = 71,
	AthenaPickaxe = 72,
	AthenaHat = 73,
	AthenaBackpack = 74,
	AthenaCharacter = 75,
	AthenaDance = 76,
	AthenaConsumableEmote = 77,
	AthenaLoadingScreen = 78,
	AthenaBattleBus = 79,
	AthenaVehicleCosmetic = 80,
	AthenaItemWrap = 81,
	AthenaCallingCard = 82,
	AthenaMapMarker = 83,
	AthenaMusicPack = 84,
	AthenaPetCosmetic = 85,
	AthenaCharmCosmetic = 86,
	AthenaVictoryPose = 87,
	AthenaSeasonTreasure = 88,
	AthenaSeason = 89,
	AthenaRewardGraph = 90,
	AthenaExtResource = 91,
	EventDescription = 92,
	BattleLabDeviceAccount = 93,
	AthenaEventToken = 94,
	EventPurchaseTracker = 95,
	CosmeticVariantToken = 96,
	CampaignHeroLoadout = 97,
	Playset = 98,
	PrerollData = 99,
	CreativePlot = 100,
	PlayerSurveyToken = 101,
	CosmeticLocker = 102,
	BannerToken = 103,
	RestedXpBoosterToken = 104,
	RewardEventGraphPurchaseToken = 105,
	HardcoreModifier = 106,
	EventDependentItem = 107,
	ItemAccessToken = 108,
	STWAccoladeReward = 109,
	Campsite = 110,
	VictoryCrown = 111,
	RealitySapling = 112,
	SpecialItem = 113,
	Emote = 114,
	Stack = 115,
	CollectionBookPage = 116,
	BGAConsumableWrapper = 117,
	GiftBox = 118,
	GiftBoxUnlock = 119,
	PlaysetProp = 120,
	RegCosmeticDef = 121,
	Profile = 122,
	Max_None = 123,
	EFortItemType_MAX = 124
};

// Enum FortniteGame.EFortGameplayState
enum class EFortGameplayState : uint8 {
	NormalGameplay = 0,
	WaitingToStart = 1,
	EndOfZone = 2,
	EnteringZone = 3,
	LeavingZone = 4,
	Invalid = 5,
	EFortGameplayState_MAX = 6
};

// Enum FortniteGame.ESubGame
enum class ESubGame : uint8 {
	Campaign = 0,
	Athena = 1,
	Invalid = 2,
	Count = 2,
	Creative = 3,
	ESubGame_MAX = 4
};

// Enum FortniteGame.EFortReportDayPhase
enum class EFortReportDayPhase : uint8 {
	Dawn = 0,
	Dusk = 1,
	ZoneFinished = 2,
	PlayerLogout = 3,
	EFortReportDayPhase_MAX = 4
};

// Enum FortniteGame.EBuildingGameplayActorAircraftSpawnSide
enum class EBuildingGameplayActorAircraftSpawnSide : uint8 {
	None = 0,
	Side1 = 1,
	Side2 = 2,
	EBuildingGameplayActorAircraftSpawnSide_MAX = 3
};

// Enum FortniteGame.EForceKickAfterDeathMode
enum class EForceKickAfterDeathMode : uint8 {
	Disabled = 0,
	KickAll = 1,
	KickPrivate = 2,
	EForceKickAfterDeathMode_MAX = 3
};

// Enum FortniteGame.EFortIsFinalXpUpdate
enum class EFortIsFinalXpUpdate : uint8 {
	Uninitialized = 0,
	NotFinal = 1,
	Final = 2,
	EFortIsFinalXpUpdate_MAX = 3
};

// Enum FortniteGame.EFortTeam
enum class EFortTeam : uint8 {
	Spectator = 0,
	HumanCampaign = 1,
	Monster = 2,
	HumanPvP_Team1 = 3,
	HumanPvP_Team2 = 4,
	MAX = 255
};

// Enum FortniteGame.EFortVoteStatus
enum class EFortVoteStatus : uint8 {
	Begin = 0,
	Update = 1,
	End = 2,
	BeginLockout = 3,
	EndLockout = 4,
	EFortVoteStatus_MAX = 5
};

// Enum FortniteGame.EFortVoteType
enum class EFortVoteType : uint8 {
	SurvivalVote = 0,
	DifficultyIncrease = 1,
	MissionActivation = 2,
	ContinueOrExtract = 3,
	EFortVoteType_MAX = 4
};

// Enum FortniteGame.EStatCategory
enum class EStatCategory : uint8 {
	Combat = 0,
	Building = 1,
	Utility = 2,
	Max_None = 3,
	EStatCategory_MAX = 4
};

// Enum FortniteGame.EFortVoteArbitratorType
enum class EFortVoteArbitratorType : uint8 {
	Invalid = 0,
	Majority = 1,
	Unanimous = 2,
	EFortVoteArbitratorType_MAX = 3
};

// Enum FortniteGame.EFortCompletionResult
enum class EFortCompletionResult : uint8 {
	Win = 0,
	Loss = 1,
	Draw = 2,
	Undefined = 3,
	EFortCompletionResult_MAX = 4
};

// Enum FortniteGame.EWaveRules
enum class EWaveRules : uint8 {
	KillAllEnemies = 0,
	Timed = 1,
	KillPoints = 2,
	KillSpecificEnemy = 3,
	Mission = 4,
	EWaveRules_MAX = 5
};

// Enum FortniteGame.EFortAIDirectorEvent
enum class EFortAIDirectorEvent : uint8 {
	PlayerAIEnemies = 0,
	PlayerTakeDamage = 1,
	PlayerHealth = 2,
	PlayerDeath = 3,
	PlayerLookAtAIEnemy = 4,
	PlayerDamageAIEnemy = 5,
	PlayerKillAIEnemy = 6,
	PlayerHealingPotential = 7,
	PlayerAmmoLight = 8,
	PlayerAmmoMedium = 9,
	PlayerAmmoHeavy = 10,
	PlayerAmmoShells = 11,
	PlayerAmmoEnergy = 12,
	PlayerAINear = 13,
	PlayerMovement = 14,
	ObjectiveTakeDamage = 15,
	ObjectiveHealth = 16,
	ObjectiveDestroyed = 17,
	TrapFired = 18,
	TrapDamagedAIEnemy = 19,
	ObjectivePathCost = 20,
	PlayerPathCost = 21,
	ObjectiveNearbyBuildingDamaged = 22,
	Max_None = 23,
	EFortAIDirectorEvent_MAX = 24
};

// Enum FortniteGame.EServerStability
enum class EServerStability : uint8 {
	Stable = 0,
	LowUnstability = 1,
	HighUnstability = 2,
	Count = 3,
	EServerStability_MAX = 4
};

// Enum FortniteGame.ETenacityType
enum class ETenacityType : uint8 {
	Default = 0,
	MaxHealth = 1,
	Custom = 2,
	ETenacityType_MAX = 3
};

// Enum FortniteGame.EDBNOMutatorType
enum class EDBNOMutatorType : uint8 {
	Default = 0,
	On = 1,
	Off = 2,
	Improved = 3,
	EDBNOMutatorType_MAX = 4
};

// Enum FortniteGame.EFortPlaylistType
enum class EFortPlaylistType : uint8 {
	Default = 0,
	Playground = 1,
	Creative = 2,
	Creative_LTM = 3,
	BattleLab = 4,
	EFortPlaylistType_MAX = 5
};

// Enum FortniteGame.EFortResourceType
enum class EFortResourceType : uint8 {
	Wood = 0,
	Stone = 1,
	Metal = 2,
	Permanite = 3,
	GoldCurrency = 4,
	Ingredient = 5,
	None = 6,
	EFortResourceType_MAX = 7
};

// Enum FortniteGame.EMapLocationStateType
enum class EMapLocationStateType : uint8 {
	Normal = 0,
	Golden = 1,
	Undiscovered = 2,
	Max = 3
};

// Enum FortniteGame.ESpawnMachineState
enum class ESpawnMachineState : uint8 {
	Default = 0,
	WaitingForUse = 1,
	BeingUsed = 2,
	Active = 3,
	Complete = 4,
	OnCooldown = 5,
	ESpawnMachineState_MAX = 6
};

// Enum FortniteGame.ESafeZoneStartUp
enum class ESafeZoneStartUp : uint8 {
	UseDefaultGameBehavior = 0,
	StartsWithWarmUp = 1,
	StartsWithAirCraft = 2,
	StartsWithNoAirCraft = 3,
	ESafeZoneStartUp_MAX = 4
};

// Enum FortniteGame.EEventTournamentRound
enum class EEventTournamentRound : uint8 {
	Open = 0,
	Qualifiers = 1,
	SemiFinals = 2,
	Finals = 3,
	Unknown = 4,
	Arena = 5,
	EEventTournamentRound_MAX = 6
};

// Enum FortniteGame.EFriendlyFireType
enum class EFriendlyFireType : uint8 {
	Off = 0,
	On = 1,
	EFriendlyFireType_MAX = 2
};

// Enum FortniteGame.EAirCraftBehavior
enum class EAirCraftBehavior : uint8 {
	Default = 0,
	OpposingAirCraftForEachTeam = 1,
	FlyTowardFirstCircleCenter = 2,
	NoAircraft = 3,
	EAirCraftBehavior_MAX = 4
};

// Enum FortniteGame.EAthenaStormCapState
enum class EAthenaStormCapState : uint8 {
	None = 0,
	Clear = 1,
	Warning = 2,
	Damaging = 3,
	EAthenaStormCapState_MAX = 4
};

// Enum FortniteGame.EFortItemEntryState
enum class EFortItemEntryState : uint8 {
	NoneState = 0,
	NewItemCount = 1,
	ShouldShowItemToast = 2,
	DurabilityInitialized = 3,
	DoNotShowSpawnParticles = 4,
	FromRecoveredBackpack = 5,
	FromGift = 6,
	PendingUpgradeCriteriaProgress = 7,
	OwnerBuildingHandle = 8,
	FromDroppedPickup = 9,
	JustCrafted = 10,
	CraftAndSlotTarget = 11,
	GenericAttributeValueSet = 12,
	PickupInstigatorHandle = 13,
	RechargingWeaponServerTime = 14,
	DisallowSwapOnNextPickUpAttempt = 15,
	DroppedFromQuestSource = 16,
	Tossed = 17,
	Loaded = 18,
	SaveMagazineAmmo = 19,
	MultiItemLevel = 20,
	MultiItemXP = 21,
	FromAugment = 22,
	PreventDropping = 23,
	PreventDroppingExceptFromDeath = 24,
	PreventDroppingExceptFromDeathWithCount = 25,
	EFortItemEntryState_MAX = 26
};

// Enum FortniteGame.EFortQuickBars
enum class EFortQuickBars : uint8 {
	Primary = 0,
	Secondary = 1,
	Creative = 2,
	Max_None = 3,
	EFortQuickBars_MAX = 4
};

// Enum FortniteGame.EAthenaCustomizationCategory
enum class EAthenaCustomizationCategory : uint8 {
	None = 0,
	Glider = 1,
	Pickaxe = 2,
	Hat = 3,
	Backpack = 4,
	Character = 5,
	LoadingScreen = 6,
	BattleBus = 7,
	VehicleDecoration = 8,
	CallingCard = 9,
	MapMarker = 10,
	Dance = 11,
	ConsumableEmote = 12,
	VictoryPose = 13,
	SkyDiveContrail = 14,
	MusicPack = 15,
	ItemWrap = 16,
	PetSkin = 17,
	Charm = 18,
	RegCosmeticDef = 19,
	Loadout = 20,
	SaveLoadout = 21,
	MAX = 22
};

// Enum FortniteGame.EFortObjectiveStatus
enum class EFortObjectiveStatus : uint8 {
	Created = 0,
	InProgress = 1,
	Succeeded = 2,
	Failed = 3,
	NeutralCompletion = 4,
	Max_None = 5,
	EFortObjectiveStatus_MAX = 6
};

// Enum FortniteGame.ERichPresenceStateChange
enum class ERichPresenceStateChange : uint8 {
	AutoUpdate = 0,
	Idle = 1,
	Active = 2,
	Busy = 3,
	NotBusy = 4,
	ERichPresenceStateChange_MAX = 5
};

// Enum FortniteGame.ELockOnState
enum class ELockOnState : uint8 {
	NoTarget = 0,
	TargetAcquired = 1,
	LockingOnToTarget = 2,
	TargetLockedOn = 3,
	Cooldown = 4,
	COUNT = 5,
	ELockOnState_MAX = 6
};

// Enum FortniteGame.EStatRecordingPeriod
enum class EStatRecordingPeriod : uint8 {
	Frame = 0,
	Minute = 1,
	AthenaSafeZonePhase = 2,
	Life = 3,
	Map = 4,
	Campaign = 5,
	Persistent = 6,
	Max = 7
};

// Enum FortniteGame.EStatMod
enum class EStatMod : uint8 {
	Delta = 0,
	Set = 1,
	Maximum = 2,
	EStatMod_MAX = 3
};

// Enum FortniteGame.EFortDamageZone
enum class EFortDamageZone : uint8 {
	Light = 0,
	Normal = 1,
	Critical = 2,
	Vulnerability = 3,
	Invulnerability = 4,
	Max = 5
};

// Enum FortniteGame.ESpatialLoadingState
enum class ESpatialLoadingState : uint8 {
	Uninitialized = 0,
	ReadOnly = 1,
	Initializing = 2,
	Ready = 3,
	ESpatialLoadingState_MAX = 4
};

// Enum FortniteGame.EFortEmotePlayMode
enum class EFortEmotePlayMode : uint8 {
	CheckIfOwned = 0,
	ForcePlay = 1,
	EFortEmotePlayMode_MAX = 2
};

// Enum FortniteGame.EFortItemTier
enum class EFortItemTier : uint8 {
	No_Tier = 0,
	I = 1,
	II = 2,
	III = 3,
	IV = 4,
	V = 5,
	VI = 6,
	VII = 7,
	VIII = 8,
	IX = 9,
	X = 10,
	NumItemTierValues = 11,
	EFortItemTier_MAX = 12
};

// Enum FortniteGame.EFortResourceLevel
enum class EFortResourceLevel : uint8 {
	First = 0,
	Second = 1,
	Third = 2,
	Fourth = 3,
	Fifth = 4,
	Sixth = 5,
	NumLevels = 6,
	Invalid = 7,
	EFortResourceLevel_MAX = 8
};

// Enum FortniteGame.EFortRequestedGameplayAction
enum class EFortRequestedGameplayAction : uint8 {
	ContinuePlaying = 0,
	StartPlaying = 1,
	StopPlaying = 2,
	EnterZone = 3,
	LeaveZone = 4,
	ReturnToMainMenu = 5,
	QuitGame = 6,
	Invalid = 7,
	EFortRequestedGameplayAction_MAX = 8
};

// Enum FortniteGame.EFortQuestObjectiveStatEvent
enum class EFortQuestObjectiveStatEvent : uint8 {
	Kill = 0,
	TeamKill = 1,
	KillContribution = 2,
	Damage = 3,
	SquadDamage = 4,
	Visit = 5,
	VisitDiscoverPOI = 6,
	Land = 7,
	Emote = 8,
	Spray = 9,
	Toy = 10,
	Build = 11,
	BuildingEdit = 12,
	BuildingRepair = 13,
	BuildingUpgrade = 14,
	PlaceTrap = 15,
	Complete = 16,
	Craft = 17,
	Collect = 18,
	Win = 19,
	Interact = 20,
	TeamInteract = 21,
	Destroy = 22,
	Ability = 23,
	WaveComplete = 24,
	Custom = 25,
	ComplexCustom = 26,
	Client = 27,
	AthenaRank = 28,
	AthenaOutlive = 29,
	RevivePlayer = 30,
	Heal = 31,
	EarnVehicleTrickPoints = 32,
	VehicleAirTime = 33,
	TimeElapsed = 34,
	Death = 35,
	AthenaMarker = 36,
	PlacementUpdate = 37,
	StormPhase = 38,
	DistanceTraveled = 39,
	DownOrElim = 40,
	Accolade = 41,
	TakeDamage = 42,
	AthenaCollection = 43,
	AthenaCollectionFoundItem = 44,
	UsedNPCService = 45,
	ReceivedNPCGift = 46,
	InitiatedNPCConversation = 47,
	AthenaCraft = 48,
	AthenaTurnInQuest = 49,
	AthenaVehicleMod = 50,
	AthenaOpenedFriendChest = 51,
	AthenaAcquire = 52,
	InitiatedServiceStationConversation = 53,
	AthenaAccumulatedItem = 54,
	AthenaVehicleFlip = 55,
	AthenaVehicleTirePopped = 56,
	RevealedPawnDisguise = 57,
	ManuallyCompleted = 58,
	SpentBarsOnNPCService = 59,
	Hit = 60,
	CreativeDevice = 61,
	Feed = 62,
	HitWeakpoint = 63,
	PlaceTent = 64,
	ConvertNPC = 65,
	DiscoverLoot = 66,
	GlideDistance = 67,
	Throw = 68,
	Repair = 69,
	Ignite = 70,
	Refuel = 71,
	AthenaVehiclePartDisabled = 72,
	RevivedFromDBNO = 73,
	AthenaGainXp = 74,
	AthenaDistanceTraveled = 75,
	MatchStarted = 76,
	Finish = 77,
	TeammateDealtDamage = 78,
	CurrencyCollected = 79,
	AthenaLevelUp = 80,
	NumGameplayEvents = 81,
	Acquire = 82,
	Consume = 83,
	OpenCardPack = 84,
	PurchaseCardPack = 85,
	Convert = 86,
	Upgrade = 87,
	UpgradeRarity = 88,
	QuestComplete = 89,
	AssignWorker = 90,
	CollectExpedition = 91,
	CollectSuccessfulExpedition = 92,
	LevelUpCollectionBook = 93,
	LevelUpAthenaSeason = 94,
	LevelUpBattlePass = 95,
	GainAthenaSeasonXp = 96,
	HasItem = 97,
	HasAccumulatedItem = 98,
	SlotInCollection = 99,
	AlterationRespec = 100,
	AlterationUpgrade = 101,
	HasCompletedQuest = 102,
	HasAssignedWorker = 103,
	HasUpgraded = 104,
	HasConverted = 105,
	HasUpgradedRarity = 106,
	HasLeveledUpCollectionBook = 107,
	SlotHeroInLoadout = 108,
	HasLeveledUpAthenaSeason = 109,
	HasLeveledUpBattlePass = 110,
	HasGainedAthenaSeasonXp = 111,
	MinigameDynamicEvent = 112,
	MinigameComplete = 113,
	MinigameDeath = 114,
	MinigameAssist = 115,
	Max_None = 116,
	EFortQuestObjectiveStatEvent_MAX = 117
};

// Enum FortniteGame.EFortGameplayEventReferenceType
enum class EFortGameplayEventReferenceType : uint8 {
	None = 0,
	EventDescriptor = 1,
	EventFunction = 2,
	EFortGameplayEventReferenceType_MAX = 3
};

// Enum FortniteGame.EBuildingHighlightType
enum class EBuildingHighlightType : uint8 {
	Primary = 0,
	Interact = 1,
	WillBeDestroyed = 2,
	Quest = 3,
	AuxiliaryInterestPoint = 4,
	MAX_None = 5,
	EBuildingHighlightType_MAX = 6
};

// Enum FortniteGame.EFortCollectedVariantClientUpdate
enum class EFortCollectedVariantClientUpdate : uint8 {
	NewVariant = 0,
	CollectedCount = 1,
	Improvement = 2,
	HiddenImprovement = 3,
	EFortCollectedVariantClientUpdate_MAX = 4
};

// Enum FortniteGame.EFortCollectedState
enum class EFortCollectedState : uint8 {
	Unknown = 0,
	New = 1,
	Known = 2,
	NewlyCollected = 3,
	Collected = 4,
	NewBest = 5,
	NewRecord = 6,
	NewLocation = 7,
	NewlyCompleted = 8,
	Complete = 9,
	EFortCollectedState_MAX = 10
};

// Enum FortniteGame.EFortPawnStasisMode
enum class EFortPawnStasisMode : uint8 {
	None = 0,
	NoMovement = 1,
	NoMovementOrTurning = 2,
	NoMovementOrFalling = 3,
	NoMovement_EmotesEnabled = 4,
	NoMovementOrTurning_EmotesEnabled = 5,
	NoMovementOrFalling_EmotesEnabled = 6,
	EFortPawnStasisMode_MAX = 7
};

// Enum FortniteGame.EFortJumpStaminaCost
enum class EFortJumpStaminaCost : uint8 {
	None = 0,
	Trigger = 1,
	SprintTrigger = 2,
	SprintAir = 3,
	EFortJumpStaminaCost_MAX = 4
};

// Enum FortniteGame.EFortPCTutorialCompletedState
enum class EFortPCTutorialCompletedState : uint8 {
	Unknown = 0,
	Incomplete = 1,
	Complete = 2,
	EFortPCTutorialCompletedState_MAX = 3
};

// Enum FortniteGame.EFortRewardActivityType
enum class EFortRewardActivityType : uint8 {
	General = 0,
	MissionPrimary = 1,
	MissionSecondary = 2,
	AccountLevelUp = 3,
	Max_None = 4,
	EFortRewardActivityType_MAX = 5
};

// Enum FortniteGame.EFortDelayedQuickBarAction
enum class EFortDelayedQuickBarAction : uint8 {
	Add = 0,
	Remove = 1,
	Replace = 2,
	Invalid = 3,
	EFortDelayedQuickBarAction_MAX = 4
};

// Enum FortniteGame.EFortElementalDamageType
enum class EFortElementalDamageType : uint8 {
	None = 0,
	Fire = 1,
	Ice = 2,
	Lightning = 3,
	Energy = 4,
	MAX = 5
};

// Enum FortniteGame.EFortDamageNumberType
enum class EFortDamageNumberType : uint8 {
	None = 0,
	Pawn = 1,
	Building = 2,
	Player = 3,
	Shield = 4,
	Score = 5,
	DBNO = 6,
	Percent = 7,
	EFortDamageNumberType_MAX = 8
};

// Enum FortniteGame.EFortCostInfoTypes
enum class EFortCostInfoTypes : uint8 {
	Placement = 0,
	Repair = 1,
	Conversion = 2,
	Ability = 3,
	None = 4,
	EFortCostInfoTypes_MAX = 5
};

// Enum FortniteGame.EFortBuildPreviewMarkerOptionalAdjustment
enum class EFortBuildPreviewMarkerOptionalAdjustment : uint8 {
	None = 0,
	FreeWallPieceOnTop = 1,
	FreeWallPieceOnBottom = 2,
	EFortBuildPreviewMarkerOptionalAdjustment_MAX = 3
};

// Enum FortniteGame.EPlayerControllerFollow
enum class EPlayerControllerFollow : uint8 {
	NextTeammate = 0,
	PreviousTeammate = 1,
	NextPlayer = 2,
	PreviousPlayer = 3,
	SpecialActor = 4,
	EPlayerControllerFollow_MAX = 5
};

// Enum FortniteGame.EVehicleSeats
enum class EVehicleSeats : uint8 {
	Driver = 0,
	Passenger1 = 1,
	Passenger2 = 2,
	Passenger3 = 3,
	Passenger4 = 4,
	Passenger5 = 5,
	Passenger6 = 6,
	MaxCount = 7,
	EVehicleSeats_MAX = 8
};

// Enum FortniteGame.ESpectateBlendEasing
enum class ESpectateBlendEasing : uint8 {
	Linear = 0,
	EaseOutQuad = 1,
	ESpectateBlendEasing_MAX = 2
};

// Enum FortniteGame.EFortSpectatorBlendType
enum class EFortSpectatorBlendType : uint8 {
	None = 0,
	Orbit = 1,
	Default = 2,
	EFortSpectatorBlendType_MAX = 3
};

// Enum FortniteGame.ESpectatorSquadIdMode
enum class ESpectatorSquadIdMode : uint8 {
	AlwaysOff = 0,
	AlwaysOn = 1,
	HoldToDisplay = 2,
	ESpectatorSquadIdMode_MAX = 3
};

// Enum FortniteGame.ESpectatorCameraType
enum class ESpectatorCameraType : uint8 {
	ThirdPerson = 0,
	DroneFree = 1,
	Gameplay = 2,
	ReverseShot = 3,
	FollowShot = 4,
	DroneFollow = 5,
	DroneAttach = 6,
	BattleMap = 7,
	ARDrone = 8,
	MAX = 9
};

// Enum FortniteGame.EPlayEventType
enum class EPlayEventType : uint8 {
	None = 0,
	TeamFlight = 1,
	Zone = 2,
	Elimination = 3,
	PlayerMoves = 4,
	SinglePlayerMove = 5,
	ActorsPosition = 6,
	GameHighlights = 7,
	Timecode = 8,
	EPlayEventType_MAX = 9
};

// Enum FortniteGame.ECameraShotNotificationTypes
enum class ECameraShotNotificationTypes : uint8 {
	Notification = 0,
	HighlightAnnotation = 1,
	TitleScreen = 2,
	ECameraShotNotificationTypes_MAX = 3
};

// Enum FortniteGame.EThirdPersonAutoFollowMode
enum class EThirdPersonAutoFollowMode : uint8 {
	Off = 0,
	Auto = 1,
	Lazy = 2,
	EThirdPersonAutoFollowMode_MAX = 3
};

// Enum FortniteGame.ELeecherStatus
enum class ELeecherStatus : uint8 {
	NotReady = 0,
	NonLeecher = 1,
	Leecher = 2,
	ELeecherStatus_MAX = 3
};

// Enum FortniteGame.EHUDMessagePlacement
enum class EHUDMessagePlacement : uint8 {
	None = 0,
	BottomCenter = 1,
	TopCenter = 2,
	CenterRight = 3,
	EHUDMessagePlacement_MAX = 4
};

// Enum FortniteGame.EMatchmakingCancelReasonV2
enum class EMatchmakingCancelReasonV2 : uint8 {
	Explicit = 0,
	JoinedParty = 1,
	LeftParty = 2,
	PartyMemberJoined = 3,
	PartyMemberLeft = 4,
	PartyMemberCanceled = 5,
	PartyLeaderSwap = 6,
	PlayReplay = 7,
	UIDestroyed = 8,
	PCDestroyed = 9,
	AppBackgrounded = 10,
	HotfixOutdated = 11,
	TournamentOver = 12,
	NotInParty = 13,
	CrossplayBlocked = 14,
	TournamentCrossplayBlocked = 15,
	AccountLevelTooLow = 16,
	FillNoCrossplay = 17,
	CreativeCanceledByLeader = 18,
	CreativeMemberLeftIsland = 19,
	CreativeIslandStateChanged = 20,
	JoinInProgressRejected = 21,
	MatchmakingDisabled = 22,
	NotLoggedIn = 23,
	NoIdentityInterface = 24,
	NoSessionInterface = 25,
	TimedOut = 26,
	InvalidPlaylist = 27,
	AttemptedToQueueTooFrequently = 28,
	TournamentBlackout = 29,
	CellularDataRefusal = 30,
	CancelledDuringPreTravelSetup = 31,
	Unknown = 32,
	EMatchmakingCancelReasonV2_MAX = 33
};

// Enum FortniteGame.EEndOfMatchReason
enum class EEndOfMatchReason : uint8 {
	LastManStanding = 0,
	ScoreReached = 1,
	TimeRanOut = 2,
	WinEventOccurred = 3,
	AllLoggedOut = 4,
	AllEliminated = 5,
	EEndOfMatchReason_MAX = 6
};

// Enum FortniteGame.EDeathCause
enum class EDeathCause : uint8 {
	OutsideSafeZone = 0,
	FallDamage = 1,
	Pistol = 2,
	Shotgun = 3,
	Rifle = 4,
	SMG = 5,
	Sniper = 6,
	SniperNoScope = 7,
	Melee = 8,
	InfinityBlade = 9,
	Grenade = 10,
	C4 = 11,
	GrenadeLauncher = 12,
	RocketLauncher = 13,
	Minigun = 14,
	Bow = 15,
	Trap = 16,
	DBNOTimeout = 17,
	Banhammer = 18,
	RemovedFromGame = 19,
	MassiveMelee = 20,
	MassiveDiveBomb = 21,
	MassiveRanged = 22,
	Vehicle = 23,
	ShoppingCart = 24,
	ATK = 25,
	QuadCrasher = 26,
	Biplane = 27,
	BiplaneGun = 28,
	LMG = 29,
	GasGrenade = 30,
	InstantEnvironmental = 31,
	InstantEnvironmentalFellOutOfWorld = 32,
	InstantEnvironmentalUnderLandscape = 33,
	Turret = 34,
	ShipCannon = 35,
	Cube = 36,
	Balloon = 37,
	StormSurge = 38,
	Lava = 39,
	BasicFiend = 40,
	EliteFiend = 41,
	RangedFiend = 42,
	BasicBrute = 43,
	EliteBrute = 44,
	MegaBrute = 45,
	SilentSwitchingToSpectate = 46,
	LoggedOut = 47,
	TeamSwitchSuicide = 48,
	WonMatch = 49,
	Unspecified = 50,
	EDeathCause_MAX = 51
};

// Enum FortniteGame.ERewardSource
enum class ERewardSource : uint8 {
	Invalid = 0,
	MinutesPlayed = 1,
	FirstKill = 2,
	TeamKills = 3,
	FirstRevive = 4,
	AdditionalRevives = 5,
	Placement = 6,
	Medals = 7,
	FirstWin = 8,
	SeasonLevelUp = 9,
	BookLevelUp = 10,
	MatchXP = 11,
	MAX_COUNT = 12,
	ERewardSource_MAX = 13
};

// Enum FortniteGame.EAthenaMatchXpMultiplierSource
enum class EAthenaMatchXpMultiplierSource : uint8 {
	Invalid = 0,
	BattlePassSelf = 1,
	BattlePassFriends = 2,
	CosmeticSet = 3,
	AntiAddictionPenalty = 4,
	BonusXpEvent = 5,
	MAX_COUNT = 6,
	EAthenaMatchXpMultiplierSource_MAX = 7
};

// Enum FortniteGame.EFortAccoladeSubtype
enum class EFortAccoladeSubtype : uint8 {
	NotSet = 0,
	Action = 1,
	Discovery = 2,
	XpToken = 3,
	EFortAccoladeSubtype_MAX = 4
};

// Enum FortniteGame.EFortVolumeType
enum class EFortVolumeType : uint8 {
	None = 0,
	Island = 1,
	Published = 2,
	Featured = 3,
	Prefab = 4,
	Hub = 5,
	EFortVolumeType_MAX = 6
};

// Enum FortniteGame.EFortMarkedActorScreenClamping
enum class EFortMarkedActorScreenClamping : uint8 {
	Default = 0,
	Clamp = 1,
	ClampWhileNew = 2,
	DontClamp = 3,
	EFortMarkedActorScreenClamping_MAX = 4
};

// Enum FortniteGame.EFortEncounterDirection
enum class EFortEncounterDirection : uint8 {
	North = 0,
	NorthEast = 1,
	East = 2,
	SouthEast = 3,
	South = 4,
	SouthWest = 5,
	West = 6,
	NorthWest = 7,
	Max_None = 8,
	EFortEncounterDirection_MAX = 9
};

// Enum FortniteGame.EFortWorldMarkerType
enum class EFortWorldMarkerType : uint8 {
	None = 0,
	Location = 1,
	Enemy = 2,
	Item = 3,
	Elimination = 4,
	SpecialLocal = 5,
	SpecialServer = 6,
	PingGROUPSTART = 7,
	PingGoTo = 8,
	PingHide = 9,
	PingAttack = 10,
	PingHoldPosition = 11,
	PingNoIcon = 12,
	PingGROUPEND = 13,
	SquadComsGROUPSTART = 14,
	SquadComsWatchArea = 15,
	SquadComsDefend = 16,
	SquadComsSomeonesHere = 17,
	SquadComsLootArea = 18,
	SquadComsAttack = 19,
	SquadComsGROUPEND = 20,
	MAX = 21
};

// Enum FortniteGame.EFortBuildingType
enum class EFortBuildingType : uint8 {
	Wall = 0,
	Floor = 1,
	Corner = 2,
	Deco = 3,
	Prop = 4,
	Stairs = 5,
	Roof = 6,
	Pillar = 7,
	SpawnedItem = 8,
	Container = 9,
	Trap = 10,
	GenericCenterCellActor = 11,
	None = 12,
	EFortBuildingType_MAX = 13
};

// Enum FortniteGame.TInteractionType
enum class TInteractionType : uint8 {
	IT_NoInteraction = 0,
	IT_Simple = 1,
	IT_LongPress = 2,
	IT_BuildingEdit = 3,
	IT_BuildingImprovement = 4,
	IT_TrapPlacement = 5,
	IT_MAX = 6
};

// Enum FortniteGame.EInteractionBeingAttempted
enum class EInteractionBeingAttempted : uint8 {
	FirstInteraction = 0,
	SecondInteraction = 1,
	AllInteraction = 2,
	EInteractionBeingAttempted_MAX = 3
};

// Enum FortniteGame.EFortBuildingPersistentState
enum class EFortBuildingPersistentState : uint8 {
	Default = 0,
	New = 1,
	Constructed = 2,
	Destroyed = 3,
	Searched = 4,
	None = 5,
	EFortBuildingPersistentState_MAX = 6
};

// Enum FortniteGame.EFortBuildingInitializationReason
enum class EFortBuildingInitializationReason : uint8 {
	StaticallyPlaced = 0,
	Spawned = 1,
	Replaced = 2,
	LoadedFromSave = 3,
	DynamicBuilderPlaced = 4,
	PlacementTool = 5,
	TrapTool = 6,
	None = 7,
	EFortBuildingInitializationReason_MAX = 8
};

// Enum FortniteGame.EFortDayPhase
enum class EFortDayPhase : uint8 {
	Morning = 0,
	Day = 1,
	Evening = 2,
	Night = 3,
	NumPhases = 4,
	EFortDayPhase_MAX = 5
};

// Enum FortniteGame.EDynamicBuildingPlacementType
enum class EDynamicBuildingPlacementType : uint8 {
	CountsTowardsBounds = 0,
	DestroyIfColliding = 1,
	DestroyAnythingThatCollides = 2,
	EDynamicBuildingPlacementType_MAX = 3
};

// Enum FortniteGame.EFortBaseWeaponDamage
enum class EFortBaseWeaponDamage : uint8 {
	Combat = 0,
	Environmental = 1,
	EFortBaseWeaponDamage_MAX = 2
};

// Enum FortniteGame.EBuildingActorComponentCreationPolicy
enum class EBuildingActorComponentCreationPolicy : uint8 {
	Never = 0,
	Lazy = 1,
	Always = 2,
	EBuildingActorComponentCreationPolicy_MAX = 3
};

// Enum FortniteGame.EAttributeInitLevelSource
enum class EAttributeInitLevelSource : uint8 {
	WorldDifficulty = 0,
	PlayerBuildingSkill = 1,
	AthenaPlaylist = 2,
	EAttributeInitLevelSource_MAX = 3
};

// Enum FortniteGame.UFortMatchmakingKnobsDataSource
enum class UFortMatchmakingKnobsDataSource : uint8 {
	None = 0,
	Playlist = 1,
	Mutator = 2,
	GameMode = 3,
	Permissions = 4,
	UISettings = 5,
	CreativeGlobalOption = 6,
	Max = 7
};

// Enum FortniteGame.EFortAbilityTargetingSource
enum class EFortAbilityTargetingSource : uint8 {
	Camera = 0,
	PawnForward = 1,
	PawnTowardsFocus = 2,
	WeaponForward = 3,
	WeaponTowardsFocus = 4,
	Custom = 5,
	Max_None = 6,
	EFortAbilityTargetingSource_MAX = 7
};

// Enum FortniteGame.EFortDeliveryInfoBuildingActorSpecification
enum class EFortDeliveryInfoBuildingActorSpecification : uint8 {
	All = 0,
	PlayerBuildable = 1,
	NonPlayerBuildable = 2,
	EFortDeliveryInfoBuildingActorSpecification_MAX = 3
};

// Enum FortniteGame.EFortTeamAffiliation
enum class EFortTeamAffiliation : uint8 {
	Friendly = 0,
	Neutral = 1,
	Hostile = 2,
	EFortTeamAffiliation_MAX = 3
};

// Enum FortniteGame.EFortProximityBasedGEApplicationType
enum class EFortProximityBasedGEApplicationType : uint8 {
	ApplyOnProximityPulse = 0,
	ApplyOnProximityTouch = 1,
	ApplyOnlyDuringProximityTouch = 2,
	ApplyOnProximityExit = 3,
	ApplyOnProximityPrePulse = 4,
	EFortProximityBasedGEApplicationType_MAX = 5
};

// Enum FortniteGame.ETrustedPlatformType
enum class ETrustedPlatformType : uint8 {
	Unknown = 0,
	Untrusted = 1,
	PS4 = 2,
	PS5 = 3,
	XboxOne = 4,
	Switch = 5,
	ETrustedPlatformType_MAX = 6
};

// Enum FortniteGame.EReadyCheckState
enum class EReadyCheckState : uint8 {
	CheckStarted = 0,
	Ready = 1,
	NotReady = 2,
	EReadyCheckState_MAX = 3
};

// Enum FortniteGame.EFortAppliedSwapItemAndVariantState
enum class EFortAppliedSwapItemAndVariantState : uint8 {
	None = 0,
	Active = 1,
	Inactive = 2,
	EFortAppliedSwapItemAndVariantState_MAX = 3
};

// Enum FortniteGame.EFortCustomBodyType
enum class EFortCustomBodyType : uint8 {
	NONE = 0,
	Small = 1,
	Medium = 2,
	MediumAndSmall = 3,
	Large = 4,
	LargeAndSmall = 5,
	LargeAndMedium = 6,
	All = 7,
	Deprecated = 8,
	EFortCustomBodyType_MAX = 9
};

// Enum FortniteGame.EFortCustomGender
enum class EFortCustomGender : uint8 {
	Invalid = 0,
	Male = 1,
	Female = 2,
	Both = 3,
	EFortCustomGender_MAX = 4
};

// Enum FortniteGame.EFortPlayerRole
enum class EFortPlayerRole : uint8 {
	Player = 0,
	LiveSpectator = 1,
	ReplaySpectator = 2,
	InactivePlayer = 3,
	EFortPlayerRole_MAX = 4
};

// Enum FortniteGame.EFortKickReason
enum class EFortKickReason : uint8 {
	NotKicked = 0,
	GenericKick = 1,
	WasBanned = 2,
	EncryptionRequired = 3,
	CrossPlayRestriction = 4,
	ClientIdRestriction = 5,
	EFortKickReason_MAX = 6
};

// Enum FortniteGame.EMessageDispatcherErrorMessageType
enum class EMessageDispatcherErrorMessageType : uint8 {
	FailedToSetTrigger_TooManyTriggers = 0,
	FailedToSetReceiver_TooManyReceivers = 1,
	FailedToSetReceiver_TooManyReceiversOnOneChannel = 2,
	FailedToSetTriggerReceiver_InvalidChannel = 3,
	FailedToEnqueueMessage = 4,
	BuildLimitReached = 5,
	UnknownError = 6,
	EMessageDispatcherErrorMessageType_MAX = 7
};

// Enum FortniteGame.ECreativePersistenceErrorTypes
enum class ECreativePersistenceErrorTypes : uint8 {
	None = 0,
	VersionError = 1,
	LocalOnly = 2,
	LSRError = 3,
	ECreativePersistenceErrorTypes_MAX = 4
};

// Enum FortniteGame.EFortBudgetCategory
enum class EFortBudgetCategory : uint8 {
	Memory = 0,
	Simulation = 1,
	Rendering = 2,
	Network = 3,
	Audio = 4,
	Max = 5
};

// Enum FortniteGame.EMatchAbandonState
enum class EMatchAbandonState : uint8 {
	None = 0,
	Joining = 1,
	CanAbandon = 2,
	TeamLocked = 3,
	EMatchAbandonState_MAX = 4
};

// Enum FortniteGame.EKeepPlayingTogetherVotingStatus
enum class EKeepPlayingTogetherVotingStatus : uint8 {
	Undecided = 0,
	OptedIn = 1,
	OptedOut_Manual = 2,
	OptedOut_PartySizeIncreased = 3,
	OptedOut_PartyMemberInLobby = 4,
	OptedOut_PartyMemberOptedOut = 5,
	OptedOut_PartyMemberLeft = 6,
	OptedOut_Forced = 7,
	OptedOut_TimedOut = 8,
	OptedOut_PlayerReturnedToLobby = 9,
	OptedOut_OnlyPlayerInSquad = 10,
	OptedOut_Disconnected = 11,
	EKeepPlayingTogetherVotingStatus_MAX = 12
};

// Enum FortniteGame.EAthenaScoringEvent
enum class EAthenaScoringEvent : uint8 {
	None = 0,
	Elimination = 1,
	ChestOpened = 2,
	AmmoCanOpened = 3,
	SupplyDropOpened = 4,
	SupplyLlamaOpened = 5,
	ForagedItemConsumed = 6,
	SurvivalInMinutes = 7,
	CollectedCoinBronze = 8,
	CollectedCoinSilver = 9,
	CollectedCoinGold = 10,
	AIKilled = 11,
	EAthenaScoringEvent_MAX = 12
};

// Enum FortniteGame.ETeamMemberState
enum class ETeamMemberState : uint8 {
	None = 0,
	FIRST_CHAT_MESSAGE = 1,
	NeedAmmoHeavy = 1,
	NeedAmmoLight = 2,
	NeedAmmoMedium = 3,
	NeedAmmoShells = 4,
	NeedAmmoRocket = 5,
	ChatBubble = 6,
	EnemySpotted = 7,
	NeedBandages = 8,
	NeedMaterials = 9,
	NeedShields = 10,
	NeedWeapon = 11,
	LAST_CHAT_MESSAGE = 11,
	MAX = 12
};

// Enum FortniteGame.EItemWrapMaterialType
enum class EItemWrapMaterialType : uint8 {
	WeaponWrap = 0,
	VehicleWrap_Opaque = 1,
	VehicleWrap_Masked = 2,
	Character = 3,
	EItemWrapMaterialType_MAX = 4
};

// Enum FortniteGame.EAdHocSquads_InviteStatus
enum class EAdHocSquads_InviteStatus : uint8 {
	Unset = 0,
	Inviting = 1,
	InviteEnded_APlayerAcceptedTheInvite = 2,
	InviteCancelled_SquadFull = 3,
	InviteCancelled_ByInvitingPlayer = 4,
	EAdHocSquads_MAX = 5
};

// Enum FortniteGame.EBuildingReplacementType
enum class EBuildingReplacementType : uint8 {
	BRT_None = 0,
	BRT_Edited = 1,
	BRT_Upgrade = 2,
	BRT_MAX = 3
};

// Enum FortniteGame.EFortCustomPartType
enum class EFortCustomPartType : uint8 {
	Head = 0,
	Body = 1,
	Hat = 2,
	Backpack = 3,
	MiscOrTail = 4,
	Face = 5,
	Gameplay = 6,
	NumTypes = 7,
	EFortCustomPartType_MAX = 8
};

// Enum FortniteGame.FCollisionReactionType
enum class FCollisionReactionType : uint8 {
	Nothing = 0,
	Pawn = 1,
	Vehicle = 2,
	PhysicsObject = 3,
	BuildingActor = 4,
	FCollisionReactionType_MAX = 5
};

// Enum FortniteGame.EAdHocSquads_SquadUpResult
enum class EAdHocSquads_SquadUpResult : uint8 {
	Success = 0,
	Failure_OneOrMorePlayersWereNull = 1,
	Failure_BothPlayersAreInAdHocSquads = 2,
	Failure_BothPlayersAreAlreadyInTheSameAdHocSquad = 3,
	Failure_CouldNotCreateAdHocSquad = 4,
	Failure_CalledOnClient = 5,
	Failure_SquadIsAlreadyFull = 6,
	Failure_TooManyPlayersToMergeSquads = 7,
	Failure_MutatorIsDisabled = 8,
	Failure_Unknown = 9,
	Failure_Custom = 10,
	EAdHocSquads_MAX = 11
};

// Enum FortniteGame.EAdHocSquads_LeaveSquadReason
enum class EAdHocSquads_LeaveSquadReason : uint8 {
	ManualLeave = 0,
	MutatorDisabled = 1,
	JoinedADifferentSquad = 2,
	PlayerDiedAndCannotBeRevived = 3,
	PlayerHasWonGame = 4,
	EAdHocSquads_MAX = 5
};

// Enum FortniteGame.EDialogMarkerInteractionState
enum class EDialogMarkerInteractionState : uint8 {
	Conversation = 0,
	InteractionRange = 1,
	IndicatorRange = 2,
	None = 3,
	EDialogMarkerInteractionState_MAX = 4
};

// Enum FortniteGame.EFortInventoryType
enum class EFortInventoryType : uint8 {
	World = 0,
	Account = 1,
	Outpost = 2,
	MAX = 3
};

// Enum FortniteGame.ECollectionBookRewardType
enum class ECollectionBookRewardType : uint8 {
	Uninitialized = 0,
	Book = 1,
	Page = 2,
	Section = 3,
	ECollectionBookRewardType_MAX = 4
};

// Enum FortniteGame.EFortWeakPointState
enum class EFortWeakPointState : uint8 {
	Uninitialized = 0,
	Inactive = 1,
	Active = 2,
	Destroyed = 3,
	EFortWeakPointState_MAX = 4
};

// Enum FortniteGame.ECreativeKeyLockState
enum class ECreativeKeyLockState : uint8 {
	LOCKED = 0,
	UNLOCKED = 1,
	INVALID = 2,
	ECreativeKeyLockState_MAX = 3
};

// Enum FortniteGame.ELockState
enum class ELockState : uint8 {
	INVALID = 0,
	UNLOCKED = 1,
	LOCKED = 2,
	ELockState_MAX = 3
};

// Enum FortniteGame.EMatchConditionMutatorTimingType
enum class EMatchConditionMutatorTimingType : uint8 {
	Round = 0,
	MatchAtEndOfRound = 1,
	MatchImmediate = 2,
	COUNT = 3,
	EMatchConditionMutatorTimingType_MAX = 4
};

// Enum FortniteGame.EMiniMapComponentDiscoverableVisibility
enum class EMiniMapComponentDiscoverableVisibility : uint8 {
	Unset = 0,
	NotVisible = 1,
	Visible_NotDiscovered = 2,
	Discovered = 3,
	EMiniMapComponentDiscoverableVisibility_MAX = 4
};

// Enum FortniteGame.EBackupSaveState
enum class EBackupSaveState : uint8 {
	Ready = 0,
	InProgress = 1,
	OnCooldown = 2,
	EBackupSaveState_MAX = 3
};

// Enum FortniteGame.EBuildingGameplayActorSentry_State
enum class EBuildingGameplayActorSentry_State : uint8 {
	PassiveIdle = 0,
	ActiveIdle = 1,
	Tracking = 2,
	Aggro = 3,
	Dormant = 4,
	Deactivated = 5,
	ReturningToIdle = 6,
	LocatingDamager = 7,
	EBuildingGameplayActorSentry_MAX = 8
};

// Enum FortniteGame.ECreativeBossDisplayMode
enum class ECreativeBossDisplayMode : uint8 {
	DontOverride = 0,
	Yes = 1,
	No = 2,
	ECreativeBossDisplayMode_MAX = 3
};

// Enum FortniteGame.ECapturePointState
enum class ECapturePointState : uint8 {
	Idle = 0,
	Capturing = 1,
	Contested = 2,
	Resetting = 3,
	Captured = 4,
	Reset = 5,
	ECapturePointState_MAX = 6
};

// Enum FortniteGame.ECaptureState
enum class ECaptureState : uint8 {
	Neutral = 0,
	Capturing = 1,
	Contested = 2,
	Disabled = 3,
	Decapturing = 4,
	Neutralizing = 5,
	Deneutralizing = 6,
	Captured = 7,
	ECaptureState_MAX = 8
};

// Enum FortniteGame.EDynamicXpCalibrationPhase
enum class EDynamicXpCalibrationPhase : uint8 {
	None = 0,
	DataGathering = 1,
	DataAnalysis = 2,
	LiveXpOnceApproved = 3,
	LiveXp = 4,
	Failed = 5,
	EDynamicXpCalibrationPhase_MAX = 6
};

// Enum FortniteGame.EMMSPrivacy
enum class EMMSPrivacy : uint8 {
	Public = 0,
	Private = 1,
	EMMSPrivacy_MAX = 2
};

// Enum FortniteGame.EFortDBNOCarryEvent
enum class EFortDBNOCarryEvent : uint8 {
	PickedUp = 0,
	Interrogating = 1,
	Dropped = 2,
	Thrown = 3,
	EFortDBNOCarryEvent_MAX = 4
};

// Enum FortniteGame.EFortFactionAttitude
enum class EFortFactionAttitude : uint8 {
	Friendly = 0,
	Neutral = 1,
	Hostile = 2,
	MAX = 3
};

// Enum FortniteGame.EDualWeaponHand
enum class EDualWeaponHand : uint8 {
	LEFT = 0,
	RIGHT = 1,
	MAX = 2
};

// Enum FortniteGame.EPlayerIndicatorDisplayMode
enum class EPlayerIndicatorDisplayMode : uint8 {
	DontOverride = 0,
	TeamOnly = 1,
	Enemies = 2,
	Anyone = 3,
	Never = 4,
	EPlayerIndicatorDisplayMode_MAX = 5
};

// Enum FortniteGame.EInteriorAudioState
enum class EInteriorAudioState : uint8 {
	Indoors = 0,
	Outdoors = 1,
	PartialOutdoors = 2,
	Max_None = 3,
	EInteriorAudioState_MAX = 4
};

// Enum FortniteGame.EFortWeaponReloadType
enum class EFortWeaponReloadType : uint8 {
	ReloadWholeClip = 0,
	ReloadIndividualBullets = 1,
	ReloadBasedOnAmmoCostPerFire = 2,
	ReloadBasedOnCartridgePerFire = 3,
	EFortWeaponReloadType_MAX = 4
};

// Enum FortniteGame.EMatchmakingCompleteResult
enum class EMatchmakingCompleteResult : uint8 {
	NotStarted = 0,
	UpdateNeeded = 1,
	OutpostNotFound = 2,
	Cancelled = 3,
	NoResults = 4,
	Failure = 5,
	CreateFailure = 6,
	Success = 7,
	EMatchmakingCompleteResult_MAX = 8
};

// Enum FortniteGame.EMatchmakingState
enum class EMatchmakingState : uint8 {
	NotMatchmaking = 0,
	CancelingMatchmaking = 1,
	ReleasingLock = 2,
	AcquiringLock = 3,
	LockAcquistionFailure = 4,
	FindingEmptyServer = 5,
	FindingExistingSession = 6,
	TestingEmptyServers = 7,
	TestingExistingSessions = 8,
	JoiningExistingSession = 9,
	NoMatchesAvailable = 10,
	CleaningUpExisting = 11,
	HandlingFailure = 12,
	JoinSuccess = 13,
	EMatchmakingState_MAX = 14
};

// Enum FortniteGame.EMatchmakingUtilityState
enum class EMatchmakingUtilityState : uint8 {
	Idle = 0,
	MatchmakingUtilityBegin = 1,
	MatchmakingUtilityCompleted = 2,
	Completed = 3,
	Failed = 4,
	CheckSittingOutState = 5,
	InitializePlaylistSelection = 6,
	JoinMatchInProgress = 7,
	CheckingIfBanned = 8,
	PrivateMatchMinPartySize = 9,
	CreativeContentDownloadModal = 10,
	CrossplayOptIn_GameMode = 11,
	CrossplayOptIn_Fill = 12,
	CrossplayDevices = 13,
	FactionChoice = 14,
	SetPartyReadiness = 15,
	WaitingForPartyReadinessConfirmed = 16,
	TournamentEligibility = 17,
	TournamentRegionLock = 18,
	TournamentMFA = 19,
	TournamentEULA = 20,
	AppEnvSecurity = 21,
	WaitingForInitialPlaylistSelection = 22,
	ServerBrowsers = 23,
	WaitingForServerBrowserPlaylistSwap = 24,
	DelayReadyUp = 25,
	QoSSettings_UpdateManager = 26,
	QoSSettings_UpdateManager_Success = 27,
	SetAthenaReady = 28,
	WaitingForAthenaReadinessConfirmed = 29,
	PreloadAthena = 30,
	UpdateHiddenMatchmakingDelay = 31,
	WaitingForUpdateHiddenMatchmakingDelay = 32,
	HiddenMatchmakingDelay = 33,
	FindExistingEditSession = 34,
	SelectingFlow = 35,
	ReadyingUpforFlow = 36,
	PartyMemberSameLocationCheck = 37,
	CallingMatchmakingForFlow = 38,
	WaitingForJoinMatchInProgressResponse = 39,
	WaitingForMatchmakingResponse = 40,
	WaitingForMatchmakingToCompleteAsPartyMember = 41,
	WaitingForEntirePartyReady = 42,
	WaitingForPartyToBeInSameLocation = 43,
	WaitingForPartyToSwitchSubgames = 44,
	WaitingToRestartMatchmaking_TooFrequentRequest = 45,
	RequestingSpectateMatch = 46,
	ProcessingMatchmakingResults_Success = 47,
	ProcessingMatchmakingResults_Fail = 48,
	PreloadingForJoiningMatchInProgress = 49,
	ProcessingJoinMatchInProgressResults_Success = 50,
	ProcessingJoinMatchInProgressResults_Fail = 51,
	DownloadingAdditionalContent = 52,
	RestartingMatchmaking = 53,
	QueryingForLiveSpectatorEula = 54,
	PreTravelToSessionSetup = 55,
	RunningPlaylistChecks = 56,
	INVALID = 57,
	EMatchmakingUtilityState_MAX = 58
};

// Enum FortniteGame.EFortMinigameState
enum class EFortMinigameState : uint8 {
	PreGame = 0,
	Setup = 1,
	Transitioning = 2,
	WaitingForCameras = 3,
	Warmup = 4,
	InProgress = 5,
	PostGameTimeDilation = 6,
	PostRoundEnd = 7,
	PostGameEnd = 8,
	PostGameAbandon = 9,
	PostGameReset = 10,
	EFortMinigameState_MAX = 11
};

// Enum FortniteGame.EFortMinigameEnd
enum class EFortMinigameEnd : uint8 {
	AbandonGame = 0,
	EndGame = 1,
	EndRound = 2,
	EFortMinigameEnd_MAX = 3
};

// Enum FortniteGame.EHitTraceRule
enum class EHitTraceRule : uint8 {
	Visibility = 0,
	Terrain = 1,
	None = 2,
	EHitTraceRule_MAX = 3
};

// Enum FortniteGame.EScaleAxis
enum class EScaleAxis : uint8 {
	All = 0,
	X = 1,
	Y = 2,
	Z = 3,
	EScaleAxis_MAX = 4
};

// Enum FortniteGame.ETransformationType
enum class ETransformationType : uint8 {
	Translation = 0,
	Rotation = 1,
	Scale = 2,
	None = 3,
	ETransformationType_MAX = 4
};

// Enum FortniteGame.EPropertyOverrideTargetType
enum class EPropertyOverrideTargetType : uint8 {
	None = 0,
	Default = 1,
	ImmutableTarget = 2,
	EPropertyOverrideTargetType_MAX = 3
};

// Enum FortniteGame.EFortMissionVisibilityOverride
enum class EFortMissionVisibilityOverride : uint8 {
	Visible = 0,
	Invisible = 1,
	Max_None = 2,
	EFortMissionVisibilityOverride_MAX = 3
};

// Enum FortniteGame.EFortWeaponOverheatState
enum class EFortWeaponOverheatState : uint8 {
	None = 0,
	Heating = 1,
	Cooling = 2,
	Overheated = 3,
	EFortWeaponOverheatState_MAX = 4
};

// Enum FortniteGame.EPortalLinkCodeLockStatus
enum class EPortalLinkCodeLockStatus : uint8 {
	Unlocked_NotSet = 0,
	Unlocked = 1,
	Locked = 2,
	EPortalLinkCodeLockStatus_MAX = 3
};

// Enum FortniteGame.EStyleSpecificationMethod
enum class EStyleSpecificationMethod : uint8 {
	StyleSetLookup = 0,
	DirectReference = 1,
	EStyleSpecificationMethod_MAX = 2
};

// Enum FortniteGame.EQuartzGunfireState
enum class EQuartzGunfireState : uint8 {
	FirstShot = 0,
	Shooting = 1,
	Stopped = 2,
	Max_None = 3,
	EQuartzGunfireState_MAX = 4
};

// Enum FortniteGame.ESelectionProperty
enum class ESelectionProperty : uint8 {
	SingleObject = 0,
	SingleObjectMoveOnGrid = 1,
	MultipleObjects = 2,
	MultipleObjectsMoveOnGrid = 3,
	None = 4,
	ESelectionProperty_MAX = 5
};

// Enum FortniteGame.ETimestampEventType
enum class ETimestampEventType : uint8 {
	NamedEvent = 0,
	ChangeBPM = 1,
	Max_None = 2,
	ETimestampEventType_MAX = 3
};

// Enum FortniteGame.EAthenaTravelLogPlayerType
enum class EAthenaTravelLogPlayerType : uint8 {
	Self = 0,
	Ally = 1,
	Enemy = 2,
	Invalid = 3,
	EAthenaTravelLogPlayerType_MAX = 4
};

// Enum FortniteGame.EAthenaTravelEventType
enum class EAthenaTravelEventType : uint8 {
	GroundMove = 0,
	AirMove = 1,
	BattleBusJump = 2,
	LaunchJump = 3,
	Landed = 4,
	OpenChest = 5,
	OpenAmmo = 6,
	GotAssist = 7,
	GotKnockdown = 8,
	GotKill = 9,
	PlayerDowned = 10,
	PlayerDied = 11,
	Won = 12,
	DealtDamage = 13,
	HealthChange = 14,
	GotItem = 15,
	DroppedItem = 16,
	ShieldChange = 17,
	WeaponExecuted = 18,
	EnteredVehicle = 19,
	ExitedVehicle = 20,
	TrapBuilt = 21,
	UsedItem = 22,
	ZoneUpdate = 23,
	PlacedBuilding = 24,
	EmoteUsed = 25,
	UpgradedBuilding = 26,
	EditedBuilding = 27,
	Count = 28,
	EAthenaTravelEventType_MAX = 29
};

// Enum FortniteGame.EGlobalWeatherState
enum class EGlobalWeatherState : uint8 {
	Inactive = 0,
	Active = 1,
	BlendingIn = 2,
	BlendingOut = 3,
	EGlobalWeatherState_MAX = 4
};

// Enum FortniteGame.EUnconvertReason
enum class EUnconvertReason : uint8 {
	StealByOtherPlayer = 0,
	ConverterDeath = 1,
	ConvertedDeath = 2,
	TooManyConverted = 3,
	TooFarFromConverter = 4,
	GameplayTagBlockConvert = 5,
	EndPlay = 6,
	Unknown = 7,
	EUnconvertReason_MAX = 8
};

// Enum FortniteGame.EHudVisibilityState
enum class EHudVisibilityState : uint8 {
	FullyVisible = 0,
	FullyHidden = 1,
	GameOnly = 2,
	ReplayOnly = 3,
	MAX = 4
};

// Enum FortniteGame.EFortReplayEventType
enum class EFortReplayEventType : uint8 {
	Elimination = 0,
	Eliminated = 1,
	DBNO = 2,
	UserPlaced = 3,
	MAX = 4
};

// Enum FortniteGame.EAthenaRoundsMutatorPhase
enum class EAthenaRoundsMutatorPhase : uint8 {
	GamePhase_Setup = 0,
	GamePhase_Warmup = 1,
	FadeOutToNextRound = 2,
	RoundSetup = 3,
	RoundPlay = 4,
	RoundEnd = 5,
	RoundEndUI = 6,
	MatchEndUI = 7,
	MatchEndedPrematurely = 8,
	EAthenaRoundsMutatorPhase_MAX = 9
};

// Enum FortniteGame.EQuestUpdateType
enum class EQuestUpdateType : uint8 {
	ObjectiveCompleted = 0,
	QuestCompleted = 1,
	ObjectiveUpdated = 2,
	QuestUpdated = 3,
	QuestAndObjectiveUpdate = 4,
	EQuestUpdateType_MAX = 5
};

// Enum FortniteGame.EQuestVisibilityResponse
enum class EQuestVisibilityResponse : uint8 {
	Hide = 0,
	Show = 1,
	Custom = 2,
	EQuestVisibilityResponse_MAX = 3
};

// Enum FortniteGame.EPlayerBountyThreatLevel
enum class EPlayerBountyThreatLevel : uint8 {
	Low = 0,
	Medium = 1,
	High = 2,
	MAX = 3
};

// Enum FortniteGame.EFortSimulatedXPSize
enum class EFortSimulatedXPSize : uint8 {
	None = 0,
	VerySmall = 1,
	Small = 2,
	Medium = 3,
	Large = 4,
	VeryLarge = 5,
	EFortSimulatedXPSize_MAX = 6
};

// Enum FortniteGame.EFortDialogFeedbackType
enum class EFortDialogFeedbackType : uint8 {
	FriendRequestSent = 0,
	FriendRequestReceived = 1,
	FriendRequestAccepted = 2,
	Default = 3,
	EFortDialogFeedbackType_MAX = 4
};

// Enum FortniteGame.EEventResponderEventType
enum class EEventResponderEventType : uint8 {
	OneShotEvent = 0,
	PersistentEventJoinInProgress = 1,
	PersistentEventStart = 2,
	PersistentEventChange = 3,
	PersistentEventEnd = 4,
	EEventResponderEventType_MAX = 5
};

// Enum FortniteGame.EHeldObjectState
enum class EHeldObjectState : uint8 {
	Unheld = 0,
	Held = 1,
	Thrown = 2,
	Placed = 3,
	Dropped = 4,
	HeldInVehicle = 5,
	EHeldObjectState_MAX = 6
};

// Enum FortniteGame.ELinkToDirection
enum class ELinkToDirection : uint8 {
	Up = 0,
	Down = 1,
	Right = 2,
	Left = 3,
	Forward = 4,
	Backward = 5,
	ELinkToDirection_MAX = 6
};

// Enum FortniteGame.EOfferPurchaseError
enum class EOfferPurchaseError : uint8 {
	NoError = 0,
	PendingServerConfirmation = 1,
	CannotAffordItem = 2,
	InvalidOfferID = 3,
	InvalidPriceIndex = 4,
	NoneLeft = 5,
	PurchaseAlreadyPending = 6,
	NoConnection = 7,
	AccountNotEligible = 8,
	CannotGiftItem = 9,
	MFANotEnabled = 10,
	EOfferPurchaseError_MAX = 11
};

// Enum FortniteGame.EFortAlteration
enum class EFortAlteration : uint8 {
	AttributeSlot = 0,
	GameplaySlot = 1,
	ComplexCosmeticSlot = 2,
	UserPickedCosmeticSlot = 3,
	ColorSlot = 4,
	HeroSpecializationTier1Slot = 5,
	HeroSpecializationTier2Slot = 6,
	HeroSpecializationTier3Slot = 7,
	HeroSpecializationTier4Slot = 8,
	HeroSpecializationTier5Slot = 9,
	EFortAlteration_MAX = 10
};

// Enum FortniteGame.EPlayerCompetitiveBanReasons
enum class EPlayerCompetitiveBanReasons : uint8 {
	None = 0,
	Cheating = 1,
	Collusion = 2,
	Toxicity = 3,
	Harassment = 4,
	Ringing = 5,
	Gambling = 6,
	Exploiting = 7,
	IntentionalDisconnect = 8,
	IllegalRestart = 9,
	Other = 10,
	AccountSharing = 11,
	CircumventingRegionLock = 12,
	CircumventingBan = 13,
	Smurfing = 14,
	CircumventingTeamLock = 15,
	EPlayerCompetitiveBanReasons_MAX = 16
};

// Enum FortniteGame.EPlayerBanReasons
enum class EPlayerBanReasons : uint8 {
	Teaming = 0,
	Afk_Leeching = 1,
	Harassment = 2,
	TradeScamming = 3,
	Exploiting = 4,
	Competitive = 5,
	Creative = 6,
	TeamingWithCheater = 7,
	EPlayerBanReasons_MAX = 8
};

// Enum FortniteGame.EAthenaRebootEligiblityStatus
enum class EAthenaRebootEligiblityStatus : uint8 {
	None = 0,
	User = 1,
	Squad = 2,
	EAthenaRebootEligiblityStatus_MAX = 3
};

// Enum FortniteGame.ECampaignCustomizationCategory
enum class ECampaignCustomizationCategory : uint8 {
	None = 0,
	PersonalVehicle = 1,
	ECampaignCustomizationCategory_MAX = 2
};

// Enum FortniteGame.EAthenaPartyMemberReadyType
enum class EAthenaPartyMemberReadyType : uint8 {
	Ready = 0,
	NotReady = 1,
	Playing = 2,
	Spectating = 3,
	WatchingReplay = 4,
	EAthenaPartyMemberReadyType_MAX = 5
};

// Enum FortniteGame.EFortFriendRequestStatus
enum class EFortFriendRequestStatus : uint8 {
	None = 0,
	Accepted = 1,
	PendingReceived = 2,
	PendingSent = 3,
	EFortFriendRequestStatus_MAX = 4
};

// Enum FortniteGame.EFortPartyMemberLocation
enum class EFortPartyMemberLocation : uint8 {
	PreLobby = 0,
	ConnectingToLobby = 1,
	Lobby = 2,
	JoiningGame = 3,
	ProcessingRejoin = 4,
	InGame = 5,
	Spectating = 6,
	WatchingReplay = 7,
	ReturningToFrontEnd = 8,
	EFortPartyMemberLocation_MAX = 9
};

// Enum FortniteGame.EFortPartyState
enum class EFortPartyState : uint8 {
	Undetermined = 0,
	WorldView = 1,
	TheaterView = 2,
	Matchmaking = 3,
	PostMatchmaking = 4,
	ReturningToFrontEnd = 5,
	BattleRoyaleView = 6,
	BattleRoyalePreloading = 7,
	BattleRoyaleMatchmaking = 8,
	BattleRoyalePostMatchmaking = 9,
	EFortPartyState_MAX = 10
};

// Enum FortniteGame.EFortPartyMemberDisplayState
enum class EFortPartyMemberDisplayState : uint8 {
	Open = 0,
	Connecting = 1,
	Connected = 2,
	Max = 3
};

// Enum FortniteGame.EFortHomingStyle
enum class EFortHomingStyle : uint8 {
	None = 0,
	LockOn = 1,
	LaserTargeted = 2,
	LaserTargeted_NoTrace = 3,
	DrunkArtillery = 4,
	EFortHomingStyle_MAX = 5
};

// Enum FortniteGame.EFortPrototypingStatus
enum class EFortPrototypingStatus : uint8 {
	Unknown = 0,
	Disabled = 1,
	Enabled = 2,
	EFortPrototypingStatus_MAX = 3
};

// Enum FortniteGame.EXPEventPriorityType
enum class EXPEventPriorityType : uint8 {
	NearReticle = 0,
	XPBarOnly = 1,
	TopCenter = 2,
	Feed = 3,
	EXPEventPriorityType_MAX = 4
};

// Enum FortniteGame.EFortQuestAnalyticState
enum class EFortQuestAnalyticState : uint8 {
	None = 0,
	Granted = 1,
	Claimed = 2,
	EFortQuestAnalyticState_MAX = 3
};

// Enum FortniteGame.EFortQuestType
enum class EFortQuestType : uint8 {
	Task = 0,
	Optional = 1,
	DailyQuest = 2,
	TransientQuest = 3,
	SurvivorQuest = 4,
	Achievement = 5,
	Onboarding = 6,
	StreamBroadcaster = 7,
	StreamViewer = 8,
	StreamSubscriber = 9,
	Athena = 10,
	AthenaDailyQuest = 11,
	AthenaEvent = 12,
	AthenaChallengeBundleQuest = 13,
	AthenaLooseQuest = 14,
	All = 15,
	EFortQuestType_MAX = 16
};

// Enum FortniteGame.EQuestMapScreenMode
enum class EQuestMapScreenMode : uint8 {
	Invalid = 0,
	MainCampaign = 1,
	Event = 2,
	EQuestMapScreenMode_MAX = 3
};

// Enum FortniteGame.EFortZoneType
enum class EFortZoneType : uint8 {
	PVE = 0,
	PVP = 1,
	Keep = 2,
	SingleZone = 3,
	Max_None = 4,
	EFortZoneType_MAX = 5
};

// Enum FortniteGame.EFortTheaterType
enum class EFortTheaterType : uint8 {
	Standard = 0,
	Elder = 1,
	PvP = 2,
	PvP2 = 3,
	Tutorial = 4,
	TutorialGate = 5,
	Max_None = 6,
	EFortTheaterType_MAX = 7
};

// Enum FortniteGame.EIntelStateEnum
enum class EIntelStateEnum : uint8 {
	None = 0,
	OnGround = 1,
	HeldByAttacker = 2,
	HeldByDefender = 3,
	Downloaded = 4,
	Captured = 5,
	Downloading = 6,
	EIntelStateEnum_MAX = 7
};

// Enum FortniteGame.EFortCreativeLinearMoverRotationDirection
enum class EFortCreativeLinearMoverRotationDirection : uint8 {
	EFCLMRD_Clockwise = 0,
	EFCLMRD_CounterClockwise = 1,
	EFCLMRD_MAX = 2
};

// Enum FortniteGame.EFortCreativeLinearMoverTranslationType
enum class EFortCreativeLinearMoverTranslationType : uint8 {
	EFCLMTT_None = 0,
	EFCLMTT_Forward = 1,
	EFCLMTT_Reverse = 2,
	EFCLMTT_MAX = 3
};

// Enum FortniteGame.EFortCreativeLinearMoverMode
enum class EFortCreativeLinearMoverMode : uint8 {
	EFCLMM_Translation = 0,
	EFCLMM_Rotation = 1,
	EFCLMM_MAX = 2
};

// Enum FortniteGame.EFortCreativeLinearMoverRotationAxis
enum class EFortCreativeLinearMoverRotationAxis : uint8 {
	EFCLMRA_Roll = 0,
	EFCLMRA_Pitch = 1,
	EFCLMRA_Yaw = 2,
	EFCLMRA_MAX = 3
};

// Enum FortniteGame.EFortCreativeLinearMoverMovementCompleteBehavior
enum class EFortCreativeLinearMoverMovementCompleteBehavior : uint8 {
	EFCLMMS_None = 0,
	EFCLMMS_Repeat = 1,
	EFCLMMS_PingPong = 2,
	EFCLMMS_Reset = 3,
	EFCLMMS_MAX = 4
};

// Enum FortniteGame.ETireStates
enum class ETireStates : uint8 {
	Default = 0,
	Popped = 1,
	ETireStates_MAX = 2
};

// Enum FortniteGame.ETireSurfaces
enum class ETireSurfaces : uint8 {
	Road = 0,
	Dirt = 1,
	Grass = 2,
	Air = 3,
	Water = 4,
	ETireSurfaces_MAX = 5
};

// Enum FortniteGame.EFortInvalidActivityReason
enum class EFortInvalidActivityReason : uint8 {
	None = 0,
	PartyTooBig = 1,
	NotPartyLeader = 2,
	MatchmakingAlready = 3,
	PlaylistDisabled = 4,
	PlayerIsLfg = 5,
	InvalidData = 6,
	EFortInvalidActivityReason_MAX = 7
};

// Enum FortniteGame.EUIExtensionSlot
enum class EUIExtensionSlot : uint8 {
	Invalid = 0,
	Primary = 1,
	Secondary = 2,
	TopRightCorner = 3,
	GameInfoBox = 4,
	Quickbar = 5,
	QuickbarUnderlay = 6,
	UpperCenter = 7,
	CrosshairRight = 8,
	UnderSquadInfo = 9,
	FullScreenMap = 10,
	BelowRespawnWidget = 11,
	BelowCompass = 12,
	UnderTeammateStatus = 13,
	ControllerBindingCallout = 14,
	AboveStormMessageSlot = 15,
	CustomMinigameCallouts = 16,
	UnderLocalPlayerInfo = 17,
	PlayerHealthbarOverlay = 18,
	PlayerOverHealthbarOverlay = 19,
	UnderMinimapMessageContainer = 20,
	VehicleActionsSpacer = 21,
	InventoryScreenReplacement = 22,
	Reticle = 23,
	KillfeedSlot = 24,
	PrioritizedContextualSlot = 25,
	RightOfTeammateStatus = 26,
	RightOfTeammateStatusBars = 27,
	TeammateStatusPortraitOverlay = 28,
	TeammateStatusPortraitUnderlay = 29,
	TeammateStatusPortraitOverlay_IGM = 30,
	TeammateOverHealthbarOverlay = 31,
	TeammateOverShieldbarOverlay = 32,
	MobileHUDBottomRight = 33,
	InventoryScreenTab = 34,
	InventoryPanelSubTab = 35,
	MiniMapOverlay = 36,
	AboveResourcesOverlay = 37,
	UnderResourcesOverlay = 38,
	InventoryEquipSlot = 39,
	InventoryItemInfo = 40,
	HUDEquippedItemInfo = 41,
	UnderneathTeammateStatusList = 42,
	FullScreenMapSquadEliminationsOverlay = 43,
	FullScreenMapStormInfo = 44,
	PrimaryQuickBarSlot = 45,
	MainMenuButtonListInZone = 46,
	MainMenuButtonListFrontEnd = 47,
	DynamicOverlayLobby = 48,
	PostMatchXPRecap = 49,
	MobileHUDUnderMinimap = 50,
	SidebarPanels = 51,
	SpectatorRightOfPlayerStatus = 52,
	LastKillerInfoStatus = 53,
	BehindMobileLocalPlayerInfo = 54,
	UnderMobileLocalPlayerInfo = 55,
	AboveMobileLocalPlayerInfo = 56,
	DynamicOverlayFrontEnd = 57,
	NPCStatusWidgetBarsPrefix = 58,
	NPCStatusWidgetAboveBars = 59,
	AbovePlayerIndicatorWidget = 60,
	AthenaDashboardWidgetOverlay = 61,
	FullScreenMapTab = 62,
	AboveBacchusEquippedItemReloadWidget = 63,
	EUIExtensionSlot_MAX = 64
};

// Enum FortniteGame.ESlotEnvironmentExposure
enum class ESlotEnvironmentExposure : uint8 {
	Unknown = 0,
	Exposed = 1,
	Protected = 2,
	ESlotEnvironmentExposure_MAX = 3
};

// Enum FortniteGame.EVehicleInitialOverlapBehavior
enum class EVehicleInitialOverlapBehavior : uint8 {
	None = 0,
	DontCollideUntilNotOverlapping = 1,
	DestroyWhenVehicleOccupied = 2,
	DestroyIfBackingInto = 3,
	EVehicleInitialOverlapBehavior_MAX = 4
};

// Enum FortniteGame.EDynamicBackgroudKey
enum class EDynamicBackgroudKey : uint8 {
	Lobby = 0,
	Vault = 1,
	Max_None = 2,
	EDynamicBackgroudKey_MAX = 3
};

// Enum FortniteGame.EFortDialogResult
enum class EFortDialogResult : uint8 {
	Confirmed = 0,
	Declined = 1,
	Ignored = 2,
	Killed = 3,
	TimedOut = 4,
	Unknown = 5,
	EFortDialogResult_MAX = 6
};

// Enum FortniteGame.EFortFrontendInventoryFilter
enum class EFortFrontendInventoryFilter : uint8 {
	Schematics = 0,
	WorldItems = 1,
	WorldItemsInGame = 2,
	WorldItemsStorage = 3,
	WorldItemsTransfer = 4,
	ConsumablesAndAccountResources = 5,
	Heroes = 6,
	Defenders = 7,
	Survivors = 8,
	AthenaCharacter = 9,
	AthenaBackpack = 10,
	AthenaPickaxe = 11,
	AthenaGliders = 12,
	AthenaContrails = 13,
	AthenaEmotes = 14,
	AthenaItemWraps = 15,
	AthenaLoadingScreens = 16,
	AthenaLobbyMusic = 17,
	AthenaCharm = 18,
	HestiaWeapons = 19,
	HestiaResources = 20,
	StarlightInventory = 21,
	Invisible = 22,
	Max_None = 23,
	EFortFrontendInventoryFilter_MAX = 24
};

// Enum FortniteGame.EFrontEndCamera
enum class EFrontEndCamera : uint8 {
	Invalid = 0,
	Command = 1,
	Command_HeroLoadout = 2,
	LegacyHeroLoadout = 3,
	Cosmetics = 4,
	Expeditions = 5,
	FrontendDefault = 6,
	Heroes = 7,
	HeroSelect = 8,
	HeroLoadout = 9,
	Home = 10,
	HomeBase = 11,
	Login = 12,
	Manage1 = 13,
	Manage2 = 14,
	Manage3 = 15,
	Manage4 = 16,
	MissionControl = 17,
	Party = 18,
	Play = 19,
	Research = 20,
	SkillTrees = 21,
	SmallCosmetics = 22,
	SpatialUI = 23,
	SpecialEvent = 24,
	SpecialEvent2 = 25,
	SpecialEvent3 = 26,
	Store = 27,
	StoreItemInspect = 28,
	StwFrontendDefault = 29,
	SurvivorSquadBuilding1 = 30,
	SurvivorSquadBuilding2 = 31,
	SurvivorSquadBuilding3 = 32,
	SurvivorSquadBuilding4 = 33,
	TutorialPhaseOne = 34,
	TutorialPhaseTwo = 35,
	TutorialPhaseThree = 36,
	Upgrades = 37,
	Vault = 38,
	WorldMap = 39,
	LobbyCentered = 40,
	CosmeticDisplay = 41,
	BattlePass = 42,
	Rewards = 43,
	SpecialEventRewards = 44,
	Armory = 45,
	EFrontEndCamera_MAX = 46
};

// Enum FortniteGame.EFortInventoryFilter
enum class EFortInventoryFilter : uint8 {
	WeaponMelee = 0,
	WeaponRanged = 1,
	Ammo = 2,
	Traps = 3,
	Consumables = 4,
	Ingredients = 5,
	Gadget = 6,
	Decorations = 7,
	Badges = 8,
	Heroes = 9,
	LeadSurvivors = 10,
	Survivors = 11,
	Defenders = 12,
	Resources = 13,
	ConversionControl = 14,
	AthenaCosmetics = 15,
	Playset = 16,
	CreativePlot = 17,
	TeamPerk = 18,
	Workers = 19,
	Invisible = 20,
	Max_None = 21,
	EFortInventoryFilter_MAX = 22
};

// Enum FortniteGame.EFortCraftFailCause
enum class EFortCraftFailCause : uint8 {
	Unknown = 0,
	NotEnoughResources = 1,
	InventoryFull = 2,
	InsufficientTeamLevel = 3,
	CraftingQueueFull = 4,
	CurrentlyLocked = 5,
	OverflowSchematic = 6,
	EFortCraftFailCause_MAX = 7
};

// Enum FortniteGame.ELevelManagementTerrainType
enum class ELevelManagementTerrainType : uint8 {
	Level = 0,
	Terrain = 1,
	ELevelManagementTerrainType_MAX = 2
};

// Enum FortniteGame.EFortReplicatedStat
enum class EFortReplicatedStat : uint8 {
	MonsterKills = 0,
	MonsterDamagePoints = 1,
	PlayerKills = 2,
	WoodGathered = 3,
	StoneGathered = 4,
	MetalGathered = 5,
	Deaths = 6,
	BluGloActivity = 7,
	BuildingsBuilt = 8,
	BuildingsBuilt_Wood = 9,
	BuildingsBuilt_Stone = 10,
	BuildingsBuilt_Metal = 11,
	BuildingsUpgraded_Wood2 = 12,
	BuildingsUpgraded_Wood3 = 13,
	BuildingsUpgraded_Stone2 = 14,
	BuildingsUpgraded_Stone3 = 15,
	BuildingsUpgraded_Metal2 = 16,
	BuildingsUpgraded_Metal3 = 17,
	BuildingsDestroyed = 18,
	Repair_Wood = 19,
	Repair_Stone = 20,
	Repair_Metal = 21,
	FlagsCaptured = 22,
	FlagsReturned = 23,
	ContainersLooted = 24,
	CraftingPoints = 25,
	TrapPlacementPoints = 26,
	TrapActivationPoints = 27,
	TotalScore = 28,
	OldTotalScore = 29,
	CombatScore = 30,
	BuildingScore = 31,
	UtilityScore = 32,
	BadgesScore = 33,
	None = 34,
	MAX = 35
};

// Enum FortniteGame.EFortPickerMode
enum class EFortPickerMode : uint8 {
	BuildingCategory = 0,
	TrapCategory = 1,
	WeaponCategory = 2,
	SocialCategory = 3,
	Building = 4,
	Trap = 5,
	TrapRadial = 6,
	Weapon = 7,
	Social = 8,
	DirectPickEmote = 9,
	DirectPickSpray = 10,
	SquadQuickChat = 11,
	WeaponsSlotted = 12,
	BattleLabDevice = 13,
	MusicSource = 14,
	NPCCommand = 15,
	EFortPickerMode_MAX = 16
};

// Enum FortniteGame.EFortRarity
enum class EFortRarity : uint8 {
	Common = 0,
	Uncommon = 1,
	Rare = 2,
	Epic = 3,
	Legendary = 4,
	Mythic = 5,
	Transcendent = 6,
	Unattainable = 7,
	NumRarityValues = 8,
	EFortRarity_MAX = 9
};

// Enum FortniteGame.EAthenaChallengeTimerState
enum class EAthenaChallengeTimerState : uint8 {
	Hidden = 0,
	WeeksRemaining = 1,
	DaysRemaining = 2,
	HoursRemaining = 3,
	MinutesRemaining = 4,
	Urgent = 5,
	EAthenaChallengeTimerState_MAX = 6
};

// Enum FortniteGame.EAthenaFilterDisplayType
enum class EAthenaFilterDisplayType : uint8 {
	UseCategoryName = 0,
	ShowFilterString = 1,
	EAthenaFilterDisplayType_MAX = 2
};

// Enum FortniteGame.EInventoryContentSortType
enum class EInventoryContentSortType : uint8 {
	ByName = 0,
	ByRating = 1,
	ByLevel = 2,
	ByCategory = 3,
	ByRarity = 4,
	ByLocation = 5,
	ByPersonality = 6,
	ByBonus = 7,
	BySubtype = 8,
	ByGrantTime = 9,
	BySeries = 10,
	BySet = 11,
	ByReleaseDate = 12,
	Invalid = 13,
	EInventoryContentSortType_MAX = 14
};

// Enum FortniteGame.ESpecialActorStatType
enum class ESpecialActorStatType : uint8 {
	NumEliminationsNearby = 0,
	TimeInWorld = 1,
	PickupNumSpawns = 2,
	PickupNumDespawns = 3,
	PickupNumDropped = 4,
	PickupNumTaken = 5,
	PlayerWon = 6,
	PlayerNumEliminations = 7,
	PlayerNum = 8,
	TotalStats = 9,
	ESpecialActorStatType_MAX = 10
};

// Enum FortniteGame.EPTTState
enum class EPTTState : uint8 {
	Enabled = 0,
	MicDisabled = 1,
	AllSoundDisabled = 2,
	EPTTState_MAX = 3
};

// Enum FortniteGame.ETouchInteractMode
enum class ETouchInteractMode : uint8 {
	Off = 0,
	InWorld = 1,
	Buttons = 2,
	ETouchInteractMode_MAX = 3
};

// Enum FortniteGame.EDuelState
enum class EDuelState : uint8 {
	Started = 0,
	Won = 1,
	Lost = 2,
	EDuelState_MAX = 3
};

// Enum FortniteGame.EFortInputActionGroup
enum class EFortInputActionGroup : uint8 {
	AllModes = 0,
	Combat = 1,
	Building = 2,
	Movement = 3,
	Edit = 4,
	Death = 5,
	Cinematic = 6,
	Picker = 7,
	Other = 8,
	Interaction = 9,
	AthenaLTMAbilities = 10,
	ShoppingCart = 11,
	ShoppingCartDriver = 12,
	ShoppingCartPassenger = 13,
	Cannon = 14,
	CannonDriver = 15,
	CannonPassenger = 16,
	GolfCart = 17,
	GolfCartDriver = 18,
	GolfCartPassenger = 19,
	QuadCrasher = 20,
	QuadCrasherDriver = 21,
	QuadCrasherPassenger = 22,
	Biplane = 23,
	BiplaneDriver = 24,
	BiplaneGroundDriver = 25,
	BiplanePassenger = 26,
	Hamsterball = 27,
	Jackal = 28,
	Ostrich = 29,
	OstrichDriver = 30,
	OstrichPassenger = 31,
	Meatball = 32,
	MeatballDriver = 33,
	MeatballPassenger = 34,
	HoagieDriver = 35,
	Dagwood = 36,
	DagwoodDriver = 37,
	DagwoodPassenger = 38,
	Nevada = 39,
	NevadaDriver = 40,
	MountedTurret = 41,
	Spectating = 42,
	FullscreenMap = 43,
	CreativeAll = 44,
	CreativeModeratorMode = 45,
	CreativeMoveToolEquipped = 46,
	CreativeMoveObjectsFreely = 47,
	CreativeMoveBuildingsOnGrid = 48,
	CreativeFlying = 49,
	CreativeIslandPanel = 50,
	PropSelectorEquipped = 51,
	DBNOCarryStart = 52,
	DBNOCarryStop = 53,
	DBNOCarry = 54,
	InteractionStart = 55,
	InteractionStop = 56,
	BattleLab = 57,
	RemoteControl = 58,
	SuperDuper = 59,
	Tether = 60,
	Riding = 61,
	Tank = 62,
	TankDriver = 63,
	TankPassenger = 64,
	RockVehicle = 65,
	RockVehicleB = 66,
	CombatAndBuilding = 67,
	CombatAndAthenaLTMAbilities = 68,
	CombatBuildingAndAthenaLTMAbilities = 69,
	EFortInputActionGroup_MAX = 70
};

// Enum FortniteGame.EFortBangType
enum class EFortBangType : uint8 {
	Invalid = 0,
	Custom = 1,
	PlayTab = 2,
	VaultTab = 3,
	StoreTab = 4,
	FriendsButton = 5,
	PartyInviteButton = 6,
	SubGameAccessChanged = 7,
	DailyRewardsButton = 8,
	QuestsButton = 9,
	CompletedExpeditions = 10,
	MainMenu = 11,
	HelpMenu = 12,
	VaultSchematics = 13,
	VaultLeadSurvivors = 14,
	VaultSurvivors = 15,
	VaultHeroes = 16,
	VaultDefenders = 17,
	VaultResources = 18,
	VaultMelee = 19,
	VaultRanged = 20,
	VaultConsumables = 21,
	VaultIngredients = 22,
	VaultTraps = 23,
	BattlePassTab = 24,
	SpecialEventTab = 25,
	CosmeticsTab = 26,
	CosmeticsOutfit = 27,
	CosmeticGlider = 28,
	CosmeticContrail = 29,
	CosmeticBattleBus = 30,
	CosmeticVehicle = 31,
	CosmeticItemWrap = 32,
	CosmeticCallingCard = 33,
	CosmeticMapMarker = 34,
	CosmeticMusicPack = 35,
	CosmeticPetSkin = 36,
	CosmeticLoadingScreen = 37,
	CosmeticBackpack = 38,
	CosmeticHat = 39,
	CosmeticPickaxe = 40,
	CosmeticDance = 41,
	CosmeticCharm = 42,
	AthenaDirectedAcquisitionTab = 43,
	ItemShop_RMTItemOfferTab = 44,
	ItemShop_FeaturedTab = 45,
	ItemShop_DailyTab = 46,
	ItemShop_SpecialFeaturedTab = 47,
	ItemShop_SpecialDailyTab = 48,
	ItemShop_StandaloneTab = 49,
	ItemShop_CommunityVotingTab = 50,
	ItemShop_MegaBundleTab = 51,
	ItemShop_BattlePassTab = 52,
	AthenaChallengesTab = 53,
	AthenaShowdownTab = 54,
	AthenaCareerTab = 55,
	PlayerBanners = 56,
	STWCommand = 57,
	STWCommand_Heroes = 58,
	STWCommand_Heroes_Manage = 59,
	STWCommand_Heroes_HeroLoadout = 60,
	STWCommand_Heroes_Defenders = 61,
	STWCommand_Heroes_Expeditions = 62,
	STWCommand_Survivors = 63,
	STWCommand_Survivors_Manage = 64,
	STWCommand_Survivors_Squads = 65,
	STWCommand_Upgrades = 66,
	STWCommand_Research = 67,
	STWCommand_AccountXP = 68,
	STWArmory = 69,
	STWArmory_Schematics = 70,
	STWArmory_Backpack = 71,
	STWArmory_Storage = 72,
	STWArmory_CollectionBook = 73,
	STWArmory_Transform = 74,
	STWArmory_Resources = 75,
	STWLocker = 76,
	EFortBangType_MAX = 77
};

// Enum FortniteGame.EFortItemInspectionMode
enum class EFortItemInspectionMode : uint8 {
	Overview = 0,
	Details = 1,
	View = 2,
	Evolution = 3,
	Upgrade = 4,
	UpgradeRarity = 5,
	Promotion = 6,
	EFortItemInspectionMode_MAX = 7
};

// Enum FortniteGame.EItemListViewDisplayType
enum class EItemListViewDisplayType : uint8 {
	World = 0,
	Outpost = 1,
	Account = 2,
	DeployableBase = 3,
	Max = 4
};

// Enum FortniteGame.EFortItemViewRotationMode
enum class EFortItemViewRotationMode : uint8 {
	None = 0,
	BoundsPivot = 1,
	World = 2,
	Relative = 3,
	Self = 4,
	EFortItemViewRotationMode_MAX = 5
};

// Enum FortniteGame.EFortGlobalAction
enum class EFortGlobalAction : uint8 {
	TrapConfirm = 0,
	TrapPicker = 1,
	BuildConfirm = 2,
	PerformBuildingEditInteraction = 3,
	PerformBuildingImprovementInteraction = 4,
	SwitchQuickBar = 5,
	Use = 6,
	Reload = 7,
	InventoryOrChatHold = 8,
	GamepadChangeMaterialOrHarvestHold = 9,
	GamepadNextWeaponOrHarvestHold = 10,
	GamepadNextWeaponOrAltInteractOrHarvestHold = 11,
	ChangeMaterial = 12,
	Fire = 13,
	RotatePrimitiveClockwise = 14,
	Gadget1 = 15,
	Gadget2 = 16,
	Ability1 = 17,
	Ability2 = 18,
	Ability3 = 19,
	ToggleFullScreenMap = 20,
	ToggleInventory = 21,
	Jump = 22,
	Crouch = 23,
	ShoppingCartCoast = 24,
	GolfCartEBrake = 25,
	GolfCartForward = 26,
	GolfCartReverse = 27,
	GolfCartHonk = 28,
	GamepadToggleHarvestOrHoldCreativePhone = 29,
	GamepadToggleCreativePhoneWeapon = 30,
	Count = 31,
	EFortGlobalAction_MAX = 32
};

// Enum FortniteGame.ESquadSlotType
enum class ESquadSlotType : uint8 {
	HeroSquadMissionDefender = 0,
	SurvivorSquadLeadSurvivor = 1,
	SurvivorSquadSurvivor = 2,
	DefenderSquadMember = 3,
	ExpeditionSquadMember = 4,
	ESquadSlotType_MAX = 5
};

// Enum FortniteGame.EFortHomebaseSquadType
enum class EFortHomebaseSquadType : uint8 {
	AttributeSquad = 0,
	CombatSquad = 1,
	DefenderSquad = 2,
	ExpeditionSquad = 3,
	Max_None = 4,
	EFortHomebaseSquadType_MAX = 5
};

// Enum FortniteGame.EMotionTarget
enum class EMotionTarget : uint8 {
	Camera = 0,
	AimedObject = 1,
	EMotionTarget_MAX = 2
};

// Enum FortniteGame.EBarrierFlagState
enum class EBarrierFlagState : uint8 {
	FlagUp = 0,
	FlagDown = 1,
	EBarrierFlagState_MAX = 2
};

// Enum FortniteGame.EBarrierState
enum class EBarrierState : uint8 {
	BarrierUp = 0,
	BarrierComingDown = 1,
	BarrierDown = 2,
	EBarrierState_MAX = 3
};

// Enum FortniteGame.EAthenaBroadcastKillFeedEntryType
enum class EAthenaBroadcastKillFeedEntryType : uint8 {
	Elimination = 0,
	Storm = 1,
	FallDamage = 2,
	Explosion = 3,
	DBNO = 4,
	EAthenaBroadcastKillFeedEntryType_MAX = 5
};

// Enum FortniteGame.EContentionRuleType
enum class EContentionRuleType : uint8 {
	MajorityWins = 0,
	OneTeamOnlyWins = 1,
	EContentionRuleType_MAX = 2
};

// Enum FortniteGame.ECapturePointUnlockRules
enum class ECapturePointUnlockRules : uint8 {
	Reset = 0,
	MaintainState = 1,
	ResetDeactivate = 2,
	ECapturePointUnlockRules_MAX = 3
};

// Enum FortniteGame.EVariantUnlockType
enum class EVariantUnlockType : uint8 {
	UnlockAll = 0,
	ExclusiveChoice = 1,
	EVariantUnlockType_MAX = 2
};

// Enum FortniteGame.EMontageSelectionPredicateType
enum class EMontageSelectionPredicateType : uint8 {
	NotSet = 0,
	MetaTags = 1,
	CharacterParts = 2,
	ActiveSwapPresence = 3,
	Invalid = 4,
	EMontageSelectionPredicateType_MAX = 5
};

// Enum FortniteGame.EAthenaPIEStartupMode
enum class EAthenaPIEStartupMode : uint8 {
	UseDefaults = 0,
	Warmup = 1,
	WarmupPaused = 2,
	Aircraft = 3,
	AircraftPaused = 4,
	Gameplay = 5,
	EAthenaPIEStartupMode_MAX = 6
};

// Enum FortniteGame.EEventTokenType
enum class EEventTokenType : uint8 {
	Invite = 0,
	Creation = 1,
	EEventTokenType_MAX = 2
};

// Enum FortniteGame.ELayeredAudioTriggerDirection
enum class ELayeredAudioTriggerDirection : uint8 {
	AnyDirection = 0,
	Forwards = 1,
	Sideways = 2,
	Backwards = 3,
	Count = 4,
	ELayeredAudioTriggerDirection_MAX = 5
};

// Enum FortniteGame.EGliderTrailActivationMode
enum class EGliderTrailActivationMode : uint8 {
	None = 0,
	AutoActivate = 1,
	FullyDeployed = 2,
	EGliderTrailActivationMode_MAX = 3
};

// Enum FortniteGame.EGliderTrailAttachmentMode
enum class EGliderTrailAttachmentMode : uint8 {
	GliderMesh = 0,
	PlayerPawn = 1,
	EGliderTrailAttachmentMode_MAX = 2
};

// Enum FortniteGame.EItemWrapSectionNames
enum class EItemWrapSectionNames : uint8 {
	 = 0,
	 = 1,
	 = 2,
	 = 3,
	 = 4,
	 = 5,
	 = 6,
	 = 7,
	 = 8,
	 = 9,
	 = 10,
	 = 11,
	 = 12,
	 = 13,
	 = 14,
	 = 15,
	 = 16,
	 = 17,
	 = 18,
	 = 19,
	 = 20,
	 = 21,
	 = 22,
	 = 23,
	 = 24,
	 = 25,
	 = 26,
	 = 27,
	 = 28,
	 = 29,
	 = 30,
	 = 31,
	Section_MAX = 32
};

// Enum FortniteGame.ECancelMarkerReason
enum class ECancelMarkerReason : uint8 {
	Ping = 0,
	MapOrDeath = 1,
	ECancelMarkerReason_MAX = 2
};

// Enum FortniteGame.EAthenaPetAttachRule
enum class EAthenaPetAttachRule : uint8 {
	AttachToBackpack = 0,
	AttachToBody = 1,
	EAthenaPetAttachRule_MAX = 2
};

// Enum FortniteGame.EAthenaQuickChatFilteringType
enum class EAthenaQuickChatFilteringType : uint8 {
	AlwaysVisible = 0,
	ActiveMaterial = 1,
	FacingPickup = 2,
	ActiveHotbarItem = 3,
	ActiveHotbarItemAmmo = 4,
	FacingPickupOrActiveHotbarItem = 5,
	NoWeaponEquippedRequiringAmmo = 6,
	WeaponEquippedOfAmmoType = 7,
	EAthenaQuickChatFilteringType_MAX = 8
};

// Enum FortniteGame.EAthenaRewardItemType
enum class EAthenaRewardItemType : uint8 {
	Normal = 0,
	HiddenReward = 1,
	GiftboxHiddenReward = 2,
	NonExportedFakeReward = 3,
	EAthenaRewardItemType_MAX = 4
};

// Enum FortniteGame.EAthenaRewardVisualImportanceType
enum class EAthenaRewardVisualImportanceType : uint8 {
	Normal = 0,
	Hot = 1,
	CrazyHot = 2,
	Crazy = 3,
	EAthenaRewardVisualImportanceType_MAX = 4
};

// Enum FortniteGame.EAthenaSeasonRewardTrack
enum class EAthenaSeasonRewardTrack : uint8 {
	Invalid = 0,
	SeasonProgressionTrack = 1,
	CompendiumFreeTrack = 2,
	CompendiumPaidTrack = 3,
	CompendiumAdditionalTrack = 4,
	EAthenaSeasonRewardTrack_MAX = 5
};

// Enum FortniteGame.EBattlePassRewardSource
enum class EBattlePassRewardSource : uint8 {
	None = 0,
	ChallengeBundle = 1,
	Quest = 2,
	EBattlePassRewardSource_MAX = 3
};

// Enum FortniteGame.EPageItemTileSize
enum class EPageItemTileSize : uint8 {
	 = 0,
	 = 1,
	 = 2,
	 = 3,
	 = 4,
	Count = 5,
	EPageItemTileSize_MAX = 6
};

// Enum FortniteGame.EAthenaSeasonMapIconState
enum class EAthenaSeasonMapIconState : uint8 {
	Unknown = 0,
	Found = 1,
	Interacted = 2,
	EAthenaSeasonMapIconState_MAX = 3
};

// Enum FortniteGame.ETraversePointState
enum class ETraversePointState : uint8 {
	None = 0,
	Hidden = 1,
	Active = 2,
	TouchedByPlayer = 3,
	Finished = 4,
	ETraversePointState_MAX = 5
};

// Enum FortniteGame.EFortVehicleDecoType
enum class EFortVehicleDecoType : uint8 {
	Unknown = 0,
	Flag = 1,
	HoodOrnament = 2,
	Wings = 3,
	EFortVehicleDecoType_MAX = 4
};

// Enum FortniteGame.EWrapPreviewCamera
enum class EWrapPreviewCamera : uint8 {
	Weapon = 0,
	LargeWeapon = 1,
	Vehicle = 2,
	EWrapPreviewCamera_MAX = 3
};

// Enum FortniteGame.EAutoFrameMode
enum class EAutoFrameMode : uint8 {
	Off = 0,
	ManualOverride = 1,
	AutoFrame = 2,
	EAutoFrameMode_MAX = 3
};

// Enum FortniteGame.EBacchusHUDStateType
enum class EBacchusHUDStateType : uint8 {
	DoNothing = 0,
	Hide = 1,
	Show = 2,
	FallbackToDefault = 3,
	EBacchusHUDStateType_MAX = 4
};

// Enum FortniteGame.BattleMapHoveredReason
enum class BattleMapHoveredReason : uint8 {
	None = 0,
	Mouse = 1,
	Code = 2,
	BattleMapHoveredReason_MAX = 3
};

// Enum FortniteGame.EBuildingTickReason
enum class EBuildingTickReason : uint8 {
	Dynamic = 0,
	Damaged = 1,
	GameplayCue_Damage = 2,
	GameplayCue_Healing = 3,
	GameplayCue_InstantDeath = 4,
	UnderConstruction = 5,
	UnderRepair = 6,
	Editing = 7,
	BuildingAnimation = 8,
	DynamicLODAnim = 9,
	DynamicShrinkAnim = 10,
	AutoBuild = 11,
	FullHealthEffect = 12,
	BounceAnimation = 13,
	DoorOpenStyleChanged = 14,
	DoorOpenChanged = 15,
	DoorInteract = 16,
	CinematicCamera = 17,
	EBuildingTickReason_MAX = 18
};

// Enum FortniteGame.ENavLinkPreviewMode
enum class ENavLinkPreviewMode : uint8 {
	None = 0,
	Definition = 1,
	Cache = 2,
	ENavLinkPreviewMode_MAX = 3
};

// Enum FortniteGame.ECalendarDrivenState
enum class ECalendarDrivenState : uint8 {
	ForceEnable = 0,
	ForceDisable = 1,
	ECalendarDrivenState_MAX = 2
};

// Enum FortniteGame.EBinaryToggleValues
enum class EBinaryToggleValues : uint8 {
	BTV_Active = 0,
	BTV_Inactive = 1,
	BTV_Either = 2,
	BTV_MAX = 3
};

// Enum FortniteGame.EAuxIndicatorStates
enum class EAuxIndicatorStates : uint8 {
	AIS_GuidingArrow = 0,
	AIS_ConfirmedArrow = 1,
	AIS_Inactive = 2,
	AIS_Active = 3,
	AIS_MAX = 4
};

// Enum FortniteGame.EBuildingFoundationType
enum class EBuildingFoundationType : uint8 {
	BFT_3x3 = 0,
	BFT_5x5 = 1,
	BFT_5x10 = 2,
	BFT_None = 3,
	BFT_MAX = 4
};

// Enum FortniteGame.EDynamicFoundationType
enum class EDynamicFoundationType : uint8 {
	Static = 0,
	StartEnabled_Stationary = 1,
	StartEnabled_Dynamic = 2,
	StartDisabled = 3,
	EDynamicFoundationType_MAX = 4
};

// Enum FortniteGame.EDynamicFoundationEnabledState
enum class EDynamicFoundationEnabledState : uint8 {
	Unknown = 0,
	Enabled = 1,
	Disabled = 2,
	EDynamicFoundationEnabledState_MAX = 3
};

// Enum FortniteGame.ESpawnMachineSubTextState
enum class ESpawnMachineSubTextState : uint8 {
	NoCards = 0,
	VanInUse = 1,
	TeamOnOtherVan = 2,
	None = 3,
	HasResource = 4,
	NoResource = 5,
	ESpawnMachineSubTextState_MAX = 6
};

// Enum FortniteGame.EFortItemCollectorState
enum class EFortItemCollectorState : uint8 {
	CanInteract = 0,
	Active = 1,
	Inactive = 2,
	Captured = 3,
	Invalid = 4,
	EFortItemCollectorState_MAX = 5
};

// Enum FortniteGame.EFortItemCollectorBehavior
enum class EFortItemCollectorBehavior : uint8 {
	FirstToGoal = 0,
	FreeForAll = 1,
	EFortItemCollectorBehavior_MAX = 2
};

// Enum FortniteGame.EFortItemCollectorTrackingType
enum class EFortItemCollectorTrackingType : uint8 {
	Player = 0,
	Team = 1,
	EFortItemCollectorTrackingType_MAX = 2
};

// Enum FortniteGame.ELayoutRequirementStatus
enum class ELayoutRequirementStatus : uint8 {
	Inactive_Invisible = 0,
	Active_Invisible = 1,
	Active_Visible = 2,
	ELayoutRequirementStatus_MAX = 3
};

// Enum FortniteGame.EMusicTrackPlayback
enum class EMusicTrackPlayback : uint8 {
	Disabled = 0,
	Enabled = 1,
	EMusicTrackPlayback_MAX = 2
};

// Enum FortniteGame.EPlayerCaptureKnobOptions
enum class EPlayerCaptureKnobOptions : uint8 {
	Off = 0,
	EachPlayer = 1,
	OnePlayerPerTeam = 2,
	OwningTeam = 3,
	EPlayerCaptureKnobOptions_MAX = 4
};

// Enum FortniteGame.ECaptureAreaItemFilters
enum class ECaptureAreaItemFilters : uint8 {
	None = 0,
	Both = 1,
	ForPeriodicScoring = 2,
	ToTakeControl = 3,
	ECaptureAreaItemFilters_MAX = 4
};

// Enum FortniteGame.ECreativeVendingMachineState
enum class ECreativeVendingMachineState : uint8 {
	DisplayingItem = 0,
	AcceptingItem = 1,
	AcceptedItem = 2,
	RejectedItem = 3,
	ECreativeVendingMachineState_MAX = 4
};

// Enum FortniteGame.EFortRiftSlotStatus
enum class EFortRiftSlotStatus : uint8 {
	Reserved = 0,
	Occupied = 1,
	Max_None = 2,
	EFortRiftSlotStatus_MAX = 3
};

// Enum FortniteGame.EFortRiftSpawnSlotSelectionMode
enum class EFortRiftSpawnSlotSelectionMode : uint8 {
	Random = 0,
	BestScore = 1,
	EFortRiftSpawnSlotSelectionMode_MAX = 2
};

// Enum FortniteGame.ERiftCosmeticState
enum class ERiftCosmeticState : uint8 {
	None = 0,
	Intro = 1,
	Idle = 2,
	RampUp = 3,
	ShouldDie = 4,
	ERiftCosmeticState_MAX = 5
};

// Enum FortniteGame.EBuildingAnim
enum class EBuildingAnim : uint8 {
	EBA_None = 0,
	EBA_Building = 1,
	EBA_Breaking = 2,
	EBA_Constructed = 3,
	EBA_Destruction = 4,
	EBA_Placement = 5,
	EBA_DynamicLOD = 6,
	EBA_DynamicShrink = 7,
	EBA_MAX = 8
};

// Enum FortniteGame.EBuildingAttachmentSlot
enum class EBuildingAttachmentSlot : uint8 {
	SLOT_Floor = 0,
	SLOT_Wall = 1,
	SLOT_Ceiling = 2,
	SLOT_None = 3,
	SLOT_MAX = 4
};

// Enum FortniteGame.EBuildingAttachmentSide
enum class EBuildingAttachmentSide : uint8 {
	Front = 0,
	Back = 1,
	Any = 2,
	EBuildingAttachmentSide_MAX = 3
};

// Enum FortniteGame.EPlacementType
enum class EPlacementType : uint8 {
	Free = 0,
	Grid = 1,
	None = 2,
	EPlacementType_MAX = 3
};

// Enum FortniteGame.ESavedSupportStatus
enum class ESavedSupportStatus : uint8 {
	UnknownState = 0,
	Supported = 1,
	UnSupported = 2,
	ESavedSupportStatus_MAX = 3
};

// Enum FortniteGame.EStructuralSupportCheck
enum class EStructuralSupportCheck : uint8 {
	Stable = 0,
	Unstable = 1,
	Max_None = 2,
	EStructuralSupportCheck_MAX = 3
};

// Enum FortniteGame.EFortDamageVisualsState
enum class EFortDamageVisualsState : uint8 {
	UnDamaged = 0,
	DamagedAndAnimating = 1,
	DamagedAndStatic = 2,
	EFortDamageVisualsState_MAX = 3
};

// Enum FortniteGame.EBuildingNavObstacleType
enum class EBuildingNavObstacleType : uint8 {
	UnwalkableAll = 0,
	UnwalkableHuskOnly = 1,
	SmashWhenLowHeight = 2,
	SmashOnlyLowHeight = 3,
	SmashSmasherOnly = 4,
	SmashAll = 5,
	EBuildingNavObstacleType_MAX = 6
};

// Enum FortniteGame.EStructuralWallPosition
enum class EStructuralWallPosition : uint8 {
	Left = 0,
	Right = 1,
	Front = 2,
	Back = 3,
	EStructuralWallPosition_MAX = 4
};

// Enum FortniteGame.EStructuralFloorPosition
enum class EStructuralFloorPosition : uint8 {
	Top = 0,
	Bottom = 1,
	EStructuralFloorPosition_MAX = 2
};

// Enum FortniteGame.EFortDefenderInteractionError
enum class EFortDefenderInteractionError : uint8 {
	None = 0,
	Obstructed = 1,
	NoEditPermission = 2,
	UsedByAnotherPlayer = 3,
	EFortDefenderInteractionError_MAX = 4
};

// Enum FortniteGame.EBuildingAttachmentType
enum class EBuildingAttachmentType : uint8 {
	ATTACH_Floor = 0,
	ATTACH_Wall = 1,
	ATTACH_Ceiling = 2,
	ATTACH_Corner = 3,
	ATTACH_All = 4,
	ATTACH_WallThenFloor = 5,
	ATTACH_FloorAndStairs = 6,
	ATTACH_CeilingAndStairs = 7,
	ATTACH_StairsBothSides = 8,
	ATTACH_None = 9,
	ATTACH_MAX = 10
};

// Enum FortniteGame.EFortTextureDataType
enum class EFortTextureDataType : uint8 {
	Any = 0,
	OuterWall = 1,
	InnerWall = 2,
	Corner = 3,
	Floor = 4,
	Ceiling = 5,
	Trim = 6,
	Roof = 7,
	Pillar = 8,
	Shingle = 9,
	None = 10,
	EFortTextureDataType_MAX = 11
};

// Enum FortniteGame.EFortTextureDataSlot
enum class EFortTextureDataSlot : uint8 {
	Primary = 0,
	Secondary = 1,
	Tertiary = 2,
	Fourth = 3,
	NumSlots = 4,
	EFortTextureDataSlot_MAX = 5
};

// Enum FortniteGame.EFortColorOverrideSlot
enum class EFortColorOverrideSlot : uint8 {
	ColorOverride0 = 0,
	ColorOverride1 = 1,
	ColorOverride2 = 2,
	ColorOverride3 = 3,
	MAX = 4
};

// Enum FortniteGame.EFortBuildingState
enum class EFortBuildingState : uint8 {
	Placement = 0,
	EditMode = 1,
	None = 2,
	EFortBuildingState_MAX = 3
};

// Enum FortniteGame.EFortStructuralGridQueryResults
enum class EFortStructuralGridQueryResults : uint8 {
	CanAdd = 0,
	ExistingActor = 1,
	Obstructed = 2,
	NoStructuralSupport = 3,
	InvalidActor = 4,
	ReachedLimit = 5,
	NoEditPermission = 6,
	PatternNotPermittedByLayoutRequirement = 7,
	ResourceTypeNotPermittedByLayoutRequirement = 8,
	BuildingAtRequirementsDisabled = 9,
	BuildingOtherThanRequirementsDisabled = 10,
	EFortStructuralGridQueryResults_MAX = 11
};

// Enum FortniteGame.EFortDecoPlacementQueryResults
enum class EFortDecoPlacementQueryResults : uint8 {
	CanAdd = 0,
	ExistingTrap = 1,
	ExistingObject = 2,
	Obstructed = 3,
	NoLocation = 4,
	WrongType = 5,
	WrongShape = 6,
	BeingModified = 7,
	WrongTeam = 8,
	BlueprintFailure = 9,
	AbilityFailure = 10,
	RequiresPlayerBuildableActor = 11,
	NoEditPermission = 12,
	WrongZone = 13,
	EFortDecoPlacementQueryResults_MAX = 14
};

// Enum FortniteGame.EFortConnectivityCubeFace
enum class EFortConnectivityCubeFace : uint8 {
	Front = 0,
	Left = 1,
	Back = 2,
	Right = 3,
	Upper = 4,
	Lower = 5,
	MAX = 6
};

// Enum FortniteGame.EFortBounceType
enum class EFortBounceType : uint8 {
	Hit = 0,
	Interact = 1,
	EditPlaced = 2,
	EFortBounceType_MAX = 3
};

// Enum FortniteGame.EFortBuildingDestroyedReason
enum class EFortBuildingDestroyedReason : uint8 {
	Unknown = 0,
	WeaponDamage = 1,
	LostSupport = 2,
	Edit = 3,
	FireDirect = 4,
	FireIndirect = 5,
	EFortBuildingDestroyedReason_MAX = 6
};

// Enum FortniteGame.EDoorOpenStyle
enum class EDoorOpenStyle : uint8 {
	Open = 0,
	SlamOpen = 1,
	SmashOpen = 2,
	Close = 3,
	EDoorOpenStyle_MAX = 4
};

// Enum FortniteGame.ESmoothProgressState
enum class ESmoothProgressState : uint8 {
	Enabled = 0,
	DisabledByState = 1,
	ESmoothProgressState_MAX = 2
};

// Enum FortniteGame.EClientContentReadiness
enum class EClientContentReadiness : uint8 {
	AwaitingServerResponse = 0,
	ReceivedServerResponse = 1,
	ReceivingContentNames = 2,
	DownloadingContent = 3,
	MountingContent = 4,
	ReadyToJoin = 5,
	FailedToMount = 6,
	NotConnected = 7,
	ConnectionFailed = 8,
	CelluarDataRefusal = 9,
	CancelledDownloadContent = 10,
	None = 11,
	EClientContentReadiness_MAX = 12
};

// Enum FortniteGame.EClientContentReadinessV2
enum class EClientContentReadinessV2 : uint8 {
	NotConnected = 0,
	AwaitingServerResponse = 1,
	GeneratingManifests = 2,
	MountingContent = 3,
	LoadedContent = 4,
	ReadyToJoin = 5,
	AllRequestsComplete = 6,
	Disconnecting = 7,
	None = 8,
	EClientContentReadinessV2_MAX = 9
};

// Enum FortniteGame.EServerContentReadinessV2
enum class EServerContentReadinessV2 : uint8 {
	Initializing = 0,
	GeneratingManifests = 1,
	WaitingForClient = 2,
	ReadyToJoin = 3,
	Disconnecting = 4,
	EServerContentReadinessV2_MAX = 5
};

// Enum FortniteGame.EContentRequestStatus
enum class EContentRequestStatus : uint8 {
	None = 0,
	Active = 1,
	Finished = 2,
	EContentRequestStatus_MAX = 3
};

// Enum FortniteGame.EContentBeaconHostGlobalState
enum class EContentBeaconHostGlobalState : uint8 {
	Initializing = 0,
	Running = 1,
	WaitingForUnload = 2,
	PendingShutdown = 3,
	Shutdown = 4,
	EContentBeaconHostGlobalState_MAX = 5
};

// Enum FortniteGame.EContentRequestInstallState
enum class EContentRequestInstallState : uint8 {
	None = 0,
	Initialized = 1,
	ManifestsBuilt = 2,
	Installed = 3,
	HostLoadedClientsInstalled = 4,
	HostActiveClientsInstalled = 5,
	Loaded = 6,
	Active = 7,
	ClientsUninstalled = 8,
	Uninstalled = 9,
	COMPLETELYLOADED = 7,
	EContentRequestInstallState_MAX = 10
};

// Enum FortniteGame.EContentBeaconErrorCode
enum class EContentBeaconErrorCode : uint8 {
	Success = 0,
	FailedToConnect = 1,
	FailedToGenerateContentPackage = 2,
	FailedToCreateContentPackageResolver = 3,
	RequestInvalid = 4,
	ContentPackageResolverBecameInvalid = 5,
	PackageResolveFlowCancelled = 6,
	FailedToBuildManifestServer = 7,
	FailedToBuildManifestClient = 8,
	FailedToInstallModule = 9,
	InvalidStateRequested = 10,
	DuplicateClientConnected = 11,
	TimeoutUnspecifiedClientTransition = 12,
	TimeoutUnspecifiedRequestTransition = 13,
	TimeoutRequestTransitionHostActive = 14,
	TimeoutRequestTransitionClientsActive = 15,
	TimeoutRequestTransitionClientsUninstalled = 16,
	TimeoutClientTransitionAllLoaded = 17,
	TimeoutClientTransitionUninstalled = 18,
	ClientCancelledDownload = 19,
	ClientCelluarDataRefusal = 20,
	UnauthorizedClient = 21,
	FailedToSetProjectId = 22,
	Unknown = 23,
	EContentBeaconErrorCode_MAX = 24
};

// Enum FortniteGame.EContentBeaconErrorSource
enum class EContentBeaconErrorSource : uint8 {
	Unknown = 0,
	Host = 1,
	Client = 2,
	EContentBeaconErrorSource_MAX = 3
};

// Enum FortniteGame.EContentBeaconErrorResponse
enum class EContentBeaconErrorResponse : uint8 {
	None = 0,
	DisconnectClient = 1,
	CancelRequest = 2,
	Shutdown = 3,
	EContentBeaconErrorResponse_MAX = 4
};

// Enum FortniteGame.EClientModuleType
enum class EClientModuleType : uint8 {
	Local = 0,
	Remote = 1,
	EClientModuleType_MAX = 2
};

// Enum FortniteGame.ECreativeMinimapComponentIconColorType
enum class ECreativeMinimapComponentIconColorType : uint8 {
	None = 0,
	White = 1,
	Red = 2,
	Orange = 3,
	Yellow = 4,
	Green = 5,
	Teal = 6,
	Blue = 7,
	Purple = 8,
	ECreativeMinimapComponentIconColorType_MAX = 9
};

// Enum FortniteGame.ECreativeQuestStat
enum class ECreativeQuestStat : uint8 {
	None = 0,
	Eliminations = 1,
	Eliminated = 2,
	Score = 3,
	ChestOpened = 4,
	LlamaOpened = 5,
	PlayerRevived = 6,
	PlayerInterrogated = 7,
	RaceCheckpointActivated = 8,
	FishFished = 9,
	WeaponFished = 10,
	PropDestroyed = 11,
	ShieldPotionConsumed = 12,
	DistanceTraveledOnFoot = 13,
	DistanceTraveledInVehicle = 14,
	DistanceTraveledInAir = 15,
	DistanceTraveled = 16,
	RoundCompleted = 17,
	RoundWon = 18,
	GameCompleted = 19,
	GameWon = 20,
	PlayTimeElapsed = 21,
	MAX = 22
};

// Enum FortniteGame.ECreativeQuestSharing
enum class ECreativeQuestSharing : uint8 {
	Individual = 0,
	Team = 1,
	All = 2,
	MAX = 3
};

// Enum FortniteGame.EShowProgressMode
enum class EShowProgressMode : uint8 {
	Total = 0,
	Remaining = 1,
	Off = 2,
	MAX = 3
};

// Enum FortniteGame.EShowOnHudMode
enum class EShowOnHudMode : uint8 {
	No = 0,
	Detailed = 1,
	List = 2,
	Both = 3,
	MAX = 4
};

// Enum FortniteGame.EScoreDistributionType
enum class EScoreDistributionType : uint8 {
	Default = 0,
	DivideByDamage = 1,
	DivideEvenly = 2,
	AllToKiller = 3,
	EScoreDistributionType_MAX = 4
};

// Enum FortniteGame.ECreatureManagerAffectedTargets
enum class ECreatureManagerAffectedTargets : uint8 {
	NewPawnsOnly = 0,
	NewAndExistingPawns = 1,
	ECreatureManagerAffectedTargets_MAX = 2
};

// Enum FortniteGame.EAccessoryColorName
enum class EAccessoryColorName : uint8 {
	EAccessoryColorName_AccessoryColor1 = 0,
	EAccessoryColorName_AccessoryColor2 = 1,
	EAccessoryColorName_AccessoryColor3 = 2,
	EAccessoryColorName_NumTypes = 3,
	EAccessoryColorName_MAX = 4
};

// Enum FortniteGame.ECustomHatType
enum class ECustomHatType : uint8 {
	ECustomHatType_None = 0,
	ECustomHatType_Cap = 1,
	ECustomHatType_Helmet = 2,
	ECustomHatType_Mask = 3,
	ECustomHatType_Hat = 4,
	ECustomHatType_HeadReplacement = 5,
	ECustomHatType_MAX = 6
};

// Enum FortniteGame.ECharacterPartAttachmentTargetType
enum class ECharacterPartAttachmentTargetType : uint8 {
	RootComponent = 0,
	SkeletalMeshForAssociatedPlayerPawnPartType = 1,
	ECharacterPartAttachmentTargetType_MAX = 2
};

// Enum FortniteGame.EClothingColorName
enum class EClothingColorName : uint8 {
	EClothingColorName_AccessoryColor1 = 0,
	EClothingColorName_AccessoryColor2 = 1,
	EClothingColorName_NumTypes = 2,
	EClothingColorName_MAX = 3
};

// Enum FortniteGame.ECharacterColorSwatchType
enum class ECharacterColorSwatchType : uint8 {
	ECharacterColorSwatchType_Skin = 0,
	ECharacterColorSwatchType_Hair = 1,
	ECharacterColorSwatchType_NumTypes = 2,
	ECharacterColorSwatchType_MAX = 3
};

// Enum FortniteGame.EColorSwatchType
enum class EColorSwatchType : uint8 {
	EColorSwatchType_Skin = 0,
	EColorSwatchType_Hair = 1,
	EColorSwatchType_BodyAccessory = 2,
	EColorSwatchType_Accessory = 3,
	EColorSwatchType_NumTypes = 4,
	EColorSwatchType_MAX = 5
};

// Enum FortniteGame.EVehicleEnteredCosmeticReaction
enum class EVehicleEnteredCosmeticReaction : uint8 {
	Driver = 0,
	Passenger = 1,
	Both = 2,
	EVehicleEnteredCosmeticReaction_MAX = 3
};

// Enum FortniteGame.ECosmeticModifierOutExec
enum class ECosmeticModifierOutExec : uint8 {
	Success = 0,
	Failure = 1,
	ECosmeticModifierOutExec_MAX = 2
};

// Enum FortniteGame.EDadBroHealthType
enum class EDadBroHealthType : uint8 {
	None = 0,
	Weakpoints = 1,
	Horn = 2,
	Guy = 3,
	EDadBroHealthType_MAX = 4
};

// Enum FortniteGame.EDeployableBaseBoxType
enum class EDeployableBaseBoxType : uint8 {
	BuildSpace = 0,
	SaveSpace = 1,
	PlotSpace = 2,
	NumSpaceTypes = 3,
	EDeployableBaseBoxType_MAX = 4
};

// Enum FortniteGame.EDeployableBaseBuildingState
enum class EDeployableBaseBuildingState : uint8 {
	Empty = 0,
	Built = 1,
	Unoccupied = 2,
	WaitingToBuild = 3,
	Building = 4,
	WaitingToDestroy = 5,
	Destroying = 6,
	WaitingToReset = 7,
	Resetting = 8,
	EDeployableBaseBuildingState_MAX = 9
};

// Enum FortniteGame.EDeployableBaseConstructionStatus
enum class EDeployableBaseConstructionStatus : uint8 {
	Constructing = 0,
	Destroying = 1,
	Finished = 2,
	EDeployableBaseConstructionStatus_MAX = 3
};

// Enum FortniteGame.EVkEditStatus
enum class EVkEditStatus : uint8 {
	DEFAULT = 0,
	UpToDate = 1,
	RefreshRequired = 2,
	Preparing = 3,
	Downloading = 4,
	LoadingProject = 5,
	Error = 6,
	EVkEditStatus_MAX = 7
};

// Enum FortniteGame.EFortStatDisplayType
enum class EFortStatDisplayType : uint8 {
	Category = 0,
	Buff = 1,
	Debuff = 2,
	Neutral = 3,
	DoNotDisplay = 4,
	EFortStatDisplayType_MAX = 5
};

// Enum FortniteGame.EFortAbilityTargetSelectionUsage
enum class EFortAbilityTargetSelectionUsage : uint8 {
	BothTargetingAndCanHit = 0,
	OnlyTargeting = 1,
	OnlyCanHit = 2,
	EFortAbilityTargetSelectionUsage_MAX = 3
};

// Enum FortniteGame.EFortDirectedMovementSpace
enum class EFortDirectedMovementSpace : uint8 {
	WorldSpace = 0,
	ActorLocRelative = 1,
	ActorLocRotRelative = 2,
	CameraRelative = 3,
	EFortDirectedMovementSpace_MAX = 4
};

// Enum FortniteGame.EFortAbilityTargetDataPolicy
enum class EFortAbilityTargetDataPolicy : uint8 {
	ReplicateToServer = 0,
	SimulateOnServer = 1,
	EFortAbilityTargetDataPolicy_MAX = 2
};

// Enum FortniteGame.EFortAbilityChargeState
enum class EFortAbilityChargeState : uint8 {
	None = 0,
	ChargingUp = 1,
	MaxCharge = 2,
	Discharge = 3,
	ChargingDown = 4,
	EFortAbilityChargeState_MAX = 5
};

// Enum FortniteGame.EFortAccoladeType
enum class EFortAccoladeType : uint8 {
	Acknowledgement = 0,
	Accolade = 1,
	Medal = 2,
	EFortAccoladeType_MAX = 3
};

// Enum FortniteGame.EFortActorIndicatorContainerWidget
enum class EFortActorIndicatorContainerWidget : uint8 {
	Top = 0,
	Middle = 1,
	Bottom = 2,
	EFortActorIndicatorContainerWidget_MAX = 3
};

// Enum FortniteGame.EFortActorTemplateCostUpdateMethod
enum class EFortActorTemplateCostUpdateMethod : uint8 {
	Latest = 0,
	Smallest = 1,
	OnlyNew = 2,
	Double = 3,
	EFortActorTemplateCostUpdateMethod_MAX = 4
};

// Enum FortniteGame.EFortActorSpawnerAuthority
enum class EFortActorSpawnerAuthority : uint8 {
	ServerAuthoritative = 0,
	ClientAuthoritative = 1,
	EFortActorSpawnerAuthority_MAX = 2
};

// Enum FortniteGame.EValueCostCalculationMethod
enum class EValueCostCalculationMethod : uint8 {
	Assets = 0,
	Max = 1,
	InstancePayload = 2
};

// Enum FortniteGame.EIKType
enum class EIKType : uint8 {
	NotHeld = 0,
	LeftHand = 1,
	RightHand = 2,
	BothHands = 3,
	EIKType_MAX = 4
};

// Enum FortniteGame.EFortressAIType
enum class EFortressAIType : uint8 {
	FAT_Dormant = 0,
	FAT_Cleaner = 1,
	FAT_DayWanderer = 2,
	FAT_NightWanderer = 3,
	FAT_DebugOnly = 4,
	FAT_Encounter = 5,
	FAT_MAX = 6
};

// Enum FortniteGame.EFortAILevelRatingDisplayType
enum class EFortAILevelRatingDisplayType : uint8 {
	DisplayRatingBasedOnDifficulty = 0,
	DisplayAIDifficultyAsRating = 1,
	DontDisplayRating = 2,
	EFortAILevelRatingDisplayType_MAX = 3
};

// Enum FortniteGame.EFortAIPawnGender
enum class EFortAIPawnGender : uint8 {
	FAPG_Default = 0,
	FAPG_Female = 1,
	FAPG_Male = 2,
	FAPG_MAX = 3
};

// Enum FortniteGame.EFortAnalyticsClientEngagementEventType
enum class EFortAnalyticsClientEngagementEventType : uint8 {
	None = 0,
	DamageReceivedFromPlayerPawn = 1,
	DamageDealtToPlayerPawn = 2,
	DamageDealtToPlayerBuild = 3,
	DamageDealtToOther = 4,
	EngagementTimeout = 5,
	PlayerWon = 6,
	PlayerDeathOnWin = 7,
	TeamWon = 8,
	TeamLost = 9,
	PlayerLost = 10,
	PlayerKilledPlayer = 11,
	PlayerFiredWeapon = 12,
	ManagerStopped = 13,
	PlayerPawnDied = 14,
	PlayerPawnSpawned = 15,
	Count = 16,
	EFortAnalyticsClientEngagementEventType_MAX = 17
};

// Enum FortniteGame.EFortAnalyticsEventDenylistPlaylistKey
enum class EFortAnalyticsEventDenylistPlaylistKey : uint8 {
	PlaylistType = 0,
	PlaylistName = 1,
	All = 2,
	EFortAnalyticsEventDenylistPlaylistKey_MAX = 3
};

// Enum FortniteGame.EAlphaFromDeltaTypes
enum class EAlphaFromDeltaTypes : uint8 {
	TranslationX = 0,
	TranslationY = 1,
	TranslationZ = 2,
	Scale = 3,
	ScaleX = 4,
	ScaleY = 5,
	ScaleZ = 6,
	EulerX = 7,
	EulerY = 8,
	EulerZ = 9,
	QuaternionTwist = 10,
	EAlphaFromDeltaTypes_MAX = 11
};

// Enum FortniteGame.ESkydivingDirection
enum class ESkydivingDirection : uint8 {
	Center = 0,
	Right = 1,
	Left = 2,
	Forward = 3,
	Back = 4,
	ESkydivingDirection_MAX = 5
};

// Enum FortniteGame.EAnimRelaxedState
enum class EAnimRelaxedState : uint8 {
	None = 0,
	WeaponRaised = 1,
	RelaxedLevel1 = 2,
	RelaxedLevel2 = 3,
	EAnimRelaxedState_MAX = 4
};

// Enum FortniteGame.ERidingFootPhase
enum class ERidingFootPhase : uint8 {
	FeetInAir = 0,
	FrontFeetPlanted = 1,
	BackFeetPlanted = 2,
	LeftBackFeetForward = 3,
	RightBackFeetForward = 4,
	LeftPlantedRightPass = 5,
	RightPlantedLeftPass = 6,
	ERidingFootPhase_MAX = 7
};

// Enum FortniteGame.ESourceSelectionMode
enum class ESourceSelectionMode : uint8 {
	MaxDifference = 0,
	ESourceSelectionMode_MAX = 1
};

// Enum FortniteGame.EPredictiveStrideWarpingAxisMode
enum class EPredictiveStrideWarpingAxisMode : uint8 {
	IKFootRootLocalX = 0,
	IKFootRootLocalY = 1,
	IKFootRootLocalZ = 2,
	WorldSpaceVectorInput = 3,
	ComponentSpaceVectorInput = 4,
	ActorSpaceVectorInput = 5,
	EPredictiveStrideWarpingAxisMode_MAX = 6
};

// Enum FortniteGame.ESpeedWarpingAxisMode
enum class ESpeedWarpingAxisMode : uint8 {
	IKFootRootLocalX = 0,
	IKFootRootLocalY = 1,
	IKFootRootLocalZ = 2,
	WorldSpaceVectorInput = 3,
	ComponentSpaceVectorInput = 4,
	ActorSpaceVectorInput = 5,
	ESpeedWarpingAxisMode_MAX = 6
};

// Enum FortniteGame.EMontageSyncTargetType
enum class EMontageSyncTargetType : uint8 {
	Pet = 0,
	CustomPartType = 1,
	Weapon = 2,
	EMontageSyncTargetType_MAX = 3
};

// Enum FortniteGame.EMontageInterrupt
enum class EMontageInterrupt : uint8 {
	Any = 0,
	RootMotionOnly = 1,
	None = 2,
	EMontageInterrupt_MAX = 3
};

// Enum FortniteGame.EFortNotifyAudioParamsStoreSource
enum class EFortNotifyAudioParamsStoreSource : uint8 {
	Weapon = 0,
	Pawn = 1,
	Controller = 2,
	EFortNotifyAudioParamsStoreSource_MAX = 3
};

// Enum FortniteGame.EDeimosAnimState
enum class EDeimosAnimState : uint8 {
	Idle = 0,
	Running = 1,
	Attack = 2,
	Dance = 3,
	Dying = 4,
	Died = 5,
	FullBodyHitReact = 6,
	AdditiveHitReact = 7,
	ActiveIdle = 8,
	Falling = 9,
	Frozen = 10,
	RangedAttack = 11,
	Walking = 12,
	Sprinting = 13,
	EDeimosAnimState_MAX = 14
};

// Enum FortniteGame.EFortFacialAnimTypes
enum class EFortFacialAnimTypes : uint8 {
	Default = 0,
	FaceOnly = 1,
	FullHead = 2,
	FromAmplitude = 3,
	Max = 4
};

// Enum FortniteGame.EGliderType
enum class EGliderType : uint8 {
	HangGlider = 0,
	Umbrella = 1,
	Surfing = 2,
	SurfingSimple = 3,
	Cape = 4,
	Stairs = 5,
	NoGlider = 6,
	EGliderType_MAX = 7
};

// Enum FortniteGame.EPlaneDirection
enum class EPlaneDirection : uint8 {
	Center = 0,
	Right = 1,
	Left = 2,
	Up = 3,
	Down = 4,
	EPlaneDirection_MAX = 5
};

// Enum FortniteGame.EFortCardinalDirection
enum class EFortCardinalDirection : uint8 {
	North = 0,
	East = 1,
	South = 2,
	West = 3,
	EFortCardinalDirection_MAX = 4
};

// Enum FortniteGame.EFortPlayerAnimBodyType
enum class EFortPlayerAnimBodyType : uint8 {
	Small = 0,
	Medium = 1,
	Large = 2,
	All = 3,
	EFortPlayerAnimBodyType_MAX = 4
};

// Enum FortniteGame.EFortHandIKOverrideType
enum class EFortHandIKOverrideType : uint8 {
	UseDefault = 0,
	ForceFK = 1,
	ForceIK = 2,
	ForceFKSnap = 3,
	EFortHandIKOverrideType_MAX = 4
};

// Enum FortniteGame.FCollisionWithBuildingActorReactionTypes
enum class FCollisionWithBuildingActorReactionTypes : uint8 {
	DoNothing = 0,
	PlayAttackAbility = 1,
	Destroy = 2,
	ApplyGameplayEffect = 3,
	FCollisionWithBuildingActorReactionTypes_MAX = 4
};

// Enum FortniteGame.FCollisionWithLaunchableReactionTypes
enum class FCollisionWithLaunchableReactionTypes : uint8 {
	DoNothing = 0,
	Launch = 1,
	OverrideOther = 2,
	FCollisionWithLaunchableReactionTypes_MAX = 3
};

// Enum FortniteGame.ETypeOfBuildingActor
enum class ETypeOfBuildingActor : uint8 {
	Anything = 0,
	PlayerBuilt = 1,
	NonPlayerBuilt = 2,
	ETypeOfBuildingActor_MAX = 3
};

// Enum FortniteGame.EFreelookMode
enum class EFreelookMode : uint8 {
	None = 0,
	Mouse = 1,
	Analog = 2,
	EFreelookMode_MAX = 3
};

// Enum FortniteGame.EExitCraftState
enum class EExitCraftState : uint8 {
	None = 0,
	Spawned = 1,
	Landed = 2,
	SpawnBalloon = 3,
	GettingIntoPosition = 4,
	GettingIntoPosition_Simple = 5,
	WaitingForPawns = 6,
	Exiting = 7,
	EExitCraftState_MAX = 8
};

// Enum FortniteGame.EFortExitRequirements
enum class EFortExitRequirements : uint8 {
	AnyPlayer = 0,
	WholeSquad = 1,
	EFortExitRequirements_MAX = 2
};

// Enum FortniteGame.EFortMutatorReturnValue
enum class EFortMutatorReturnValue : uint8 {
	Ignore = 0,
	Override = 1,
	OverrideReturn = 2,
	EFortMutatorReturnValue_MAX = 3
};

// Enum FortniteGame.EAshtonStoneType
enum class EAshtonStoneType : uint8 {
	Purple = 0,
	Blue = 1,
	Red = 2,
	Orange = 3,
	Green = 4,
	Yellow = 5,
	MAX = 6
};

// Enum FortniteGame.EAshtonStoneStateType
enum class EAshtonStoneStateType : uint8 {
	NotSpawned = 0,
	Spawned = 1,
	Captured = 2,
	MAX = 3
};

// Enum FortniteGame.EFortCreativeAutoPickupSetting
enum class EFortCreativeAutoPickupSetting : uint8 {
	IsFalse = 0,
	IsTrue = 1,
	AutoOnly = 2,
	Unset = 255,
	EFortCreativeAutoPickupSetting_MAX = 256
};

// Enum FortniteGame.EBagelPhase
enum class EBagelPhase : uint8 {
	NotStarted = 0,
	Preparation = 1,
	Survival = 2,
	AfterMath = 3,
	Moving = 4,
	FinalPhase = 5,
	FinalPhaseFullStorm = 6,
	MAX = 7
};

// Enum FortniteGame.EBagelScoreEvent
enum class EBagelScoreEvent : uint8 {
	FiendKill = 0,
	BruteKill = 1,
	RangedKill = 2,
	ExplodingKill = 3,
	ChillKill = 4,
	PoisonKill = 5,
	GoldKill = 6,
	RiftDestroyed = 7,
	ScoreMultiplierUsed = 8,
	HeadshotKill = 9,
	RespawnPenalty = 10,
	AmmoBoxOpened = 11,
	ChestOpened = 12,
	FinalBossKill = 13,
	MAX = 14
};

// Enum FortniteGame.EBagelDifficulty
enum class EBagelDifficulty : uint8 {
	Easy = 0,
	Medium = 1,
	Hard = 2,
	EBagelDifficulty_MAX = 3
};

// Enum FortniteGame.EBarrierFoodTeam
enum class EBarrierFoodTeam : uint8 {
	Burger = 0,
	Tomato = 1,
	MAX = 2
};

// Enum FortniteGame.EBarrierObjectiveDamageState
enum class EBarrierObjectiveDamageState : uint8 {
	 = 0,
	 = 1,
	 = 2,
	 = 3,
	 = 4,
	 = 5,
	 = 6,
	 = 7,
	 = 8,
	MAX = 9
};

// Enum FortniteGame.ECreativeAllowSpectateOtherTeams
enum class ECreativeAllowSpectateOtherTeams : uint8 {
	Disallow = 0,
	Allow = 1,
	BattleRoyale = 2,
	ECreativeAllowSpectateOtherTeams_MAX = 3
};

// Enum FortniteGame.EAllowedToEdit
enum class EAllowedToEdit : uint8 {
	Default = 0,
	Anyone = 1,
	EAllowedToEdit_MAX = 2
};

// Enum FortniteGame.ECreativeRespawnWaveType
enum class ECreativeRespawnWaveType : uint8 {
	None = 0,
	WaveStartingOnElimination = 1,
	ECreativeRespawnWaveType_MAX = 2
};

// Enum FortniteGame.ECanSlideMutatorType
enum class ECanSlideMutatorType : uint8 {
	Unset = 0,
	Yes = 1,
	No = 2,
	ECanSlideMutatorType_MAX = 3
};

// Enum FortniteGame.EFortCrucibleStatType
enum class EFortCrucibleStatType : uint8 {
	CourseOverall = 0,
	CourseSegment1 = 1,
	CourseSegment2 = 2,
	CourseSegment3 = 3,
	CourseSegment4 = 4,
	CourseSegment5 = 5,
	Count = 6,
	EFortCrucibleStatType_MAX = 7
};

// Enum FortniteGame.EFortCrucibleControlType
enum class EFortCrucibleControlType : uint8 {
	Gamepad = 0,
	KBM = 1,
	Touch = 2,
	Count = 3,
	EFortCrucibleControlType_MAX = 4
};

// Enum FortniteGame.EFortCrucibleStatId
enum class EFortCrucibleStatId : uint8 {
	Gamepad_CourseOverall = 0,
	Gamepad_CourseSegment1 = 1,
	Gamepad_CourseSegment2 = 2,
	Gamepad_CourseSegment3 = 3,
	Gamepad_CourseSegment4 = 4,
	Gamepad_CourseSegment5 = 5,
	KBM_CourseOverall = 6,
	KBM_CourseSegment1 = 7,
	KBM_CourseSegment2 = 8,
	KBM_CourseSegment3 = 9,
	KBM_CourseSegment4 = 10,
	KBM_CourseSegment5 = 11,
	Touch_CourseOverall = 12,
	Touch_CourseSegment1 = 13,
	Touch_CourseSegment2 = 14,
	Touch_CourseSegment3 = 15,
	Touch_CourseSegment4 = 16,
	Touch_CourseSegment5 = 17,
	Count = 18,
	EFortCrucibleStatId_MAX = 19
};

// Enum FortniteGame.EFortCrucibleStatSource
enum class EFortCrucibleStatSource : uint8 {
	None = 0,
	Backend = 1,
	CurrentSession = 2,
	EFortCrucibleStatSource_MAX = 3
};

// Enum FortniteGame.EFortCrucibleLeaderboardId
enum class EFortCrucibleLeaderboardId : uint8 {
	GlobalGamepad = 0,
	GlobalKBM = 1,
	GlobalTouch = 2,
	GlobalAll = 3,
	FriendsGamepad = 4,
	FriendsKBM = 5,
	FriendsTouch = 6,
	FriendsAll = 7,
	Count = 8,
	EFortCrucibleLeaderboardId_MAX = 9
};

// Enum FortniteGame.EFortCrucibleLeaderboardState
enum class EFortCrucibleLeaderboardState : uint8 {
	Disabled = 0,
	ReadyForQuery = 1,
	WaitingForQueryResults = 2,
	NeedsUserInfoQueried = 3,
	Complete = 4,
	EFortCrucibleLeaderboardState_MAX = 5
};

// Enum FortniteGame.EFortCrucibleWorkType
enum class EFortCrucibleWorkType : uint8 {
	Invalid = 0,
	SetupPlayer = 1,
	GetFriendsList = 2,
	GetFriendsStats = 3,
	GetGlobalLeaderboard = 4,
	GetDisplayNames = 5,
	EFortCrucibleWorkType_MAX = 6
};

// Enum FortniteGame.EDadBroState
enum class EDadBroState : uint8 {
	NotYet = 0,
	Initializing = 1,
	Active = 2,
	EDadBroState_MAX = 3
};

// Enum FortniteGame.EControlPointState
enum class EControlPointState : uint8 {
	None = 0,
	Disabled = 1,
	Enabled = 2,
	EControlPointState_MAX = 3
};

// Enum FortniteGame.EBuildingDamageTeamFilter
enum class EBuildingDamageTeamFilter : uint8 {
	Default = 0,
	OwnerOnly = 1,
	TeamOnly = 2,
	EnemyOnly = 3,
	EnemyAndOwnerOnly = 4,
	None = 5,
	EBuildingDamageTeamFilter_MAX = 6
};

// Enum FortniteGame.EEnvironmentDamageFilter
enum class EEnvironmentDamageFilter : uint8 {
	Off = 0,
	PlayerBuiltOnly = 1,
	All = 2,
	EEnvironmentDamageFilter_MAX = 3
};

// Enum FortniteGame.EEQSActorSpawnerTriggerType
enum class EEQSActorSpawnerTriggerType : uint8 {
	Manual = 0,
	SafeZoneState = 1,
	EEQSActorSpawnerTriggerType_MAX = 2
};

// Enum FortniteGame.EEQSActorSpawnerSpawnType
enum class EEQSActorSpawnerSpawnType : uint8 {
	Actor = 0,
	AIPawn = 1,
	Pickup = 2,
	EEQSActorSpawnerSpawnType_MAX = 3
};

// Enum FortniteGame.EEQSActorSpawnerStopSpawningReason
enum class EEQSActorSpawnerStopSpawningReason : uint8 {
	Success = 0,
	ManualStop = 1,
	Requeued = 2,
	RanOutOfRetries = 3,
	EEQSActorSpawnerStopSpawningReason_MAX = 4
};

// Enum FortniteGame.EAthenaMutatorEvaluators
enum class EAthenaMutatorEvaluators : uint8 {
	NoOverride = 0,
	ForceOverride = 1,
	Add = 2,
	Multiply = 3,
	EAthenaMutatorEvaluators_MAX = 4
};

// Enum FortniteGame.EHeistExitCraftState
enum class EHeistExitCraftState : uint8 {
	None = 0,
	Incoming = 1,
	Spawned = 2,
	Exited = 3,
	EHeistExitCraftState_MAX = 4
};

// Enum FortniteGame.EFortHUDElementVisibiltyOption
enum class EFortHUDElementVisibiltyOption : uint8 {
	DoNotOverride = 0,
	ShowElement = 1,
	HideElement = 2,
	EFortHUDElementVisibiltyOption_MAX = 3
};

// Enum FortniteGame.EFortReticleVisibiltyOption
enum class EFortReticleVisibiltyOption : uint8 {
	DoNotOverride = 0,
	ShowAlways = 1,
	ShowPickaxeOnly = 2,
	ShowNonPickaxeOnly = 3,
	HideAlways = 4,
	EFortReticleVisibiltyOption_MAX = 5
};

// Enum FortniteGame.EFortHUDElementVisibiltyPriority
enum class EFortHUDElementVisibiltyPriority : uint8 {
	Lowest = 0,
	VeryLow = 1,
	Low = 2,
	Normal = 3,
	High = 4,
	VeryHigh = 5,
	Highest = 6,
	COUNT = 7,
	EFortHUDElementVisibiltyPriority_MAX = 8
};

// Enum FortniteGame.EInfiltrationTeam
enum class EInfiltrationTeam : uint8 {
	Attacking = 0,
	Defending = 1,
	NumOfTeams = 2,
	EInfiltrationTeam_MAX = 3
};

// Enum FortniteGame.EAthenaLootDropOverride
enum class EAthenaLootDropOverride : uint8 {
	NoOverride = 0,
	ForceDrop = 1,
	ForceKeep = 2,
	ForceDestroy = 3,
	ForceDropUnlessRespawning = 4,
	ForceDestroyUnlessRespawning = 5,
	DropUnlessTeamSelectionUpdated = 6,
	EAthenaLootDropOverride_MAX = 7
};

// Enum FortniteGame.EAthenaInventorySpawnOverride
enum class EAthenaInventorySpawnOverride : uint8 {
	NoOverride = 0,
	Always = 1,
	IntialSpawn = 2,
	AircraftPhaseOnly = 3,
	AfterWarmup = 4,
	EAthenaInventorySpawnOverride_MAX = 5
};

// Enum FortniteGame.ERespawnRequirements
enum class ERespawnRequirements : uint8 {
	RespawnOnly = 0,
	NoRespawnOnly = 1,
	Both = 2,
	ERespawnRequirements_MAX = 3
};

// Enum FortniteGame.ECustomLootSelection
enum class ECustomLootSelection : uint8 {
	Default = 0,
	SolidGold = 1,
	ECustomLootSelection_MAX = 2
};

// Enum FortniteGame.EMashPhase
enum class EMashPhase : uint8 {
	NotStarted = 0,
	Preparation = 1,
	Survival = 2,
	AfterMath = 3,
	Moving = 4,
	FinalPhase = 5,
	FinalPhaseFullStorm = 6,
	MAX = 7
};

// Enum FortniteGame.EMashAISpecialEncounterType
enum class EMashAISpecialEncounterType : uint8 {
	Boss = 0,
	UniqueAISpawn = 1,
	EMashAISpecialEncounterType_MAX = 2
};

// Enum FortniteGame.EMashScoreEvent
enum class EMashScoreEvent : uint8 {
	FiendKill = 0,
	BruteKill = 1,
	RangedKill = 2,
	ExplodingKill = 3,
	ChillKill = 4,
	PoisonKill = 5,
	GoldKill = 6,
	RiftDestroyed = 7,
	ScoreMultiplierUsed = 8,
	HeadshotKill = 9,
	RespawnPenalty = 10,
	AmmoBoxOpened = 11,
	ChestOpened = 12,
	BossKill = 13,
	FinalBossKill = 14,
	SafeDetonationDistanceKill = 15,
	SpecialEncounterKill = 16,
	MAX = 17
};

// Enum FortniteGame.EMashDifficulty
enum class EMashDifficulty : uint8 {
	Easy = 0,
	Medium = 1,
	Hard = 2,
	EMashDifficulty_MAX = 3
};

// Enum FortniteGame.EMatchConditionMutatorTeamStatus
enum class EMatchConditionMutatorTeamStatus : uint8 {
	None = 0,
	Won = 1,
	Lost = 2,
	Placed = 3,
	EMatchConditionMutatorTeamStatus_MAX = 4
};

// Enum FortniteGame.EMultiInteractionMutatorType
enum class EMultiInteractionMutatorType : uint8 {
	Unset = 0,
	On = 1,
	Off = 2,
	EMultiInteractionMutatorType_MAX = 3
};

// Enum FortniteGame.EIndicatorDisplayMode
enum class EIndicatorDisplayMode : uint8 {
	Default = 0,
	Always = 1,
	Never = 2,
	MiniMap = 3,
	Custom = 4,
	EIndicatorDisplayMode_MAX = 5
};

// Enum FortniteGame.EOmahaTeam
enum class EOmahaTeam : uint8 {
	Home = 0,
	Away = 1,
	MAX = 2
};

// Enum FortniteGame.EOperationsTeamFaction
enum class EOperationsTeamFaction : uint8 {
	Alter = 0,
	Ego = 1,
	NumFactions = 2,
	EOperationsTeamFaction_MAX = 3
};

// Enum FortniteGame.EOverrideCubemapType
enum class EOverrideCubemapType : uint8 {
	No = 0,
	Yes = 1,
	EOverrideCubemapType_MAX = 2
};

// Enum FortniteGame.EPlayerDamageHeightRatioDetectionType
enum class EPlayerDamageHeightRatioDetectionType : uint8 {
	None = 0,
	FromBottom = 1,
	FromTop = 2,
	EPlayerDamageHeightRatioDetectionType_MAX = 3
};

// Enum FortniteGame.EHarvestStyleOverride
enum class EHarvestStyleOverride : uint8 {
	None = 0,
	Creative = 1,
	BattleRoyale = 2,
	SaveTheWorld = 3,
	EHarvestStyleOverride_MAX = 4
};

// Enum FortniteGame.EGravityPresetOverride
enum class EGravityPresetOverride : uint8 {
	Normal = 0,
	Low = 1,
	VeryLow = 2,
	High = 3,
	VeryHigh = 4,
	EGravityPresetOverride_MAX = 5
};

// Enum FortniteGame.EFlightSpeedPresetOverride
enum class EFlightSpeedPresetOverride : uint8 {
	FlightSpeed0 = 0,
	FlightSpeed1 = 1,
	FlightSpeed2 = 2,
	FlightSpeed3 = 3,
	FlightSpeed4 = 4,
	FlightSpeed5 = 5,
	FlightSpeed6 = 6,
	EFlightSpeedPresetOverride_MAX = 7
};

// Enum FortniteGame.EIndicatorLineOfSightMode
enum class EIndicatorLineOfSightMode : uint8 {
	AlwaysShow = 0,
	HideBehindObstacles = 1,
	EIndicatorLineOfSightMode_MAX = 2
};

// Enum FortniteGame.ESelfDamageTargetPreset
enum class ESelfDamageTargetPreset : uint8 {
	NonPlayers = 0,
	PlayersOnly = 1,
	All = 2,
	ESelfDamageTargetPreset_MAX = 3
};

// Enum FortniteGame.ESelfDamageWeaponTypePreset
enum class ESelfDamageWeaponTypePreset : uint8 {
	PickaxeOnly = 0,
	MeleeOnly = 1,
	RangedOnly = 2,
	All = 3,
	ESelfDamageWeaponTypePreset_MAX = 4
};

// Enum FortniteGame.EAthenaTODPostProcessOverride
enum class EAthenaTODPostProcessOverride : uint8 {
	NoOverride = 0,
	PostProcess0 = 1,
	PostProcess1 = 2,
	PostProcess2 = 3,
	PostProcess3 = 4,
	PostProcess4 = 5,
	PostProcess5 = 6,
	PostProcess6 = 7,
	PostProcess7 = 8,
	PostProcess8 = 9,
	PostProcess9 = 10,
	PostProcess10 = 11,
	PostProcess11 = 12,
	PostProcess12 = 13,
	PostProcess13 = 14,
	EAthenaTODPostProcessOverride_MAX = 15
};

// Enum FortniteGame.EFortAthenaMutator_AttenuationState
enum class EFortAthenaMutator_AttenuationState : uint8 {
	Disabled = 0,
	Enabled = 1,
	None = 2,
	EFortAthenaMutator_MAX = 3
};

// Enum FortniteGame.ERepGraphMutatorSpatializationZoneType
enum class ERepGraphMutatorSpatializationZoneType : uint8 {
	AI = 0,
	AINonFast = 1,
	NonAI = 2,
	NonAINonFast = 3,
	COUNT = 4,
	ERepGraphMutatorSpatializationZoneType_MAX = 5
};

// Enum FortniteGame.ERespawnAndSpectateClientEventId
enum class ERespawnAndSpectateClientEventId : uint8 {
	ShowUI = 0,
	HideUI = 1,
	ShowRespawnAvailableUI = 2,
	MAX = 3
};

// Enum FortniteGame.ERespawnAndSpectateServerPayloadId
enum class ERespawnAndSpectateServerPayloadId : uint8 {
	SpectateTargetSelected = 0,
	RespawnTargetSelected = 1,
	SpectateAndRespawnTargetSelected = 2,
	ERespawnAndSpectateServerPayloadId_MAX = 3
};

// Enum FortniteGame.EShowPlacardPhase
enum class EShowPlacardPhase : uint8 {
	None = 0,
	StartShow = 1,
	WaitBeforeInitialFadeOut = 2,
	PreShowFadeOut = 3,
	Show = 4,
	FadeOut = 5,
	PostShowFadeIn = 6,
	DoneShowingScreen = 7,
	MAX = 8
};

// Enum FortniteGame.ESkyCapState
enum class ESkyCapState : uint8 {
	Hidden = 0,
	StormStarting = 1,
	ESkyCapState_MAX = 2
};

// Enum FortniteGame.ESynchronizedTeleportHealthAndShieldResetType
enum class ESynchronizedTeleportHealthAndShieldResetType : uint8 {
	None = 0,
	EvaluateHealthAndShieldMutators = 1,
	MaxHealth = 2,
	ESynchronizedTeleportHealthAndShieldResetType_MAX = 3
};

// Enum FortniteGame.ETeamPerformanceMessageReplicationType
enum class ETeamPerformanceMessageReplicationType : uint8 {
	VariableReplication = 0,
	MulticastFunction_Unreliable = 1,
	MulticastFunction_Reliable = 2,
	ETeamPerformanceMessageReplicationType_MAX = 3
};

// Enum FortniteGame.ETeamPerformanceMessageTrackingStat
enum class ETeamPerformanceMessageTrackingStat : uint8 {
	TeamScore = 0,
	TeamScorePercent = 1,
	ETeamPerformanceMessageTrackingStat_MAX = 2
};

// Enum FortniteGame.EAthenaTimeOfDayOverride
enum class EAthenaTimeOfDayOverride : uint8 {
	NoOverride = 0,
	ForceDay = 1,
	ForceNight = 2,
	Custom = 3,
	Hour0 = 4,
	Hour1 = 5,
	Hour2 = 6,
	Hour3 = 7,
	Hour4 = 8,
	Hour5 = 9,
	Hour6 = 10,
	Hour7 = 11,
	Hour8 = 12,
	Hour9 = 13,
	Hour10 = 14,
	Hour11 = 15,
	Hour12 = 16,
	Hour13 = 17,
	Hour14 = 18,
	Hour15 = 19,
	Hour16 = 20,
	Hour17 = 21,
	Hour18 = 22,
	Hour19 = 23,
	Hour20 = 24,
	Hour21 = 25,
	Hour22 = 26,
	Hour23 = 27,
	Random = 28,
	EAthenaTimeOfDayOverride_MAX = 29
};

// Enum FortniteGame.EAthenaLightIntensityOverride
enum class EAthenaLightIntensityOverride : uint8 {
	NoOverride = 0,
	Intensity0 = 1,
	Intensity1 = 2,
	Intensity2 = 3,
	Intensity3 = 4,
	Intensity4 = 5,
	Intensity5 = 6,
	Intensity6 = 7,
	Intensity7 = 8,
	Intensity8 = 9,
	Intensity9 = 10,
	Intensity10 = 11,
	EAthenaLightIntensityOverride_MAX = 12
};

// Enum FortniteGame.EAthenaFogDensityOverride
enum class EAthenaFogDensityOverride : uint8 {
	NoOverride = 0,
	Fog0 = 1,
	Fog1 = 2,
	Fog2 = 3,
	Fog3 = 4,
	Fog4 = 5,
	Fog5 = 6,
	Fog6 = 7,
	Fog7 = 8,
	Fog8 = 9,
	Fog9 = 10,
	Fog10 = 11,
	EAthenaFogDensityOverride_MAX = 12
};

// Enum FortniteGame.EAthenaTODColor
enum class EAthenaTODColor : uint8 {
	NoOverride = 0,
	Black = 1,
	White = 2,
	Red = 3,
	Green = 4,
	Blue = 5,
	Yellow = 6,
	Magenta = 7,
	Cyan = 8,
	EAthenaTODColor_MAX = 9
};

// Enum FortniteGame.EUraniumGameEndedReason
enum class EUraniumGameEndedReason : uint8 {
	GameIsStillInProgress = 0,
	AllRoundsPlayed = 1,
	EarlyGameEnd_BlowOut = 2,
	EarlyGameEnd_OutNumbered = 3,
	EUraniumGameEndedReason_MAX = 4
};

// Enum FortniteGame.EFortAthenaMutator_VoiceChatChannelType
enum class EFortAthenaMutator_VoiceChatChannelType : uint8 {
	Default = 0,
	None = 1,
	SquadOnly = 2,
	TeamOnly = 3,
	WholeServer = 4,
	ScopeOnly = 5,
	ScopeSquadOnly = 6,
	ScopeTeamOnly = 7,
	EFortAthenaMutator_MAX = 8
};

// Enum FortniteGame.EWaxMinimapDrawMode
enum class EWaxMinimapDrawMode : uint8 {
	NoDrawing = 0,
	DrawCloseAndMoveOrShoot = 1,
	DrawMoveOrShoot = 2,
	DrawAlways = 3,
	EWaxMinimapDrawMode_MAX = 4
};

// Enum FortniteGame.EWaxState
enum class EWaxState : uint8 {
	None = 0,
	SomewhatVisible = 1,
	ModeratelyVisible = 2,
	VeryVisible = 3,
	Undeniable = 4,
	EWaxState_MAX = 5
};

// Enum FortniteGame.ECoastState
enum class ECoastState : uint8 {
	Idle = 0,
	Mount = 1,
	Coasting = 2,
	Pedaling = 3,
	PreDismount = 4,
	Dismount = 5,
	EndCoast = 6,
	ECoastState_MAX = 7
};

// Enum FortniteGame.EFortAthenaTutorial_StandaloneStep
enum class EFortAthenaTutorial_StandaloneStep : uint8 {
	None = 0,
	HealingInterrupted = 1,
	Count = 2,
	EFortAthenaTutorial_MAX = 3
};

// Enum FortniteGame.EDebugVehicleFlags
enum class EDebugVehicleFlags : uint8 {
	Status = 0,
	Input = 1,
	Controls = 2,
	Shocks = 3,
	Exits = 4,
	Water = 5,
	Wheels = 6,
	Friction = 7,
	AirControl = 8,
	CenterOfMass = 9,
	Gravity = 10,
	Forces = 11,
	Damage = 12,
	Collisions = 13,
	OrientationCorrection = 14,
	BoundarySpline = 15,
	Sleeping = 16,
	Misc = 17,
	LeanBreak = 18,
	EDebugVehicleFlags_MAX = 19
};

// Enum FortniteGame.EPowerSlideState
enum class EPowerSlideState : uint8 {
	None = 0,
	Entering = 1,
	InProgress = 2,
	Exiting = 3,
	EPowerSlideState_MAX = 4
};

// Enum FortniteGame.ENaturalSlideState
enum class ENaturalSlideState : uint8 {
	None = 0,
	Entering = 1,
	InProgress = 2,
	Exiting = 3,
	ENaturalSlideState_MAX = 4
};

// Enum FortniteGame.EBounceCompressionState
enum class EBounceCompressionState : uint8 {
	None = 0,
	Crouching = 1,
	Crouched = 2,
	Jumping = 3,
	Recoiling = 4,
	EBounceCompressionState_MAX = 5
};

// Enum FortniteGame.EWaxTokenState
enum class EWaxTokenState : uint8 {
	None = 0,
	FirstSpline = 1,
	Interpolation = 2,
	LastSpline = 3,
	Finished = 4,
	EWaxTokenState_MAX = 5
};

// Enum FortniteGame.EFortFuelGadgetVisualType
enum class EFortFuelGadgetVisualType : uint8 {
	FuelMeter = 0,
	ChargeText = 1,
	Invalid = 2,
	EFortFuelGadgetVisualType_MAX = 3
};

// Enum FortniteGame.EFortAttributeDisplay
enum class EFortAttributeDisplay : uint8 {
	BasicInt = 0,
	NegativeImpliesInfiniteInt = 1,
	BasicFloat = 2,
	NegativeImpliesInfiniteFloat = 3,
	BasicString = 4,
	NormalizedPercentage = 5,
	StringArray = 6,
	SlateBrush = 7,
	DoNotDisplay = 8,
	None_Max = 9,
	EFortAttributeDisplay_MAX = 10
};

// Enum FortniteGame.EAudioAnalysisParameterType
enum class EAudioAnalysisParameterType : uint8 {
	Scalar = 0,
	Vector4 = 1,
	Count = 2,
	EAudioAnalysisParameterType_MAX = 3
};

// Enum FortniteGame.EAudioAnalysisEnvelopeFollowerStereoBehavior
enum class EAudioAnalysisEnvelopeFollowerStereoBehavior : uint8 {
	Average = 0,
	Add = 1,
	Max = 2,
	Count = 3
};

// Enum FortniteGame.EVectorCurveFloat
enum class EVectorCurveFloat : uint8 {
	VectorCurve_X = 0,
	VectorCurve_Y = 1,
	VectorCurve_Z = 2,
	VectorCurve_MAX = 3
};

// Enum FortniteGame.EVectorCurveType
enum class EVectorCurveType : uint8 {
	Original = 0,
	Modified = 1,
	EVectorCurveType_MAX = 2
};

// Enum FortniteGame.EFortRpcCategory
enum class EFortRpcCategory : uint8 {
	ActorInfo = 0,
	SocialActions = 1,
	GameplayActions = 2,
	CheatCommands = 3,
	PilotCommands = 4,
	RecordingCommands = 5,
	Unknown = 6,
	EFortRpcCategory_MAX = 7
};

// Enum FortniteGame.EDoghouseControlMode
enum class EDoghouseControlMode : uint8 {
	GroundControls = 0,
	AirControls = 1,
	MaxCount = 2,
	EDoghouseControlMode_MAX = 3
};

// Enum FortniteGame.EAileronRollDirection
enum class EAileronRollDirection : uint8 {
	None = 0,
	Right = 1,
	Left = 2,
	EAileronRollDirection_MAX = 3
};

// Enum FortniteGame.EBiplaneSimEvent
enum class EBiplaneSimEvent : uint8 {
	EngineStart = 0,
	EngineStop = 1,
	Takeoff = 2,
	Landing = 3,
	BoostBegin = 4,
	BoostEnd = 5,
	BoostChargeAboveThreshold = 6,
	AileronRoll = 7,
	ControlContextChange = 8,
	EBiplaneSimEvent_MAX = 9
};

// Enum FortniteGame.EEnvironmentalItemEndReason
enum class EEnvironmentalItemEndReason : uint8 {
	None = 0,
	PlayerExit = 1,
	PlayerDeath = 2,
	ObjectDestroyed = 3,
	EEnvironmentalItemEndReason_MAX = 4
};

// Enum FortniteGame.EIDScannerResult
enum class EIDScannerResult : uint8 {
	Success_PlayerBelongsToFaction = 0,
	Success_DownedPlayer = 1,
	Success_DownedGuard = 2,
	Success_PlayerIsDisguised = 3,
	Failure_NotFromFaction = 4,
	Other = 5,
	EIDScannerResult_MAX = 6
};

// Enum FortniteGame.ECreativeCreatorAnalyticsType
enum class ECreativeCreatorAnalyticsType : uint8 {
	MatchEnd = 0,
	Heartbeat = 1,
	ECreativeCreatorAnalyticsType_MAX = 2
};

// Enum FortniteGame.ESpawnResult
enum class ESpawnResult : uint8 {
	Success = 0,
	Failure_NoLocationFound = 1,
	Failure_NoActorClass = 2,
	Failure_BadQueryData = 3,
	ESpawnResult_MAX = 4
};

// Enum FortniteGame.EFortBuildingSoundType
enum class EFortBuildingSoundType : uint8 {
	Construction = 0,
	GenericDestruction = 1,
	PlayerBuiltDestruction = 2,
	None = 3,
	EFortBuildingSoundType_MAX = 4
};

// Enum FortniteGame.ESmartBuildMode
enum class ESmartBuildMode : uint8 {
	None = 0,
	Auto = 1,
	Box = 2,
	Bridge = 3,
	Tower = 4,
	ProtectedRamp = 5,
	ESmartBuildMode_MAX = 6
};

// Enum FortniteGame.ESmartBuildPlayerLocationInCell
enum class ESmartBuildPlayerLocationInCell : uint8 {
	Anywhere = 0,
	Forward = 1,
	Back = 2,
	ESmartBuildPlayerLocationInCell_MAX = 3
};

// Enum FortniteGame.EFortUICameraFrameTargetBoundingBehavior
enum class EFortUICameraFrameTargetBoundingBehavior : uint8 {
	NoBounds = 0,
	AllBounds = 1,
	TopBoundOnly = 2,
	EFortUICameraFrameTargetBoundingBehavior_MAX = 3
};

// Enum FortniteGame.ECameraOrigin
enum class ECameraOrigin : uint8 {
	ViewTargetTransform = 0,
	BoneTransform = 1,
	ECameraOrigin_MAX = 2
};

// Enum FortniteGame.EChallengeBundleQuestUnlockType
enum class EChallengeBundleQuestUnlockType : uint8 {
	Manually = 0,
	GrantWithBundle = 1,
	RequiresBattlePass = 2,
	DaysFromEventStart = 3,
	ChallengesCompletedToUnlock = 4,
	BundleLevelup = 5,
	EChallengeBundleQuestUnlockType_MAX = 6
};

// Enum FortniteGame.EChallengeScheduleUnlockType
enum class EChallengeScheduleUnlockType : uint8 {
	Manually = 0,
	OnScheduleGranted = 1,
	DaysSinceEventStart = 2,
	EChallengeScheduleUnlockType_MAX = 3
};

// Enum FortniteGame.EBundleStyleColor
enum class EBundleStyleColor : uint8 {
	Primary = 0,
	Secondary = 1,
	Accent = 2,
	EBundleStyleColor_MAX = 3
};

// Enum FortniteGame.EManagedCosmeticType
enum class EManagedCosmeticType : uint8 {
	Glider = 0,
	GliderAnimSet = 1,
	Pickaxe = 2,
	Pet = 3,
	ItemWrap = 4,
	Charm = 5,
	MAX_COUNT = 6,
	EManagedCosmeticType_MAX = 7
};

// Enum FortniteGame.EFortCustomMovement
enum class EFortCustomMovement : uint8 {
	Default = 0,
	Driving = 1,
	Passenger = 2,
	Parachuting = 3,
	Skydiving = 4,
	SkydiveFollowing = 5,
	Hover = 6,
	RemoteControl_Flying = 7,
	Ziplining = 8,
	ZipliningOnSpline = 9,
	Ballooning = 10,
	SurfaceSwimming = 11,
	DBNOCarried = 12,
	Floating = 13,
	Goop = 14,
	DeimosPreFall = 15,
	Sliding = 16,
	Skating = 17,
	Swinging = 18,
	SwingingGrounded = 19,
	SynchedAction = 20,
	Ridden = 21,
	FlyingRidden = 22,
	Count = 23,
	EFortCustomMovement_MAX = 24
};

// Enum FortniteGame.EChuteActions
enum class EChuteActions : uint8 {
	None = 0,
	WantsToOpen = 1,
	WantsToClose = 2,
	EChuteActions_MAX = 3
};

// Enum FortniteGame.EOstrichDetonationState
enum class EOstrichDetonationState : uint8 {
	None = 0,
	Detonate = 1,
	SelfDestruct = 2,
	Instant = 3,
	EOstrichDetonationState_MAX = 4
};

// Enum FortniteGame.EChatRoomJoinHelperState
enum class EChatRoomJoinHelperState : uint8 {
	Ready = 0,
	AttemptingJoin = 1,
	Joined = 2,
	AttemptingLeave = 3,
	EChatRoomJoinHelperState_MAX = 4
};

// Enum FortniteGame.ERepositionAllPlayers
enum class ERepositionAllPlayers : uint8 {
	HumanPlayers = 0,
	HumanPlayersAndPlayerBots = 1,
	HumanPlayersAndPlayerBotsAndNPCs = 2,
	AllControllers = 3,
	ERepositionAllPlayers_MAX = 4
};

// Enum FortniteGame.EFortAnnouncementDelivery
enum class EFortAnnouncementDelivery : uint8 {
	Created = 0,
	Received = 1,
	Ignored = 2,
	Active = 3,
	Stopped = 4,
	Max_None = 5,
	EFortAnnouncementDelivery_MAX = 6
};

// Enum FortniteGame.EFortAnnouncementChannel
enum class EFortAnnouncementChannel : uint8 {
	Primary = 0,
	Conversation = 1,
	Tutorial = 2,
	Max_None = 3,
	EFortAnnouncementChannel_MAX = 4
};

// Enum FortniteGame.EFortAnnouncementDisplayPreference
enum class EFortAnnouncementDisplayPreference : uint8 {
	Default_HUD = 0,
	QuestIntroduction = 1,
	QuestJournal = 2,
	EFortAnnouncementDisplayPreference_MAX = 3
};

// Enum FortniteGame.ECreativeBotIslandIterationType
enum class ECreativeBotIslandIterationType : uint8 {
	CBI_NONE = 0,
	CBI_Mnemonics = 1,
	CBI_User = 2,
	CBI_MAX = 3
};

// Enum FortniteGame.ECreativeBotIslandLoadingState
enum class ECreativeBotIslandLoadingState : uint8 {
	ILS_NONE = 0,
	ILS_LoadNotStarted = 1,
	ILS_GrantPlotItem = 2,
	ILS_WaitingUserPlotReady = 3,
	ILS_LoadInProgress = 4,
	ILS_LoadComplete = 5,
	ILS_Teleporting = 6,
	ILS_Returning = 7,
	ILS_Items = 8,
	ILS_MAX = 9
};

// Enum FortniteGame.ECreativeBotItemTestingState
enum class ECreativeBotItemTestingState : uint8 {
	ITS_NONE = 0,
	ITS_Teleporting = 1,
	ITS_Landing = 2,
	ITS_Grant = 3,
	ITS_Equip = 4,
	ITS_Place = 5,
	ITS_Cleanup = 6,
	ITS_MAX = 7
};

// Enum FortniteGame.EClientSettingsSaveType
enum class EClientSettingsSaveType : uint8 {
	Unknown = 0,
	LocalDisk = 1,
	CloudStorage = 2,
	EClientSettingsSaveType_MAX = 3
};

// Enum FortniteGame.ECloudFileState
enum class ECloudFileState : uint8 {
	Unitialized = 0,
	Saving = 1,
	Loading = 2,
	Idle = 3,
	ECloudFileState_MAX = 4
};

// Enum FortniteGame.EColorBlindMode
enum class EColorBlindMode : uint8 {
	Off = 0,
	Deuteranope = 1,
	Protanope = 2,
	Tritanope = 3,
	EColorBlindMode_MAX = 4
};

// Enum FortniteGame.EAndroidAppStoreTypes
enum class EAndroidAppStoreTypes : uint8 {
	Unset = 0,
	Epic = 1,
	Samsung = 2,
	EAndroidAppStoreTypes_MAX = 3
};

// Enum FortniteGame.EFortAllowBackgroundAudioSetting
enum class EFortAllowBackgroundAudioSetting : uint8 {
	Off = 0,
	NotificationsOnly = 1,
	AllSounds = 2,
	Num = 3,
	EFortAllowBackgroundAudioSetting_MAX = 4
};

// Enum FortniteGame.EFortAutoMulchCategory
enum class EFortAutoMulchCategory : uint8 {
	Invalid = 0,
	Weapon = 1,
	Trap = 2,
	Survivor = 3,
	Defender = 4,
	Hero = 5,
	Num = 6,
	EFortAutoMulchCategory_MAX = 7
};

// Enum FortniteGame.EFortAutoMulchMode
enum class EFortAutoMulchMode : uint8 {
	Off = 0,
	Common = 1,
	Uncommon = 2,
	Rare = 3,
	Epic = 4,
	Num = 5,
	EFortAutoMulchMode_MAX = 6
};

// Enum FortniteGame.ELicensedAudioTreatment
enum class ELicensedAudioTreatment : uint8 {
	None = 0,
	MuteOthers = 1,
	MuteAll = 2,
	ELicensedAudioTreatment_MAX = 3
};

// Enum FortniteGame.EFortPerModeInputType
enum class EFortPerModeInputType : uint8 {
	KeyboardMouse = 0,
	Controller = 1,
	EFortPerModeInputType_MAX = 2
};

// Enum FortniteGame.EJoyConMotionSelection
enum class EJoyConMotionSelection : uint8 {
	Left = 0,
	Right = 1,
	EJoyConMotionSelection_MAX = 2
};

// Enum FortniteGame.EKWSSetttingIndividalMigration
enum class EKWSSetttingIndividalMigration : uint8 {
	PartyJoinability = 0,
	ShowSeasonLevenInFeed = 1,
	ShowPlayerSurveys = 2,
	PublicGameStats = 3,
	ReceiveGiftsAllowed = 4,
	EKWSSetttingIndividalMigration_MAX = 5
};

// Enum FortniteGame.EPostpartyClippingState
enum class EPostpartyClippingState : uint8 {
	Unset = 0,
	Disabled = 1,
	Enabled = 2,
	EPostpartyClippingState_MAX = 3
};

// Enum FortniteGame.ECodeTokenPlatform
enum class ECodeTokenPlatform : uint8 {
	PC = 0,
	PS4 = 1,
	XBOX = 2,
	ECodeTokenPlatform_MAX = 3
};

// Enum FortniteGame.EFortCollectionBookState
enum class EFortCollectionBookState : uint8 {
	Active = 0,
	Completed = 1,
	Claimed = 2,
	EFortCollectionBookState_MAX = 3
};

// Enum FortniteGame.EFortAmmoType
enum class EFortAmmoType : uint8 {
	Pistol = 0,
	Shotgun = 1,
	Assault = 2,
	Sniper = 3,
	Energy = 4,
	EFortAmmoType_MAX = 5
};

// Enum FortniteGame.EFortMontageInputType
enum class EFortMontageInputType : uint8 {
	WindowClickOrHold = 0,
	WindowHoldOnly = 1,
	InstantClick = 2,
	EFortMontageInputType_MAX = 3
};

// Enum FortniteGame.EFortWeaponSoundState
enum class EFortWeaponSoundState : uint8 {
	Normal = 0,
	LowAmmo = 1,
	Degraded = 2,
	Max_None = 3,
	EFortWeaponSoundState_MAX = 4
};

// Enum FortniteGame.EFortWeaponSoundChannel
enum class EFortWeaponSoundChannel : uint8 {
	NormalA = 0,
	NormalB = 1,
	LowAmmo = 2,
	Degraded = 3,
	Max_None = 4,
	EFortWeaponSoundChannel_MAX = 5
};

// Enum FortniteGame.EFortReloadFXState
enum class EFortReloadFXState : uint8 {
	ReloadStart = 0,
	ReloadCartridge = 1,
	ReloadEnd = 2,
	Max_None = 3,
	EFortReloadFXState_MAX = 4
};

// Enum FortniteGame.EFortTargetingFXState
enum class EFortTargetingFXState : uint8 {
	TargetingStart = 0,
	TargetingEnd = 1,
	Max_None = 2,
	EFortTargetingFXState_MAX = 3
};

// Enum FortniteGame.EFortWeaponCoreAnimation
enum class EFortWeaponCoreAnimation : uint8 {
	Melee = 0,
	Pistol = 1,
	Shotgun = 2,
	PaperBlueprint = 3,
	Rifle = 4,
	MeleeOneHand = 5,
	MachinePistol = 6,
	RocketLauncher = 7,
	GrenadeLauncher = 8,
	GoingCommando = 9,
	AssaultRifle = 10,
	TacticalShotgun = 11,
	SniperRifle = 12,
	TrapPlacement = 13,
	ShoulderLauncher = 14,
	AbilityDecoTool = 15,
	Crossbow = 16,
	C4 = 17,
	RemoteControl = 18,
	DualWield = 19,
	AR_BullPup = 20,
	AR_ForwardGrip = 21,
	MedPackPaddles = 22,
	SMG_P90 = 23,
	AR_DrumGun = 24,
	Consumable_Small = 25,
	Consumable_Large = 26,
	Balloon = 27,
	MountedTurret = 28,
	CreativeTool = 29,
	ExplosiveBow = 30,
	AshtonIndigo = 31,
	AshtonChicago = 32,
	MeleeDualWield = 33,
	MAX = 34
};

// Enum FortniteGame.EFortCombatThresholds
enum class EFortCombatThresholds : uint8 {
	Low = 0,
	Medium = 1,
	High = 2,
	Extreme = 3,
	Max_None = 4,
	EFortCombatThresholds_MAX = 5
};

// Enum FortniteGame.EFortAIDirectorEventParticipant
enum class EFortAIDirectorEventParticipant : uint8 {
	Target = 0,
	Source = 1,
	Either = 2,
	Max_None = 3,
	EFortAIDirectorEventParticipant_MAX = 4
};

// Enum FortniteGame.EFortCombatEvents
enum class EFortCombatEvents : uint8 {
	HuskFollowing = 0,
	SmasherFollowing = 1,
	TrollFollowing = 2,
	FlingerFollowing = 3,
	TakerFollowing = 4,
	HuskCombatNearby = 5,
	SmasherCombatNearby = 6,
	TrollCombatNearby = 7,
	FlingerCombatNearby = 8,
	TakerCombatNearby = 9,
	PlayerTakeDamage = 10,
	PlayerHealth = 11,
	PlayerLookAtEnemy = 12,
	PlayerDamageEnemy = 13,
	PlayerKilledEnemy = 14,
	AtlasTakeDamage = 15,
	AtlasHealth = 16,
	AtlasDestroyed = 17,
	TrapFiring = 18,
	BuildingTakeDamage = 19,
	FoodHealingPotential = 20,
	PlayerAmmo = 21,
	EnemiesNear = 22,
	PlayerMovement = 23,
	BuildingDamagedNearObjective = 24,
	TrapDamageEnemy = 25,
	ObjectivePathCost = 26,
	PlayerPathCost = 27,
	Max_None = 28,
	EFortCombatEvents_MAX = 29
};

// Enum FortniteGame.EFortCombatEventContribution
enum class EFortCombatEventContribution : uint8 {
	Linear = 0,
	Inverse = 1,
	Accumulator = 2,
	Max_None = 3,
	EFortCombatEventContribution_MAX = 4
};

// Enum FortniteGame.EFortCombatFactors
enum class EFortCombatFactors : uint8 {
	PlayerDamageThreat = 0,
	ObjectiveDamageThreat = 1,
	ObjectivePathCost = 2,
	PlayerPathCost = 3,
	PlayerMovement = 4,
	TrapsEffective = 5,
	PlayerWander = 6,
	NearbyEnemyPresence = 7,
	OffensiveResources = 8,
	DefensiveResources = 9,
	Boredom = 10,
	ArtilleryVulnerability = 11,
	Max_None = 12,
	EFortCombatFactors_MAX = 13
};

// Enum FortniteGame.EFortAIDirectorFactor
enum class EFortAIDirectorFactor : uint8 {
	PlayerDamageThreat = 0,
	ObjectiveDamageThreat = 1,
	ObjectivePathCost = 2,
	PlayerPathCost = 3,
	PlayerMovement = 4,
	TrapsEffective = 5,
	PlayerWander = 6,
	NearbyEnemyPresence = 7,
	OffensiveResources = 8,
	DefensiveResources = 9,
	Boredom = 10,
	ArtilleryVulnerability = 11,
	Max_None = 12,
	EFortAIDirectorFactor_MAX = 13
};

// Enum FortniteGame.EFortFactorContributionType
enum class EFortFactorContributionType : uint8 {
	CurrentValue_Direct = 0,
	CurrentValue_Inverse = 1,
	AverageValue_Direct = 2,
	AverageValue_Inverse = 3,
	EFortFactorContributionType_MAX = 4
};

// Enum FortniteGame.EFortContributionGraphElements
enum class EFortContributionGraphElements : uint8 {
	ProportionalLine = 0,
	IntegralLine = 1,
	TotalLine = 2,
	PendingLine = 3,
	ActionLine = 4,
	Max_None = 5,
	EFortContributionGraphElements_MAX = 6
};

// Enum FortniteGame.EFortIntensityGraphElements
enum class EFortIntensityGraphElements : uint8 {
	ActualIntensity = 0,
	DesiredIntensity = 1,
	Max_None = 2,
	EFortIntensityGraphElements_MAX = 3
};

// Enum FortniteGame.EFortPIDValueGraphElements
enum class EFortPIDValueGraphElements : uint8 {
	Proportional = 0,
	Integral = 1,
	Max_None = 2,
	EFortPIDValueGraphElements_MAX = 3
};

// Enum FortniteGame.EFortConditionalResourceItemTest
enum class EFortConditionalResourceItemTest : uint8 {
	CanEarnMtx = 0,
	EFortConditionalResourceItemTest_MAX = 1
};

// Enum FortniteGame.EClientsReadyToJoinPhase
enum class EClientsReadyToJoinPhase : uint8 {
	Uninitialized = 0,
	WaitingForPlaylistInitialize = 1,
	WaitingForPartyLeader = 2,
	WaitingForLoadContentCall = 3,
	ReadyToJoin = 4,
	EClientsReadyToJoinPhase_MAX = 5
};

// Enum FortniteGame.EFortEncryptionStatus
enum class EFortEncryptionStatus : uint8 {
	ENCRYPTED = 0,
	RELEASED = 1,
	EFortEncryptionStatus_MAX = 2
};

// Enum FortniteGame.EFortContentEncryptionCollectionGrouping
enum class EFortContentEncryptionCollectionGrouping : uint8 {
	Individual = 0,
	Combined = 1,
	ByCosmeticSet = 2,
	EFortContentEncryptionCollectionGrouping_MAX = 3
};

// Enum FortniteGame.EFortContentEncryptionAllowedReferences
enum class EFortContentEncryptionAllowedReferences : uint8 {
	None = 0,
	SoftOnly = 1,
	Any = 2,
	EFortContentEncryptionAllowedReferences_MAX = 3
};

// Enum FortniteGame.EFortContentEncryptionGroupType
enum class EFortContentEncryptionGroupType : uint8 {
	Root = 0,
	Explicit = 1,
	EFortContentEncryptionGroupType_MAX = 2
};

// Enum FortniteGame.EFortContextualTutorialPlatform
enum class EFortContextualTutorialPlatform : uint8 {
	Any = 0,
	PcAndConsole = 1,
	Mobile = 2,
	EFortContextualTutorialPlatform_MAX = 3
};

// Enum FortniteGame.EFortContrailsState
enum class EFortContrailsState : uint8 {
	NotActive = 0,
	ActivationPending = 1,
	AwaitingLoad = 2,
	Active = 3,
	EFortContrailsState_MAX = 4
};

// Enum FortniteGame.ECollectionsComponentValidityResult
enum class ECollectionsComponentValidityResult : uint8 {
	IsValid = 0,
	IsNotValid = 1,
	ECollectionsComponentValidityResult_MAX = 2
};

// Enum FortniteGame.EContextualContext
enum class EContextualContext : uint8 {
	DoNotShow = 0,
	BusPhase = 1,
	Skydiving = 2,
	Gameplay = 3,
	EContextualContext_MAX = 4
};

// Enum FortniteGame.EContextualEvent
enum class EContextualEvent : uint8 {
	Generic = 0,
	Location = 1,
	InventoryAdded = 2,
	InventoryRemoved = 3,
	StartSkydiving = 4,
	NewQuests = 5,
	EContextualEvent_MAX = 6
};

// Enum FortniteGame.EIndicatorStateImage
enum class EIndicatorStateImage : uint8 {
	FIRST_FRIENDLY_STATE = 0,
	Default = 0,
	InCombat = 1,
	DBNO = 2,
	BeingRevived = 3,
	Dead = 4,
	LAST_FRIENDLY_STATE = 4,
	FIRST_CHAT_MESSAGE = 5,
	NeedAmmoHeavy = 5,
	NeedAmmoLight = 6,
	NeedAmmoMedium = 7,
	NeedAmmoShells = 8,
	NeedAmmoRocket = 9,
	ChatBubble = 10,
	EnemySpotted = 11,
	NeedBandages = 12,
	NeedMaterials = 13,
	NeedShields = 14,
	NeedWeapon = 15,
	LAST_CHAT_MESSAGE = 15,
	FIRST_MATE_STATE = 16,
	Squadmate = 16,
	Teammate = 17,
	LAST_MATE_STATE = 17,
	FIRST_ENEMY_STATE = 18,
	Enemy = 18,
	LAST_ENEMY_STATE = 18,
	FIRST_NPC_STATE = 19,
	FriendlyNPC = 19,
	EnemyNPC = 20,
	EliteFriendlyNPC = 21,
	EliteEnemyNPC = 22,
	LAST_NPC_STATE = 22,
	FIRST_WORLDITEM_STATE = 23,
	Interactable = 23,
	InteractableLarge = 24,
	GameplayItem = 25,
	TreasureChest = 26,
	LAST_WORLDITEM_STATE = 26,
	FIRST_HARDCORE_STATE = 27,
	HardCoreBeacon = 27,
	LAST_HARDCORE_STATE = 27,
	LAST_STATE = 27,
	None = 28,
	MAX = 29
};

// Enum FortniteGame.EShareActorWith
enum class EShareActorWith : uint8 {
	None = 0,
	SquadOnTeam = 1,
	AllTeam = 2,
	EShareActorWith_MAX = 3
};

// Enum FortniteGame.EShareActorWithMask
enum class EShareActorWithMask : uint8 {
	None = 0,
	SquadOnTeam = 1,
	AllTeam = 2,
	Target = 4,
	EShareActorWithMask_MAX = 5
};

// Enum FortniteGame.EStashInventoryServiceSyncState
enum class EStashInventoryServiceSyncState : uint8 {
	Uninitialized = 0,
	Syncing = 1,
	Ready = 2,
	EStashInventoryServiceSyncState_MAX = 3
};

// Enum FortniteGame.EMinigameActivityComponentValidityResult
enum class EMinigameActivityComponentValidityResult : uint8 {
	Valid = 0,
	IsNotValid = 1,
	EMinigameActivityComponentValidityResult_MAX = 2
};

// Enum FortniteGame.EMinigameActivityStat
enum class EMinigameActivityStat : uint8 {
	Score = 0,
	Time = 1,
	Distance = 2,
	RaceProgress = 3,
	CurrentLap = 4,
	MaxLaps = 5,
	BestLapTime = 6,
	COUNT = 7,
	EMinigameActivityStat_MAX = 8
};

// Enum FortniteGame.ESkydiveFeedbackPhase
enum class ESkydiveFeedbackPhase : uint8 {
	Initial = 0,
	WithGlider = 1,
	InVortex = 2,
	None = 3,
	ESkydiveFeedbackPhase_MAX = 4
};

// Enum FortniteGame.EQuestAnalyticStage
enum class EQuestAnalyticStage : uint8 {
	Granted = 0,
	AutoCompleted = 1,
	Completed = 2,
	Failed = 3,
	EQuestAnalyticStage_MAX = 4
};

// Enum FortniteGame.EConversationEventQueryMethod
enum class EConversationEventQueryMethod : uint8 {
	CheckAgainstCurrentConversationParticipant = 0,
	CheckAgainstConversationEntryTag = 1,
	EConversationEventQueryMethod_MAX = 2
};

// Enum FortniteGame.EQuestSpecificationMethod
enum class EQuestSpecificationMethod : uint8 {
	Static = 0,
	Slotted = 1,
	ServiceProvider = 2,
	EQuestSpecificationMethod_MAX = 3
};

// Enum FortniteGame.EFortSentenceAudioPreference
enum class EFortSentenceAudioPreference : uint8 {
	AudioAsset = 0,
	FeedbackBank = 1,
	EFortSentenceAudioPreference_MAX = 2
};

// Enum FortniteGame.EContextRequirementMatchPolicy
enum class EContextRequirementMatchPolicy : uint8 {
	RequireAll = 0,
	RequireAny = 1,
	EContextRequirementMatchPolicy_MAX = 2
};

// Enum FortniteGame.EPreventAbilityUseReason
enum class EPreventAbilityUseReason : uint8 {
	CannotAfford = 0,
	AlreadyActive = 1,
	AbilityActivationBlocked = 2,
	None = 3,
	Count = 4,
	EPreventAbilityUseReason_MAX = 5
};

// Enum FortniteGame.EDataDrivenEffectRecipient
enum class EDataDrivenEffectRecipient : uint8 {
	Player = 0,
	NPC = 1,
	EDataDrivenEffectRecipient_MAX = 2
};

// Enum FortniteGame.ERequirementMatchPolicy
enum class ERequirementMatchPolicy : uint8 {
	RequireAll = 0,
	RequireAny = 1,
	ERequirementMatchPolicy_MAX = 2
};

// Enum FortniteGame.EPreventUseStormCircleServiceReason
enum class EPreventUseStormCircleServiceReason : uint8 {
	CannotAfford = 0,
	AlreadyActive = 1,
	StormLocationsAlreadyRevealed = 2,
	None = 3,
	EPreventUseStormCircleServiceReason_MAX = 4
};

// Enum FortniteGame.ESupplyDropSpawnLocationPolicy
enum class ESupplyDropSpawnLocationPolicy : uint8 {
	RadiusAroundLocation = 0,
	SafeZone = 1,
	ESupplyDropSpawnLocationPolicy_MAX = 2
};

// Enum FortniteGame.EPreventSupplyDropUseReason
enum class EPreventSupplyDropUseReason : uint8 {
	CannotAfford = 0,
	OutOfStock = 1,
	None = 2,
	Count = 3,
	EPreventSupplyDropUseReason_MAX = 4
};

// Enum FortniteGame.ECosmeticStepOrdinality
enum class ECosmeticStepOrdinality : uint8 {
	PreStep = 0,
	Default = 1,
	PostStep = 2,
	NumPhases = 3,
	ECosmeticStepOrdinality_MAX = 4
};

// Enum FortniteGame.ECosmeticTestOperationType
enum class ECosmeticTestOperationType : uint8 {
	Multiply = 0,
	Add = 1,
	None = 2,
	ECosmeticTestOperationType_MAX = 3
};

// Enum FortniteGame.EFCRP_LoopBehavior
enum class EFCRP_LoopBehavior : uint8 {
	StopAtEnd = 0,
	PingPong = 1,
	WrapAround = 2,
	EFCRP_MAX = 3
};

// Enum FortniteGame.EFortRichColorConflictResolutionRules
enum class EFortRichColorConflictResolutionRules : uint8 {
	NoConflictsAllowed = 0,
	BlackOrWhiteCannotConflict = 1,
	MinimumDistanceBlackOrWhite = 2,
	MinimumContrast = 3,
	MinimumContrastOrHueSaturationShift = 4,
	MinimumContrastGrayscale = 5,
	EFortRichColorConflictResolutionRules_MAX = 6
};

// Enum FortniteGame.EAnimInstanceClassSwapType
enum class EAnimInstanceClassSwapType : uint8 {
	None = 0,
	SwapOnMatch = 1,
	EAnimInstanceClassSwapType_MAX = 2
};

// Enum FortniteGame.ELoadoutVariantInsertType
enum class ELoadoutVariantInsertType : uint8 {
	StartOfArray = 0,
	EndOfArray = 1,
	ELoadoutVariantInsertType_MAX = 2
};

// Enum FortniteGame.ECosmeticMetaTagRequirementCategory
enum class ECosmeticMetaTagRequirementCategory : uint8 {
	None = 0,
	Glider = 1,
	Pickaxe = 2,
	Backpack = 3,
	Character = 4,
	FullLoadout = 5,
	MAX = 6
};

// Enum FortniteGame.ECreativeAssetCostFilterMethod
enum class ECreativeAssetCostFilterMethod : uint8 {
	IncludeOnly = 0,
	Exclude = 1,
	ECreativeAssetCostFilterMethod_MAX = 2
};

// Enum FortniteGame.ECreativeClassType
enum class ECreativeClassType : uint8 {
	ClassSlot = 0,
	NoClass = 1,
	All = 2,
	Any = 3,
	ECreativeClassType_MAX = 4
};

// Enum FortniteGame.EFortCreativeDiscoveryDeterminism
enum class EFortCreativeDiscoveryDeterminism : uint8 {
	Always = 0,
	Random = 1,
	PlayerDeterministic = 2,
	PartyDeterministic = 3,
	EpicEmployee = 4,
	Never = 5,
	EFortCreativeDiscoveryDeterminism_MAX = 6
};

// Enum FortniteGame.EFortCreativeDiscoveryPanelType
enum class EFortCreativeDiscoveryPanelType : uint8 {
	CuratedList = 0,
	MetricDriven = 1,
	Recommendations = 2,
	PlayHistory = 3,
	AnalyticsList = 4,
	Tournaments = 5,
	EFortCreativeDiscoveryPanelType_MAX = 6
};

// Enum FortniteGame.EFortCreativeDiscoveryPanelOrdering
enum class EFortCreativeDiscoveryPanelOrdering : uint8 {
	Locked = 0,
	Floating = 1,
	EFortCreativeDiscoveryPanelOrdering_MAX = 2
};

// Enum FortniteGame.EFortCreativeDiscoveryPlayHistoryType
enum class EFortCreativeDiscoveryPlayHistoryType : uint8 {
	RecentlyPlayed = 0,
	Favorites = 1,
	RecentlyPlayedAndFavorites = 2,
	Queued = 3,
	EFortCreativeDiscoveryPlayHistoryType_MAX = 4
};

// Enum FortniteGame.EFortCreativeDiscoverySkippedEntries
enum class EFortCreativeDiscoverySkippedEntries : uint8 {
	None = 0,
	ByCount = 1,
	ByPercent = 2,
	EFortCreativeDiscoverySkippedEntries_MAX = 3
};

// Enum FortniteGame.EFortCreativeEventSystemType
enum class EFortCreativeEventSystemType : uint8 {
	Channels = 0,
	ChannelsWithEvents = 1,
	DirectBinding = 2,
	EFortCreativeEventSystemType_MAX = 3
};

// Enum FortniteGame.EFortCreativeItemDropAmount
enum class EFortCreativeItemDropAmount : uint8 {
	All = 0,
	FlatAmount = 1,
	Percentage = 2,
	EFortCreativeItemDropAmount_MAX = 3
};

// Enum FortniteGame.EFortCreativeLinearMoverCollisionBehavior
enum class EFortCreativeLinearMoverCollisionBehavior : uint8 {
	EFCLMCB_None = 0,
	EFCLMCB_Stop = 1,
	EFCLMCB_Reverse = 2,
	EFCLMCB_Push = 3,
	EFCLMCB_MAX = 4
};

// Enum FortniteGame.ECreativeLinkPreviewSize
enum class ECreativeLinkPreviewSize : uint8 {
	Small = 0,
	Medium = 1,
	Large = 2,
	Extra_Small = 3,
	NUM_SIZES = 4,
	ECreativeLinkPreviewSize_MAX = 5
};

// Enum FortniteGame.EFortLockDeviceVisibilityDuringGames
enum class EFortLockDeviceVisibilityDuringGames : uint8 {
	No = 0,
	Yes = 1,
	HologramOnly = 2,
	EFortLockDeviceVisibilityDuringGames_MAX = 3
};

// Enum FortniteGame.EHitTraceType
enum class EHitTraceType : uint8 {
	Single = 0,
	Multi = 1,
	EHitTraceType_MAX = 2
};

// Enum FortniteGame.EAddToSelectionResult
enum class EAddToSelectionResult : uint8 {
	Added = 0,
	Removed = 1,
	AtLimit = 2,
	None = 3,
	EAddToSelectionResult_MAX = 4
};

// Enum FortniteGame.ECameraSpaceHoldPosition
enum class ECameraSpaceHoldPosition : uint8 {
	AsPickup = 0,
	Left = 1,
	Center = 2,
	Right = 3,
	ECameraSpaceHoldPosition_MAX = 4
};

// Enum FortniteGame.EBuildingAsPropSetting
enum class EBuildingAsPropSetting : uint8 {
	None = 0,
	SnapToEdge = 1,
	SnapToCenter = 2,
	EBuildingAsPropSetting_MAX = 3
};

// Enum FortniteGame.ECreativePortalManagerValidityResult
enum class ECreativePortalManagerValidityResult : uint8 {
	Valid = 0,
	Invalid = 1,
	ECreativePortalManagerValidityResult_MAX = 2
};

// Enum FortniteGame.EFortCreativePlotPermission
enum class EFortCreativePlotPermission : uint8 {
	Private = 0,
	Public = 1,
	EFortCreativePlotPermission_MAX = 2
};

// Enum FortniteGame.ERealEstateOffsetType
enum class ERealEstateOffsetType : uint8 {
	CustomOffsetFromCorner = 0,
	Center = 1,
	ERealEstateOffsetType_MAX = 2
};

// Enum FortniteGame.EFortCreativeResourceNodeDepletionMode
enum class EFortCreativeResourceNodeDepletionMode : uint8 {
	Destroy = 0,
	RestockOnDelay = 1,
	RestockOverTime = 2,
	StayEmpty = 3,
	None = 4,
	EFortCreativeResourceNodeDepletionMode_MAX = 5
};

// Enum FortniteGame.EFortSourDropperColorType
enum class EFortSourDropperColorType : uint8 {
	None = 0,
	Bright = 1,
	MidBright = 2,
	MidDark = 3,
	Dark = 4,
	EFortSourDropperColorType_MAX = 5
};

// Enum FortniteGame.ECreativeTeamType
enum class ECreativeTeamType : uint8 {
	TeamIndex = 0,
	None = 1,
	All = 2,
	Any = 3,
	Allies = 4,
	Hostiles = 5,
	Friendlies = 6,
	Enemies = 7,
	Neutral = 8,
	Random = 9,
	DoNotSwitch = 10,
	ActivatingTeam = 11,
	WinningTeam = 12,
	UseGameWinConditions = 13,
	CompletingTeamWins = 14,
	TriggeringPlayer = 15,
	TriggeringTeam = 16,
	Spectating = 17,
	Cooperative = 18,
	FreeForAll = 19,
	Custom = 20,
	SpawnOnNextRound = 21,
	Spawn = 22,
	Spectate = 23,
	ECreativeTeamType_MAX = 24
};

// Enum FortniteGame.EFortCreativeTeleporterGroup
enum class EFortCreativeTeleporterGroup : uint8 {
	Group_A = 0,
	Group_B = 1,
	Group_C = 2,
	Group_D = 3,
	Group_E = 4,
	Group_F = 5,
	Group_G = 6,
	Group_H = 7,
	Group_I = 8,
	Group_J = 9,
	Group_K = 10,
	Group_L = 11,
	Group_M = 12,
	Group_N = 13,
	Group_O = 14,
	Group_P = 15,
	Group_Q = 16,
	Group_R = 17,
	Group_S = 18,
	Group_T = 19,
	Group_U = 20,
	Group_V = 21,
	Group_W = 22,
	Group_X = 23,
	Group_Y = 24,
	Group_Z = 25,
	Group_None = 26,
	Group_MAX = 27
};

// Enum FortniteGame.EFortCreativeTeleporterEvent
enum class EFortCreativeTeleporterEvent : uint8 {
	Entered = 0,
	Exited = 1,
	Enabled = 2,
	Disabled = 3,
	None = 4,
	EFortCreativeTeleporterEvent_MAX = 5
};

// Enum FortniteGame.ETimerDeviceState
enum class ETimerDeviceState : uint8 {
	Enabled = 0,
	Activated = 1,
	Paused = 2,
	Completed = 3,
	Disabled = 4,
	MAX = 5
};

// Enum FortniteGame.EMMSRulePreset
enum class EMMSRulePreset : uint8 {
	RespectParties = 0,
	KeepFull = 1,
	Off = 2,
	EMMSRulePreset_MAX = 3
};

// Enum FortniteGame.EMMSPlayersPerTeamPreset
enum class EMMSPlayersPerTeamPreset : uint8 {
	Solos = 1,
	Duos = 2,
	Trios = 3,
	Squads = 4,
	SplitEvenly = 5,
	Dynamic = 6,
	EMMSPlayersPerTeamPreset_MAX = 7
};

// Enum FortniteGame.EFortCurieNativeFXType
enum class EFortCurieNativeFXType : uint8 {
	None = 0,
	Electricity = 1,
	Fire = 2,
	Charred = 4,
	Max = 8
};

// Enum FortniteGame.EFortCurieExecutionType
enum class EFortCurieExecutionType : uint8 {
	Application = 0,
	Interaction = 1,
	EFortCurieExecutionType_MAX = 2
};

// Enum FortniteGame.EFortCurieApplicationEvent
enum class EFortCurieApplicationEvent : uint8 {
	OnHit = 0,
	OnBeginOverlap = 1,
	OnEndOverlap = 2,
	MaxValue = 3,
	EFortCurieApplicationEvent_MAX = 4
};

// Enum FortniteGame.EFortNativeCurieFXCueResponse
enum class EFortNativeCurieFXCueResponse : uint8 {
	IgnoreCue = 0,
	AllowCue = 1,
	OverrideCue = 2,
	EFortNativeCurieFXCueResponse_MAX = 3
};

// Enum FortniteGame.EFortCurieToggleComponentActivationBehavior
enum class EFortCurieToggleComponentActivationBehavior : uint8 {
	OnValidAttachment = 0,
	EFortCurieToggleComponentActivationBehavior_MAX = 1
};

// Enum FortniteGame.EFortCurieToggleComponentDeactivationBehavior
enum class EFortCurieToggleComponentDeactivationBehavior : uint8 {
	NeverDeactivate = 0,
	TimedDeactivationAllowRefresh = 1,
	TimedDeactivationNoRefresh = 2,
	EFortCurieToggleComponentDeactivationBehavior_MAX = 3
};

// Enum FortniteGame.ETimespanAsTextFormat
enum class ETimespanAsTextFormat : uint8 {
	DaysHoursMinutesSeconds = 0,
	Colons = 1,
	ColonsWithMilliseconds = 2,
	Approximate = 3,
	ApproximateWithWeeks = 4,
	ApproximateWithMonths = 5,
	ApproximateWithYears = 6,
	ETimespanAsTextFormat_MAX = 7
};

// Enum FortniteGame.ETimespanUnitDisplayFormat
enum class ETimespanUnitDisplayFormat : uint8 {
	Full = 0,
	Abbreviated = 1,
	ETimespanUnitDisplayFormat_MAX = 2
};

// Enum FortniteGame.EDeathCauseReason
enum class EDeathCauseReason : uint8 {
	SelfInflicted = 0,
	SelfInflictedDBNO = 1,
	Eliminated = 2,
	EliminatedDBNO = 3,
	EDeathCauseReason_MAX = 4
};

// Enum FortniteGame.EFortDefenderSubtype
enum class EFortDefenderSubtype : uint8 {
	AssaultRifle = 0,
	Pistol = 1,
	Melee = 2,
	Sniper = 3,
	Shotgun = 4,
	Invalid = 5,
	EFortDefenderSubtype_MAX = 6
};

// Enum FortniteGame.EHordeTierStartStatus
enum class EHordeTierStartStatus : uint8 {
	ReadyToStart = 0,
	WaitingForPlayer = 1,
	WaitingForDBM = 2,
	GenericNotReadyToStart = 3,
	EHordeTierStartStatus_MAX = 4
};

// Enum FortniteGame.EQueueActionType
enum class EQueueActionType : uint8 {
	Plot = 0,
	ZoneCleanup = 1,
	EnvironmentActorRestoration = 2,
	EQueueActionType_MAX = 3
};

// Enum FortniteGame.EHordeWaveStingerType
enum class EHordeWaveStingerType : uint8 {
	WaveSuccess = 0,
	WaveFailure = 1,
	WaveIncoming = 2,
	WaveStarted = 3,
	EHordeWaveStingerType_MAX = 4
};

// Enum FortniteGame.EPlayStopPauseExecutionContext
enum class EPlayStopPauseExecutionContext : uint8 {
	ServerOnly = 0,
	ServerAndClient = 1,
	EPlayStopPauseExecutionContext_MAX = 2
};

// Enum FortniteGame.FDynamicBuildOrder
enum class FDynamicBuildOrder : uint8 {
	X = 0,
	Y = 1,
	Z = 2,
	None = 3,
	FDynamicBuildOrder_MAX = 4
};

// Enum FortniteGame.EFortEntitlementState
enum class EFortEntitlementState : uint8 {
	NotRequested = 0,
	Requesting = 1,
	RequestError = 2,
	NotGranted = 3,
	Granted = 4,
	DevGranted = 5,
	EFortEntitlementState_MAX = 6
};

// Enum FortniteGame.ENavOptionFallbackDir
enum class ENavOptionFallbackDir : uint8 {
	Left = 0,
	Right = 1,
	Up = 2,
	Down = 3,
	Num = 4,
	Invalid = 5,
	ENavOptionFallbackDir_MAX = 6
};

// Enum FortniteGame.EBattlePassExperimentBucketType
enum class EBattlePassExperimentBucketType : uint8 {
	ExistingCrew = 0,
	RedesignBattlePass = 1,
	RedesignCrew = 2,
	EBattlePassExperimentBucketType_MAX = 3
};

// Enum FortniteGame.EReloadMtxExperimentBucketType
enum class EReloadMtxExperimentBucketType : uint8 {
	Disabled = 0,
	ReloadMtxIncremental = 1,
	ReloadMtxStatic = 2,
	EReloadMtxExperimentBucketType_MAX = 3
};

// Enum FortniteGame.EBattlePassPurchaseScreenExperimentBucketType
enum class EBattlePassPurchaseScreenExperimentBucketType : uint8 {
	ShowBattlePassPurchaseScreen = 0,
	SkipBattlePassPurchaseScreen = 1,
	EBattlePassPurchaseScreenExperimentBucketType_MAX = 2
};

// Enum FortniteGame.ETwoOptionExperimentBucketType
enum class ETwoOptionExperimentBucketType : uint8 {
	Option1 = 0,
	Option2 = 1,
	ETwoOptionExperimentBucketType_MAX = 2
};

// Enum FortniteGame.EExperimentBucket
enum class EExperimentBucket : uint8 {
	Baseline = 0,
	Variation1 = 1,
	NotInExperiment = 2,
	EExperimentBucket_MAX = 3
};

// Enum FortniteGame.EFortFeedbackContext
enum class EFortFeedbackContext : uint8 {
	FFC_Instigator = 0,
	FFC_Recipient = 1,
	FFC_TeamWitness = 2,
	FFC_EnemyWitness = 3,
	FFC_AllPawns = 4,
	FFC_Announcer = 5,
	FFC_None_Max = 6,
	FFC_MAX = 7
};

// Enum FortniteGame.EFortFeedbackAddressee
enum class EFortFeedbackAddressee : uint8 {
	FFA_Instigator = 0,
	FFA_Recipient = 1,
	FFA_All = 2,
	FFA_MAX = 3
};

// Enum FortniteGame.EFortFeedbackSelectionMethod
enum class EFortFeedbackSelectionMethod : uint8 {
	FFSM_Instigator = 0,
	FFSM_Recipient = 1,
	FFSM_TeamWitness = 2,
	FFSM_EnemyWitness = 3,
	FFSM_Random = 4,
	FFSM_Priority_IRTE = 5,
	FFSM_AllPawns = 6,
	FFSM_Announcer = 7,
	FFSM_MAX = 8
};

// Enum FortniteGame.EFortFeedbackBroadcastFilter
enum class EFortFeedbackBroadcastFilter : uint8 {
	FFBF_Speaker = 0,
	FFBF_SpeakerTeam = 1,
	FFBF_SpeakerAdressee = 2,
	FFBF_HumanPvP_Team1 = 3,
	FFBF_HumanPvP_Team2 = 4,
	FFBF_None_Max = 5,
	FFBF_MAX = 6
};

// Enum FortniteGame.EFortFoleyHitAudioType
enum class EFortFoleyHitAudioType : uint8 {
	Body = 0,
	Shield = 1,
	Crit = 2,
	Death = 3,
	DeathCrit = 4,
	Fall = 5,
	FallDeath = 6,
	Max_None = 7,
	EFortFoleyHitAudioType_MAX = 8
};

// Enum FortniteGame.EFortFootstepAudioType
enum class EFortFootstepAudioType : uint8 {
	Crouch = 0,
	CrouchSprint = 1,
	Walk = 2,
	Sprint = 3,
	Jump = 4,
	Land = 5,
	LandHard = 6,
	Max_None = 7,
	EFortFootstepAudioType_MAX = 8
};

// Enum FortniteGame.EFortFootstepSurfaceType
enum class EFortFootstepSurfaceType : uint8 {
	Default = 0,
	Wood = 1,
	Stone = 2,
	Metal = 3,
	Water = 4,
	Snow = 5,
	Ice = 6,
	Lava = 7,
	Dirt = 8,
	Grass = 9,
	Sand = 10,
	Cube = 11,
	Chrome = 12,
	ChromePetrified = 13,
	Max_None = 14,
	EFortFootstepSurfaceType_MAX = 15
};

// Enum FortniteGame.EFortFootstepPosition
enum class EFortFootstepPosition : uint8 {
	Parallel = 0,
	Above = 1,
	Below = 2,
	AboveOrBelowAndVisible = 3,
	Max_None = 4,
	EFortFootstepPosition_MAX = 5
};

// Enum FortniteGame.EFortFootstepPlayerRelation
enum class EFortFootstepPlayerRelation : uint8 {
	LocalPlayer = 0,
	Friendly = 1,
	Enemy = 2,
	Max_None = 3,
	EFortFootstepPlayerRelation_MAX = 4
};

// Enum FortniteGame.EFortFootstepStanceType
enum class EFortFootstepStanceType : uint8 {
	Walk = 0,
	Run = 1,
	Sprint = 2,
	CrouchWalk = 3,
	CrouchRun = 4,
	Max_None = 5,
	EFortFootstepStanceType_MAX = 6
};

// Enum FortniteGame.EFortFootstepSurface
enum class EFortFootstepSurface : uint8 {
	Dirt = 0,
	Metal = 1,
	Sand = 2,
	Snow = 3,
	Stone = 4,
	Water = 5,
	Wood = 6,
	Chrome = 7,
	ChromePetrified = 8,
	Max_None = 9,
	EFortFootstepSurface_MAX = 10
};

// Enum FortniteGame.EFriendChestInstancedType
enum class EFriendChestInstancedType : uint8 {
	ItemDefinition = 0,
	FreshDripCounter = 1,
	GrantXp = 2,
	Undefined = 3,
	EFriendChestInstancedType_MAX = 4
};

// Enum FortniteGame.EFriendChestTimePeriod
enum class EFriendChestTimePeriod : uint8 {
	Daily = 0,
	Weekly = 1,
	EFriendChestTimePeriod_MAX = 2
};

// Enum FortniteGame.EFortGameActivityType
enum class EFortGameActivityType : uint8 {
	Undefined = 0,
	STW = 1,
	BR = 2,
	LTM = 3,
	CreativePublishedIsland = 4,
	CreativePersonalIsland = 5,
	Valkyrie = 6,
	ModeSet = 7,
	Reference = 8,
	EFortGameActivityType_MAX = 9
};

// Enum FortniteGame.EActivityCheckSolution
enum class EActivityCheckSolution : uint8 {
	None = 0,
	Purchase = 1,
	Install = 2,
	Settings = 3,
	LeavePartyAndPlayTutorial = 4,
	EActivityCheckSolution_MAX = 5
};

// Enum FortniteGame.EFortDiscoveryOptionsOverride
enum class EFortDiscoveryOptionsOverride : uint8 {
	Undefined = 0,
	Privacy = 1,
	FillOnly = 2,
	EFortDiscoveryOptionsOverride_MAX = 3
};

// Enum FortniteGame.EFortDiscoveryDisabledFeatures
enum class EFortDiscoveryDisabledFeatures : uint8 {
	Undefined = 0,
	AllWrites = 1,
	Favorites = 2,
	PlayHistory = 3,
	Queues = 4,
	EFortDiscoveryDisabledFeatures_MAX = 5
};

// Enum FortniteGame.ESubGameAccessReason
enum class ESubGameAccessReason : uint8 {
	NoAccess = 0,
	OpenAccess = 1,
	TokenItemAccess = 2,
	XboxHomeSharingAccess = 3,
	XboxServiceOutageAccess = 4,
	LimitedAccess = 5,
	ESubGameAccessReason_MAX = 6
};

// Enum FortniteGame.EDefaultCharacterSelection
enum class EDefaultCharacterSelection : uint8 {
	Random = 0,
	DefaultBase = 1,
	EDefaultCharacterSelection_MAX = 2
};

// Enum FortniteGame.EMutatorAddTarget
enum class EMutatorAddTarget : uint8 {
	FortGameStateAthena = 0,
	FortMinigame = 1,
	EMutatorAddTarget_MAX = 2
};

// Enum FortniteGame.EPlayerQueueType
enum class EPlayerQueueType : uint8 {
	Player = 0,
	BroadcastSpectator = 1,
	EPlayerQueueType_MAX = 2
};

// Enum FortniteGame.EDynamicSoundOverride
enum class EDynamicSoundOverride : uint8 {
	Cue = 0,
	Wave = 1,
	Class = 2,
	EDynamicSoundOverride_MAX = 3
};

// Enum FortniteGame.EFortInputFilterLevel
enum class EFortInputFilterLevel : uint8 {
	None = 0,
	Touch = 1,
	Gamepad = 2,
	Mouse = 3,
	EFortInputFilterLevel_MAX = 4
};

// Enum FortniteGame.EAircraftLaunchReason
enum class EAircraftLaunchReason : uint8 {
	StdTimerAllPlayers = 0,
	EarlyTimerAllPlayers = 1,
	StdTimerMostPlayers = 2,
	EarlyTimerMostPlayers = 3,
	StdTimerFewPlayers = 4,
	EAircraftLaunchReason_MAX = 5
};

// Enum FortniteGame.EGameModePauseWarmupMaskId
enum class EGameModePauseWarmupMaskId : uint8 {
	None = 0,
	Debug = 1,
	Mutator = 2,
	BroadcastController = 4,
	PlayerBotsSpawning = 8,
	DownloadOnDemand = 16,
	EGameModePauseWarmupMaskId_MAX = 17
};

// Enum FortniteGame.EFortGamepadSensitivity
enum class EFortGamepadSensitivity : uint8 {
	Invalid = 0,
	Slow = 1,
	SlowPlus = 2,
	SlowPlusPlus = 3,
	Normal = 4,
	NormalPlus = 5,
	NormalPlusPlus = 6,
	Fast = 7,
	FastPlus = 8,
	FastPlusPlus = 9,
	Insane = 10,
	MAX = 11
};

// Enum FortniteGame.EFortGamepadLookInputCurve
enum class EFortGamepadLookInputCurve : uint8 {
	Linear = 0,
	Exponential = 1,
	EFortGamepadLookInputCurve_MAX = 2
};

// Enum FortniteGame.EFortGameplayAbilityMontageSectionToPlay
enum class EFortGameplayAbilityMontageSectionToPlay : uint8 {
	FirstSection = 0,
	RandomSection = 1,
	TestedRandomSection = 2,
	EFortGameplayAbilityMontageSectionToPlay_MAX = 3
};

// Enum FortniteGame.EFortAIWeaponUsage
enum class EFortAIWeaponUsage : uint8 {
	NoWeaponUsage = 0,
	UsesRangedWeapon = 1,
	UsesMeleeWeapon = 2,
	EFortAIWeaponUsage_MAX = 3
};

// Enum FortniteGame.EFortGetPlayerPawnExecutions
enum class EFortGetPlayerPawnExecutions : uint8 {
	ValidFortPlayerPawn = 0,
	AvatarCastFailed = 1,
	EFortGetPlayerPawnExecutions_MAX = 2
};

// Enum FortniteGame.EFortGameplayAbilityActivation
enum class EFortGameplayAbilityActivation : uint8 {
	Passive = 0,
	Triggered = 1,
	Active = 2,
	EFortGameplayAbilityActivation_MAX = 3
};

// Enum FortniteGame.EFortAbilityCostSource
enum class EFortAbilityCostSource : uint8 {
	Stamina = 0,
	Durability = 1,
	AmmoMagazine = 2,
	AmmoPrimary = 3,
	Item = 4,
	EFortAbilityCostSource_MAX = 5
};

// Enum FortniteGame.EFortGameplayAbilityTagChangedActionType
enum class EFortGameplayAbilityTagChangedActionType : uint8 {
	Cancel = 0,
	EFortGameplayAbilityTagChangedActionType_MAX = 1
};

// Enum FortniteGame.EFortGameplayAbilityTagChangedEvent
enum class EFortGameplayAbilityTagChangedEvent : uint8 {
	NewlyAdded = 0,
	Increased = 1,
	FullyRemoved = 2,
	Decreased = 3,
	EFortGameplayAbilityTagChangedEvent_MAX = 4
};

// Enum FortniteGame.FTurnTransitionCondition
enum class FTurnTransitionCondition : uint8 {
	None = 0,
	Inplace = 1,
	Start = 2,
	Moving = 3,
	FTurnTransitionCondition_MAX = 4
};

// Enum FortniteGame.EJumpBoostPackState
enum class EJumpBoostPackState : uint8 {
	Idle = 0,
	Boost = 1,
	Hovering = 2,
	Falling = 3,
	None = 4,
	EJumpBoostPackState_MAX = 5
};

// Enum FortniteGame.EMedicPackState
enum class EMedicPackState : uint8 {
	Idle = 0,
	Active = 1,
	None = 2,
	EMedicPackState_MAX = 3
};

// Enum FortniteGame.EFortGameplayCueAttachType
enum class EFortGameplayCueAttachType : uint8 {
	AttachToTarget = 0,
	DoNotAttach = 1,
	EFortGameplayCueAttachType_MAX = 2
};

// Enum FortniteGame.EFortGameplayCueSourceCondition
enum class EFortGameplayCueSourceCondition : uint8 {
	AnySource = 0,
	LocalPlayerSource = 1,
	NonLocalPlayerSource = 2,
	EFortGameplayCueSourceCondition_MAX = 3
};

// Enum FortniteGame.EFortGameplayDataTrackerEventContributionType
enum class EFortGameplayDataTrackerEventContributionType : uint8 {
	Accumulate = 0,
	Set = 1,
	EFortGameplayDataTrackerEventContributionType_MAX = 2
};

// Enum FortniteGame.ESetCVarType
enum class ESetCVarType : uint8 {
	Numeric = 0,
	String = 1,
	ESetCVarType_MAX = 2
};

// Enum FortniteGame.EFortServerStatus
enum class EFortServerStatus : uint8 {
	Launching = 0,
	Idle = 1,
	StartingMode = 2,
	Running = 3,
	ServerTravel = 4,
	ShuttingDown = 5,
	Restarting = 6,
	UpdateCheck = 7,
	EFortServerStatus_MAX = 8
};

// Enum FortniteGame.EFortServerGameMode
enum class EFortServerGameMode : uint8 {
	Idle = 0,
	LobbyPvE = 1,
	LobbyPvP = 2,
	ZonePvP = 3,
	ZonePvE = 4,
	EFortServerGameMode_MAX = 5
};

// Enum FortniteGame.EServerRestartReason
enum class EServerRestartReason : uint8 {
	HotfixApplied = 0,
	GracefulShutdown = 1,
	BeaconJoinDelayRestart = 2,
	Other = 3,
	EServerRestartReason_MAX = 4
};

// Enum FortniteGame.EFortServerContentRestartReason
enum class EFortServerContentRestartReason : uint8 {
	None = 0,
	CreativeCuratedHubChanged = 1,
	CreativeFeaturedIslandsChanged = 2,
	CreativePreloadRevisionChanged = 4,
	CreativePlaylistConditionalFlagsChanged = 8,
	GameFeaturePluginDisabled = 16,
	ForceRestartEventFlagsChanged = 32,
	ForceRestartFlagActiveStateChanged = 64,
	EFortServerContentRestartReason_MAX = 65
};

// Enum FortniteGame.EFortBanHammerNotificationAction
enum class EFortBanHammerNotificationAction : uint8 {
	BanAndKick = 0,
	Kick = 1,
	EFortBanHammerNotificationAction_MAX = 2
};

// Enum FortniteGame.ETeamChatRoomState
enum class ETeamChatRoomState : uint8 {
	NotCreated = 0,
	Creating = 1,
	Created = 2,
	Timeout = 3,
	ETeamChatRoomState_MAX = 4
};

// Enum FortniteGame.EPlayerIndicatorFlags
enum class EPlayerIndicatorFlags : uint8 {
	None = 0,
	Minimap = 1,
	WorldArrow = 2,
	WorldName = 4,
	DBNOCountDown = 8,
	EPlayerIndicatorFlags_MAX = 9
};

// Enum FortniteGame.EAthenaAerialPhase
enum class EAthenaAerialPhase : uint8 {
	None = 0,
	BusCantExit = 1,
	BusCanExit = 2,
	BusCanExitEndZebulonDrone = 3,
	Skydiving = 4,
	Parachuting = 5,
	Falling = 6,
	EAthenaAerialPhase_MAX = 7
};

// Enum FortniteGame.ERadiusTrackingGroupingType
enum class ERadiusTrackingGroupingType : uint8 {
	Global = 0,
	Team = 1,
	Squad = 2,
	ERadiusTrackingGroupingType_MAX = 3
};

// Enum FortniteGame.EAnalyticMatchCounts
enum class EAnalyticMatchCounts : uint8 {
	IDScannerDoorFailed = 0,
	IDSCannerDoorSuccessBelongsToFaction = 1,
	IDSCannerDoorSuccessPlayerDisguised = 2,
	IDSCannerDoorSuccessCarriedHenchman = 3,
	IDSCannerDoorSuccessCarriedHuman = 4,
	IDScannerChestFailed = 5,
	IDSCannerChestSuccessBelongsToFaction = 6,
	IDSCannerChestSuccessPlayerDisguised = 7,
	IDSCannerChestSuccessCarriedHenchman = 8,
	IDSCannerChestSuccessCarriedHuman = 9,
	HenchmenEnteredAlertedState = 10,
	HenchmenEnteredLKPState = 11,
	HenchmenEnteredThreatenedState = 12,
	HenchmenDowned = 13,
	HenchmenEliminated = 14,
	HenchmenInterrogated = 15,
	BossesEliminated = 16,
	DisguisePhoneBoothTimesEntered = 17,
	DisguiseItemTimesUsed = 18,
	HiddenPassagesTimesEntered = 19,
	CameraOrSentryTimesEnteredCautionState = 20,
	CameraOrSentryTimesEnteredAltertedState = 21,
	CameraOrSentryTimesDestroyed = 22,
	GeneratorTimesDisabled = 23,
	UmbrellaNumberOfDashes = 24,
	UmbrellaNumberUsedToFloat = 25,
	UmbrellaAmountDamageBlocked = 26,
	UmbrellaBulletsBlocked = 27,
	UmbrellaMeleeHitsBlocked = 28,
	Count = 29,
	EAnalyticMatchCounts_MAX = 30
};

// Enum FortniteGame.EDefenderSpawnFailureReason
enum class EDefenderSpawnFailureReason : uint8 {
	None = 0,
	AllPlayerSlotsFull = 1,
	DefendersNotUnlocked = 2,
	CurrentlySimulatingDefender = 3,
	NotOutpostOwner = 4,
	EDefenderSpawnFailureReason_MAX = 5
};

// Enum FortniteGame.EFortOfferSeenLevel
enum class EFortOfferSeenLevel : uint8 {
	Unseen = 0,
	Notification = 1,
	ItemShopVisited = 2,
	OfferSectionVisited = 3,
	Purchased = 4,
	EFortOfferSeenLevel_MAX = 5
};

// Enum FortniteGame.EFortMobileFPSMode
enum class EFortMobileFPSMode : uint8 {
	Mode_20Fps = 0,
	Mode_30Fps = 1,
	Mode_45Fps = 2,
	Mode_60Fps = 3,
	Mode_90Fps = 4,
	Mode_120Fps = 5,
	Num = 6,
	EFortMobileFPSMode_MAX = 7
};

// Enum FortniteGame.EFortContentQualityLevel
enum class EFortContentQualityLevel : uint8 {
	Unset = 0,
	Quality_Base = 1,
	Quality_Medium = 2,
	Quality_High = 3,
	Num = 4,
	EFortContentQualityLevel_MAX = 5
};

// Enum FortniteGame.EFortAllowDownloadHighResMipsBehavior
enum class EFortAllowDownloadHighResMipsBehavior : uint8 {
	Disabled_Permanent = 0,
	Disabled_Temp = 1,
	Enabled = 2,
	EFortAllowDownloadHighResMipsBehavior_MAX = 3
};

// Enum FortniteGame.ESavedAccountType
enum class ESavedAccountType : uint8 {
	None = 0,
	Facebook = 1,
	Google = 2,
	Epic = 3,
	Device = 4,
	Headless = 5,
	Refresh = 6,
	ESavedAccountType_MAX = 7
};

// Enum FortniteGame.EFortScalabilityMode
enum class EFortScalabilityMode : uint8 {
	LowPower = 0,
	Frontend = 1,
	EFortScalabilityMode_MAX = 2
};

// Enum FortniteGame.EShowInGamePictureInPicture
enum class EShowInGamePictureInPicture : uint8 {
	Default = 0,
	Hide = 1,
	Show = 2,
	EShowInGamePictureInPicture_MAX = 3
};

// Enum FortniteGame.ERHIType
enum class ERHIType : uint8 {
	D3D11 = 0,
	D3D12 = 1,
	Performance = 2,
	ERHIType_MAX = 3
};

// Enum FortniteGame.EFortAntiAliasingMethod
enum class EFortAntiAliasingMethod : uint8 {
	Disabled = 0,
	FXAA = 1,
	TAA = 2,
	TSR = 3,
	DLSS = 4,
	Num = 5,
	Default = 2,
	EFortAntiAliasingMethod_MAX = 6
};

// Enum FortniteGame.EFortTemporalSuperResolutionSetting
enum class EFortTemporalSuperResolutionSetting : uint8 {
	Performance = 0,
	Balanced = 1,
	Quality = 2,
	Native = 3,
	Num = 4,
	Default = 0,
	EFortTemporalSuperResolutionSetting_MAX = 5
};

// Enum FortniteGame.EFortGiftWrapType
enum class EFortGiftWrapType : uint8 {
	System = 0,
	UserFree = 1,
	UserUnlock = 2,
	UserConsumable = 3,
	Message = 4,
	Ungift = 5,
	EFortGiftWrapType_MAX = 6
};

// Enum FortniteGame.EFortAccountLinkingUIConfig
enum class EFortAccountLinkingUIConfig : uint8 {
	Disabled = 0,
	Default = 1,
	ExternalViewerOnly = 2,
	FullExternal = 3,
	EFortAccountLinkingUIConfig_MAX = 4
};

// Enum FortniteGame.EContentInstallState
enum class EContentInstallState : uint8 {
	NotInstalled = 0,
	Pending = 1,
	Installed = 2,
	Unknown = 3,
	Error = 4,
	EContentInstallState_MAX = 5
};

// Enum FortniteGame.EFortClientUpdateType
enum class EFortClientUpdateType : uint8 {
	Client = 0,
	ContentOnly = 1,
	EFortClientUpdateType_MAX = 2
};

// Enum FortniteGame.ETimeLimitForReplayCinematic
enum class ETimeLimitForReplayCinematic : uint8 {
	OpenTimeLimit = 0,
	DurationTimeLimit = 1,
	DurationExtraTime = 2,
	ETimeLimitForReplayCinematic_MAX = 3
};

// Enum FortniteGame.EGravityGunHolderState
enum class EGravityGunHolderState : uint8 {
	Invalid = 0,
	Unrooting = 1,
	Catching = 2,
	Holding = 3,
	Detached = 4,
	EGravityGunHolderState_MAX = 5
};

// Enum FortniteGame.EGravityGunHolderObjectType
enum class EGravityGunHolderObjectType : uint8 {
	Invalid = 0,
	PhysicsObject = 1,
	Vehicle = 2,
	Projectile = 3,
	PickUp = 4,
	EGravityGunHolderObjectType_MAX = 5
};

// Enum FortniteGame.EGravityGunHolderRotationAxis
enum class EGravityGunHolderRotationAxis : uint8 {
	XZ = 0,
	YZ = 1,
	ZX = 2,
	MAX = 3
};

// Enum FortniteGame.EFortHardcoreModifierTier
enum class EFortHardcoreModifierTier : uint8 {
	Bronze = 0,
	Silver = 1,
	Gold = 2,
	Platinum = 3,
	Diamond = 4,
	EFortHardcoreModifierTier_MAX = 5
};

// Enum FortniteGame.EHarvesterSwingTagType
enum class EHarvesterSwingTagType : uint8 {
	Hit = 0,
	Combo = 1,
	EHarvesterSwingTagType_MAX = 2
};

// Enum FortniteGame.ESwingType
enum class ESwingType : uint8 {
	Swing1 = 0,
	Swing2 = 1,
	Swing3 = 2,
	Swing4 = 3,
	UniqueSwingCount = 4,
	ESwingType_MAX = 5
};

// Enum FortniteGame.ESwingSequence
enum class ESwingSequence : uint8 {
	UpperBodySwing = 0,
	UpperBodyReturn = 1,
	CrouchUpperBodySwing = 2,
	CrouchUpperBodyReturn = 3,
	CrouchInPlaceAdditiveSwing = 4,
	CrouchInPlaceAdditiveReturn = 5,
	SwingSequenceCount = 6,
	ESwingSequence_MAX = 7
};

// Enum FortniteGame.EAnimNotifyTracks
enum class EAnimNotifyTracks : uint8 {
	GenericNotifies = 0,
	DualWield = 1,
	DecisionWindow = 2,
	AbilityTrigger = 3,
	AudioParameters = 4,
	ReloadFx = 5,
	MeleeTrails = 6,
	StopMeleeTrailsOnEnd = 7,
	PlaySwimmingSounds = 8,
	Count = 9,
	EAnimNotifyTracks_MAX = 10
};

// Enum FortniteGame.EHarvestSwingPhase
enum class EHarvestSwingPhase : uint8 {
	Swing = 0,
	End = 1,
	EHarvestSwingPhase_MAX = 2
};

// Enum FortniteGame.EFortHelpItemType
enum class EFortHelpItemType : uint8 {
	Header = 0,
	Entry = 1,
	Max = 2
};

// Enum FortniteGame.EFortHelpContentLocation
enum class EFortHelpContentLocation : uint8 {
	Top = 0,
	Bottom = 1,
	Max = 2
};

// Enum FortniteGame.ESpecializationType
enum class ESpecializationType : uint8 {
	Tier1 = 0,
	Tier2 = 1,
	Tier3 = 2,
	Tier4 = 3,
	NumTiers = 4,
	ESpecializationType_MAX = 5
};

// Enum FortniteGame.EFortHeroLoadoutPerkType
enum class EFortHeroLoadoutPerkType : uint8 {
	Commander = 0,
	Standard = 1,
	EFortHeroLoadoutPerkType_MAX = 2
};

// Enum FortniteGame.EFortSupportBonusType
enum class EFortSupportBonusType : uint8 {
	Normal = 0,
	Tactical = 1,
	Max_None = 2,
	EFortSupportBonusType_MAX = 3
};

// Enum FortniteGame.EFortHexTileAdjacency
enum class EFortHexTileAdjacency : uint8 {
	North = 0,
	NorthEast = 1,
	SouthEast = 2,
	South = 3,
	SouthWest = 4,
	NorthWest = 5,
	Max_None = 6,
	EFortHexTileAdjacency_MAX = 7
};

// Enum FortniteGame.EBannerUsageContext
enum class EBannerUsageContext : uint8 {
	Unknown = 0,
	BannerIcon = 1,
	PhysicalBanner = 2,
	Spray = 3,
	EBannerUsageContext_MAX = 4
};

// Enum FortniteGame.EHomebaseNodeType
enum class EHomebaseNodeType : uint8 {
	Gadget = 0,
	Utility = 1,
	Hidden = 2,
	EHomebaseNodeType_MAX = 3
};

// Enum FortniteGame.EFortHuskAnimType
enum class EFortHuskAnimType : uint8 {
	Basic = 0,
	Dwarf = 1,
	BlasterBig = 2,
	Weak = 3,
	TinyHead = 4,
	Beehive = 5,
	Husky = 6,
	Sploder = 7,
	Zapper = 8,
	EFortHuskAnimType_MAX = 9
};

// Enum FortniteGame.EMapCaptureMethod
enum class EMapCaptureMethod : uint8 {
	None = 0,
	LiveCapture = 1,
	StaticCapture = 2,
	EMapCaptureMethod_MAX = 3
};

// Enum FortniteGame.EFortInputGameMode
enum class EFortInputGameMode : uint8 {
	SaveTheWorld = 0,
	Athena = 1,
	EFortInputGameMode_MAX = 2
};

// Enum FortniteGame.EFortInteractContextInfoType
enum class EFortInteractContextInfoType : uint8 {
	Standard = 0,
	Crafting = 1,
	EFortInteractContextInfoType_MAX = 2
};

// Enum FortniteGame.EInteriorAudioRoomSize
enum class EInteriorAudioRoomSize : uint8 {
	Small = 0,
	Medium = 1,
	Large = 2,
	Max_None = 3,
	EInteriorAudioRoomSize_MAX = 4
};

// Enum FortniteGame.EInteriorAudioBuildingEvaluation
enum class EInteriorAudioBuildingEvaluation : uint8 {
	Invalid = 0,
	Partial = 1,
	Solid = 2,
	EInteriorAudioBuildingEvaluation_MAX = 3
};

// Enum FortniteGame.EInteriorAudioBuildingDirection
enum class EInteriorAudioBuildingDirection : uint8 {
	Left = 0,
	Right = 1,
	Forward = 2,
	Backward = 3,
	Upward = 4,
	EInteriorAudioBuildingDirection_MAX = 5
};

// Enum FortniteGame.EInteriorAudioBuildingRelativePosition
enum class EInteriorAudioBuildingRelativePosition : uint8 {
	SameCell = 0,
	SameCellQuadrantTestFailed = 1,
	OtherCellParallelToForward = 2,
	OtherCellParallelToRight = 3,
	OtherCellParallelToUp = 4,
	Max_None = 5,
	EInteriorAudioBuildingRelativePosition_MAX = 6
};

// Enum FortniteGame.EInteriorAudioBuildingTags
enum class EInteriorAudioBuildingTags : uint8 {
	None = 0,
	HasDoors = 1,
	RotationDependant = 2,
	UseConditionalEvaluation = 3,
	EInteriorAudioBuildingTags_MAX = 4
};

// Enum FortniteGame.EInteriorAudioQuadrant
enum class EInteriorAudioQuadrant : uint8 {
	None = 0,
	Left = 1,
	Right = 2,
	Top = 4,
	Bottom = 8,
	EInteriorAudioQuadrant_MAX = 9
};

// Enum FortniteGame.EInteriorAudioBuildingDefaultRotation
enum class EInteriorAudioBuildingDefaultRotation : uint8 {
	PositiveY = 0,
	NegativeX = 1,
	NegativeY = 2,
	PositiveX = 3,
	EInteriorAudioBuildingDefaultRotation_MAX = 4
};

// Enum FortniteGame.EInteriorAudioBuildingType
enum class EInteriorAudioBuildingType : uint8 {
	None = 0,
	Wall = 1,
	Floor = 2,
	CenterCell = 3,
	EInteriorAudioBuildingType_MAX = 4
};

// Enum FortniteGame.EMinigameStatSavePolicy
enum class EMinigameStatSavePolicy : uint8 {
	Never = 0,
	Always = 1,
	OnlyIfLower = 2,
	OnlyIfHigher = 3,
	EMinigameStatSavePolicy_MAX = 4
};

// Enum FortniteGame.EItemUpgradeRestrictionReason
enum class EItemUpgradeRestrictionReason : uint8 {
	NoAdditionalLevels = 0,
	MaximumLevelAchieved = 1,
	VaultOverflow = 2,
	EItemUpgradeRestrictionReason_MAX = 3
};

// Enum FortniteGame.EItemEvolutionRestrictionReason
enum class EItemEvolutionRestrictionReason : uint8 {
	NoEvolutions = 0,
	BelowMaximumLevel = 1,
	VaultOverflow = 2,
	MissingCatalyst = 3,
	MissingCosts = 4,
	NoRarityUpgrade = 5,
	InUseByCrafting = 6,
	EItemEvolutionRestrictionReason_MAX = 7
};

// Enum FortniteGame.EFortTemplateAccess
enum class EFortTemplateAccess : uint8 {
	Normal = 0,
	Trusted = 1,
	Private = 2,
	EFortTemplateAccess_MAX = 3
};

// Enum FortniteGame.EItemProfileType
enum class EItemProfileType : uint8 {
	Common = 0,
	Campaign = 1,
	Athena = 2,
	EItemProfileType_MAX = 3
};

// Enum FortniteGame.EFortJackalSimEvent
enum class EFortJackalSimEvent : uint8 {
	Jumped = 0,
	EFortJackalSimEvent_MAX = 1
};

// Enum FortniteGame.ELayeredAudioInterpolationType
enum class ELayeredAudioInterpolationType : uint8 {
	None = 0,
	CustomCurve = 1,
	Linear = 2,
	ELayeredAudioInterpolationType_MAX = 3
};

// Enum FortniteGame.ELayeredAudioTriggerDir
enum class ELayeredAudioTriggerDir : uint8 {
	Forward = 0,
	Backward = 1,
	ELayeredAudioTriggerDir_MAX = 2
};

// Enum FortniteGame.EUnableToLoadReason
enum class EUnableToLoadReason : uint8 {
	None = 0,
	PackageDoesNotExist = 1,
	EndPlay = 2,
	UnableToUnload = 3,
	EUnableToLoadReason_MAX = 4
};

// Enum FortniteGame.EUnableToUnloadReason
enum class EUnableToUnloadReason : uint8 {
	None = 0,
	EndPlay = 1,
	EUnableToUnloadReason_MAX = 2
};

// Enum FortniteGame.FLightOverrideLevel
enum class FLightOverrideLevel : uint8 {
	Default = 0,
	High = 1,
	Count = 2,
	FLightOverrideLevel_MAX = 3
};

// Enum FortniteGame.ELobbyMissionGeneratorDetailsRequirement
enum class ELobbyMissionGeneratorDetailsRequirement : uint8 {
	Unknown = 0,
	NotRequired = 1,
	Required = 2,
	ELobbyMissionGeneratorDetailsRequirement_MAX = 3
};

// Enum FortniteGame.ELootQuotaLevel
enum class ELootQuotaLevel : uint8 {
	Unlimited = 0,
	Level1 = 1,
	Level2 = 2,
	Level3 = 3,
	Level4 = 4,
	Level5 = 5,
	Level6 = 6,
	Level7 = 7,
	Level8 = 8,
	Level9 = 9,
	Level10 = 10,
	Level11 = 11,
	Level12 = 12,
	Level13 = 13,
	Level14 = 14,
	Level15 = 15,
	Level16 = 16,
	Level17 = 17,
	NumLevels = 18,
	ELootQuotaLevel_MAX = 19
};

// Enum FortniteGame.EAccessedMapScreenFrom
enum class EAccessedMapScreenFrom : uint8 {
	Invalid = 0,
	Play = 1,
	Event = 2,
	InGame = 3,
	Other = 4,
	EAccessedMapScreenFrom_MAX = 5
};

// Enum FortniteGame.EMarkableResult
enum class EMarkableResult : uint8 {
	Markable = 0,
	Block = 1,
	Continue = 2,
	EMarkableResult_MAX = 3
};

// Enum FortniteGame.EFortMatchmakingType
enum class EFortMatchmakingType : uint8 {
	Gathering = 0,
	CriticalMission = 1,
	QuickPlay = 2,
	Session = 3,
	EFortMatchmakingType_MAX = 4
};

// Enum FortniteGame.EFortSessionHelperJoinResult
enum class EFortSessionHelperJoinResult : uint8 {
	NoResult = 0,
	ReservationSuccess = 1,
	ReservationFailure_PartyLimitReached = 2,
	ReservationFailure_IncorrectPlayerCount = 3,
	ReservationFailure_RequestTimedOut = 4,
	ReservationFailure_ReservationNotFound = 5,
	ReservationFailure_ReservationDenied = 6,
	ReservationFailure_ReservationDenied_Banned = 7,
	ReservationFailure_ReservationRequestCanceled = 8,
	ReservationFailure_ReservationInvalid = 9,
	ReservationFailure_BadSessionId = 10,
	ReservationFailure_ReservationDenied_ContainsExistingPlayers = 11,
	ReservationFailure_GeneralError = 12,
	ReservationFailure_NoSubsystem = 13,
	ReservationFailure_NoIdentity = 14,
	ReservationFailure_InvalidSession = 15,
	ReservationFailure_InvalidUser = 16,
	ReservationFailure_EncryptionKey = 17,
	ReservationFailure_RefreshAuth = 18,
	ReservationFailure_AlreadyJoiningDuringReserve = 19,
	ReservationFailure_AlreadyJoiningDuringSkip = 20,
	JoinSessionSuccess = 21,
	JoinSessionFailure_SessionIsFull = 22,
	JoinSessionFailure_SessionDoesNotExist = 23,
	JoinSessionFailure_CouldNotRetrieveAddress = 24,
	JoinSessionFailure_AlreadyInSession = 25,
	JoinSessionFailure_UnknownError = 26,
	JoinSessionFailure_InvalidSession = 27,
	JoinSessionFailure_InvalidSearchResultIndex = 28,
	JoinSessionFailure_AlreadyJoiningDuringJoin = 29,
	SearchPassFailure_NoSessionHelper = 30,
	SearchPassFailure_InvalidUser = 31,
	SearchPassFailure_NoIdentity = 32,
	SearchPassFailure_InvalidSearchResult = 33,
	SearchPassFailure_InvalidSearchResultIndex = 34,
	JoinSessionCanceled = 35,
	EFortSessionHelperJoinResult_MAX = 36
};

// Enum FortniteGame.EMatchmakingStartLocation
enum class EMatchmakingStartLocation : uint8 {
	Lobby = 0,
	Game = 1,
	CreateNew = 2,
	FindSingle = 3,
	EMatchmakingStartLocation_MAX = 4
};

// Enum FortniteGame.EMatchmakingFlags
enum class EMatchmakingFlags : uint8 {
	None = 0,
	CreateNewOnly = 1,
	NoReservation = 2,
	Private = 4,
	UseWorldDataOwner = 8,
	EMatchmakingFlags_MAX = 9
};

// Enum FortniteGame.EFortMatchmakingPrivacyConfiguration
enum class EFortMatchmakingPrivacyConfiguration : uint8 {
	UserPartyConfigured = 0,
	ForcePrivate = 1,
	ForcePublic = 2,
	EFortMatchmakingPrivacyConfiguration_MAX = 3
};

// Enum FortniteGame.EFortMatchmakingPool
enum class EFortMatchmakingPool : uint8 {
	Any = 0,
	Desktop = 1,
	PS4 = 2,
	XboxOne = 3,
	Mobile = 4,
	Test = 5,
	Switch = 6,
	Console = 7,
	All = 8,
	EFortMatchmakingPool_MAX = 9
};

// Enum FortniteGame.EFortTournamentAlertType
enum class EFortTournamentAlertType : uint8 {
	Warning = 0,
	Info = 1,
	EFortTournamentAlertType_MAX = 2
};

// Enum FortniteGame.EMatchmakingUtilityFlows
enum class EMatchmakingUtilityFlows : uint8 {
	Automatic = 0,
	JoinMatchInProgress = 1,
	SpectateMatch = 2,
	Legacy = 3,
	LinkCode = 4,
	JoinEditingSession = 5,
	SaveTheWorld = 6,
	Internal_Unselected = 7,
	EMatchmakingUtilityFlows_MAX = 8
};

// Enum FortniteGame.EPlaylistUpdateReason
enum class EPlaylistUpdateReason : uint8 {
	LocalPlayerJoinedParty = 0,
	LocalPlayerLocationChangedToFrontend = 1,
	LocalPlayerSubgameSelected = 2,
	LocalPlayerLeftParty = 3,
	LocalPlayerDeclinedCrossplayPermission = 4,
	PartyGameSessionKeyChanged = 5,
	PartySquadFillChanged = 6,
	PartyMemberJoined = 7,
	PartyMemberLeft = 8,
	PartyMemberReadinessChanged = 9,
	PartyMemberInGameReadyCheckChanged = 10,
	PartyMemberLocationChanged = 11,
	PartyMemberSpectateAvailabilityChanged = 12,
	PartyMemberSessionJoinInfoChanged = 13,
	ValidatePlaylist_QoSCheckFailed = 14,
	ValidatePlaylist_TournamentEventOver = 15,
	ValidatePlaylist_BlackoutChanged = 16,
	ValidatePlaylist_MatchmakingEventsChanged = 17,
	ValidatePlaylist_TournamentNewEventStarted = 18,
	ValidatePlaylist_TournamentNewEventCountdown = 19,
	ValidatePlaylist_TournamentsChanged = 20,
	ValidatePlaylist_PlayerTournamentDataRefreshed = 21,
	Initialization = 22,
	EPlaylistUpdateReason_MAX = 23
};

// Enum FortniteGame.EActivePreTravelSetupStepsMask
enum class EActivePreTravelSetupStepsMask : uint8 {
	None = 0,
	WaitingForSubGameContent = 1,
	WaitingForDownloadableContent = 2,
	WaitingForServerInitialization = 4,
	WaitingForContentBeaconDisconnect = 8,
	WaitingForSecondContentBeacon = 16,
	CancelingPreTravelSetup = 32,
	EActivePreTravelSetupStepsMask_MAX = 33
};

// Enum FortniteGame.EMatchmakingErrorV2
enum class EMatchmakingErrorV2 : uint8 {
	Success = 0,
	Canceled = 1,
	NeedUpdate = 2,
	VersionMismatch = 3,
	UpdateFailed = 4,
	NotLoggedIn = 5,
	NoIdentityInterface = 6,
	NoSessionInterface = 7,
	AlreadyInSession = 8,
	FindSessionFailure = 9,
	InvalidSessionId = 10,
	FailedToQueryEncryptionKey = 11,
	FailedToRefreshAuthToken = 12,
	FailedToCleanupSession = 13,
	FailedToJoinSession = 14,
	FailedToTravelToSession = 15,
	Unauthorized = 16,
	BannedFromAthena = 17,
	BannedFromAthenaForExploit = 18,
	BannedFromAthenaForTeaming = 19,
	BannedFromAthenaForTeamKilling = 20,
	InvalidCustomMatchKey = 21,
	FailedToContactGameServices = 22,
	FailedToConnectToMMS = 23,
	MMSCommunicationIssue = 24,
	ServiceReturnedError = 25,
	PlaylistNoLongerAvailable = 26,
	CrossplayUnsetWithInputDevicePoolShift = 27,
	CrossplayNeededForTournamentMatch = 28,
	MatchmakingDisabled = 29,
	AccountLevelTooLow = 30,
	JoinInProgressError = 31,
	SpectateInProgressError = 32,
	MatchmakingInProgress = 33,
	TooFrequentRequests = 34,
	FailedToAcquireContent = 35,
	CellularDataRefusal = 36,
	CancelledDownloadContent = 37,
	DataAssetDirectoryUpdateFailed = 38,
	InvalidPlaylistRevision = 39,
	FailedToConnectToContentBeacon = 40,
	FailedToAcquireServerInitializationState = 41,
	CancelledDuringPreTravelSetup = 42,
	UnknownError = 43,
	EMatchmakingErrorV2_MAX = 44
};

// Enum FortniteGame.EUseInputWithPartyResult
enum class EUseInputWithPartyResult : uint8 {
	Success = 0,
	LocalPlayerNeedsToAllowCrossplay = 1,
	LocalPlayerRestricted = 2,
	RemotePlayerRestricted = 3,
	UnknownFailure = 4,
	EUseInputWithPartyResult_MAX = 5
};

// Enum FortniteGame.EMatchmakingSourceV2
enum class EMatchmakingSourceV2 : uint8 {
	None = 0,
	AthenaMatchmakingWidget = 1,
	ActivityMatchmakingWidget = 2,
	ReadyUpScreenWidget = 3,
	ForcedIntro = 4,
	KeepPlayingTogetherWidget = 5,
	Unknown = 6,
	EMatchmakingSourceV2_MAX = 7
};

// Enum FortniteGame.EMatchmakingV2State
enum class EMatchmakingV2State : uint8 {
	Begin = 0,
	Idle = 1,
	Completed = 2,
	Failed = 3,
	INVALID = 4,
	RunningMainBranch = 5,
	Main_RunningChecks = 6,
	Main_DADUpdate = 7,
	Main_CheckPlaylistValid = 8,
	Main_ModifyOptions = 9,
	Main_Begin_JoinInProgress = 10,
	Main_JoinInProgress_PartyLeader_Begin = 11,
	Main_JoinInProgress_PartyLeader_Success = 12,
	Main_JoinInProgress_PartyLeader_Failed = 13,
	Main_JoinInProgress_PartyMember = 14,
	Main_Begin_NormalFlow = 15,
	Main_NormalFlow_SetValues = 16,
	Main_NormalFlow_CheckPartyValidity = 17,
	Main_NormalFlow_CheckInputValidity = 18,
	Main_NormalFlow_CheckTournamentValidity = 19,
	Main_NormalFlow_Complete = 20,
	RunningFollowerBranch = 21,
	Follower_CheckIsNotMatchmaking = 22,
	Follower_SettingMemberVariables = 23,
	Follower_ValidatingLeaderMatchmakingInfo = 24,
	Follower_ValidatingRegion = 25,
	Follower_ValidatingHotfixVersion = 26,
	Follower_ValidatingTournamentQualifications = 27,
	Follower_ValidatingPlaylist = 28,
	Follower_RunDADUpdate = 29,
	Follower_AfterDADUpdate_SetValues = 30,
	Follower_AfterDADUpdate_CheckPartyValidity = 31,
	FollowerBranch_Complete = 32,
	RunningEditorBranch = 33,
	Editor_CreateMMSClients = 34,
	EditorBranch_Complete = 35,
	CallingMatchmakingService = 36,
	WaitingForMatchmakingServiceCallback = 37,
	FindingSessionId = 38,
	WaitingForFindSessionIdCallback = 39,
	Fork_AfterFindSession = 40,
	EncryptionKeyForUniqueId = 41,
	RefreshPlatformAuthToken = 42,
	DestroySession = 43,
	DestroyConsoleSession = 44,
	CheckDestruction = 45,
	JoinSession = 46,
	PassedJoinSession = 47,
	PreTravelSetupStartTime = 48,
	ClearJoinSessionDelegate = 49,
	Fork_ServerInitAndContent = 50,
	OnReadyForTravel = 51,
	OnReadyForTravel_V1 = 52,
	OnReadyForTravel_V2 = 53,
	WaitingForReadyToTravelToSession = 54,
	AttemptToTravel = 55,
	EMatchmakingV2State_MAX = 56
};

// Enum FortniteGame.EMatchmakingV2_Temp_PreloadingAthenaForJoinInProgress
enum class EMatchmakingV2_Temp_PreloadingAthenaForJoinInProgress : uint8 {
	Begin = 0,
	Idle = 1,
	Completed = 2,
	Failed = 3,
	INVALID = 4,
	PreloadingAthena = 5,
	BeginningServerTransfer_UnfinishedRefactor = 6,
	EMatchmakingV2_Temp_MAX = 7
};

// Enum FortniteGame.EMatchmakingV2_Temp_JoinInProgressState
enum class EMatchmakingV2_Temp_JoinInProgressState : uint8 {
	Begin = 0,
	Idle = 1,
	Completed = 2,
	Failed = 3,
	INVALID = 4,
	Branch_JoinHost = 5,
	Branch_JoinParty = 6,
	Branch_JoinBroadcaster = 7,
	Branch_JoinPartyMember = 8,
	ConnectToReservationBeacon = 9,
	ConnectToReservationBeaconForPersistentParty = 10,
	CheckConnectToReservationBeaconForPersistentPartyData = 11,
	DelayingCallToJoin = 12,
	CheckNotMatchmaking = 13,
	CallToJoin = 14,
	EMatchmakingV2_Temp_MAX = 15
};

// Enum FortniteGame.EMatchmakingV2Fork_ContentBeacon
enum class EMatchmakingV2Fork_ContentBeacon : uint8 {
	Begin = 0,
	Idle = 1,
	Completed = 2,
	Failed = 3,
	INVALID = 4,
	V2_DisconnectedBegin = 5,
	V2_ReadinessChangedBegin = 6,
	V2_OnContentBeaconErrorFailed = 7,
	V2_OnContentBeaconErrorSuccess = 8,
	V2_OnClientReadinessChangedFailed = 9,
	V2_OnClientReadinessChangedSuccess = 10,
	V2_CancelRequested = 11,
	V1_Begin = 12,
	V1_WaitingForContent = 13,
	V1_Disconnected = 14,
	V1_Failed = 15,
	V1_ReadinessCallback = 16,
	V1_JoinAnyways = 17,
	V1_TravelToSession = 18,
	V1_TravelToSessionLambda = 19,
	V1_TravelToSessionTimeout = 20,
	V1_ReadinessCallbackFailed = 21,
	V1_CancelRequested = 22,
	EMatchmakingV2Fork_MAX = 23
};

// Enum FortniteGame.EMatchmakingV2Fork_ServerInit
enum class EMatchmakingV2Fork_ServerInit : uint8 {
	Begin = 0,
	Idle = 1,
	Completed = 2,
	Failed = 3,
	INVALID = 4,
	ReadyToTravel = 5,
	WaitForInit = 6,
	WaitForSubGameContent = 7,
	WaitForSubGameContent_Callback = 8,
	WaitForSubGameContent_Callback_Ready = 9,
	WaitForSubGameContent_Callback_NotReady = 10,
	WaitBeforeTravel = 11,
	FailedToConnect = 12,
	MissingParty = 13,
	FailedCallback = 14,
	ServerInitStateChange_Callback = 15,
	ServerInitStateChange_Callback_Ready = 16,
	ServerInitStateChange_Callback_NotReady = 17,
	CancelRequested = 18,
	EMatchmakingV2Fork_MAX = 19
};

// Enum FortniteGame.EBadMatchType
enum class EBadMatchType : uint8 {
	None = 0,
	Ping = 1,
	PacketLoss = 2,
	NotMonitored = 3,
	EBadMatchType_MAX = 4
};

// Enum FortniteGame.EMaterialStyleParameterType
enum class EMaterialStyleParameterType : uint8 {
	Scalar = 0,
	Vector = 1,
	Texture = 2,
	EMaterialStyleParameterType_MAX = 3
};

// Enum FortniteGame.EStyleRequestArbitrationPolicy
enum class EStyleRequestArbitrationPolicy : uint8 {
	ReplaceActive = 0,
	QueueBack = 1,
	QueueFront = 2,
	EStyleRequestArbitrationPolicy_MAX = 3
};

// Enum FortniteGame.EStyleRequirementMatchPolicy
enum class EStyleRequirementMatchPolicy : uint8 {
	RequireAll = 0,
	RequireAny = 1,
	EStyleRequirementMatchPolicy_MAX = 2
};

// Enum FortniteGame.ESavePlayerQuestUpdate
enum class ESavePlayerQuestUpdate : uint8 {
	QuestGiven = 0,
	QuestCompleted = 1,
	ESavePlayerQuestUpdate_MAX = 2
};

// Enum FortniteGame.ECharacterEncounterType
enum class ECharacterEncounterType : uint8 {
	Converstation = 0,
	Attack = 1,
	Count = 2,
	ECharacterEncounterType_MAX = 3
};

// Enum FortniteGame.ESocialImportPanelPlatform
enum class ESocialImportPanelPlatform : uint8 {
	Facebook = 0,
	VK = 1,
	Steam = 2,
	Xbox = 3,
	Playstation = 4,
	Switch = 5,
	None = 6,
	ESocialImportPanelPlatform_MAX = 7
};

// Enum FortniteGame.EMcpSubscriptionState
enum class EMcpSubscriptionState : uint8 {
	Inactive = 0,
	Active = 1,
	Canceled = 2,
	PaymentProcessError = 3,
	PlatformAuthError = 4,
	RewardsDelayed = 5,
	Unknown = 6,
	EMcpSubscriptionState_MAX = 7
};

// Enum FortniteGame.EPublishStatus
enum class EPublishStatus : uint8 {
	Banned = 0,
	CannotPublish = 1,
	NeedsCreatorName = 2,
	CanPublishProvisionally = 3,
	CanPublish = 4,
	EPublishStatus_MAX = 5
};

// Enum FortniteGame.ETwitchViewerStatusType
enum class ETwitchViewerStatusType : uint8 {
	TwitchViewerStatus_Unknown = 0,
	TwitchViewerStatus_Nonsubscriber = 1,
	TwitchViewerStatus_Subscriber = 2,
	TwitchViewerStatus_Broadcaster = 3,
	TwitchViewerStatus_Max = 4
};

// Enum FortniteGame.EMegaStormState
enum class EMegaStormState : uint8 {
	GatheringActorList = 0,
	DamagingActors = 1,
	EMegaStormState_MAX = 2
};

// Enum FortniteGame.EDeviceFireVolumeFireOption
enum class EDeviceFireVolumeFireOption : uint8 {
	None = 0,
	UseIslandSettings = 1,
	Yes = 2,
	No = 3,
	EDeviceFireVolumeFireOption_MAX = 4
};

// Enum FortniteGame.EMinigameTeamListType
enum class EMinigameTeamListType : uint8 {
	Blacklist = 0,
	Whitelist = 1,
	EMinigameTeamListType_MAX = 2
};

// Enum FortniteGame.EMinigameWinCondition
enum class EMinigameWinCondition : uint8 {
	MostRoundWins = 0,
	MostScoreWins = 1,
	EMinigameWinCondition_MAX = 2
};

// Enum FortniteGame.EMinigamePlayerPersistence
enum class EMinigamePlayerPersistence : uint8 {
	None = 0,
	PartyLeaderOnly = 1,
	AllPlayers = 2,
	EMinigamePlayerPersistence_MAX = 3
};

// Enum FortniteGame.EFortMinigameExec
enum class EFortMinigameExec : uint8 {
	Yes = 0,
	No = 1,
	EFortMinigameExec_MAX = 2
};

// Enum FortniteGame.EMinigameFullscreenMapWidgetType
enum class EMinigameFullscreenMapWidgetType : uint8 {
	Default_Map = 0,
	Creative_Scoreboard = 1,
	EMinigameFullscreenMapWidgetType_MAX = 2
};

// Enum FortniteGame.EMinigameScoreboardStates
enum class EMinigameScoreboardStates : uint8 {
	RoundEndDisplayWinner = 0,
	GameEndDisplayWinner = 1,
	RoundEndDisplayScoreboard = 2,
	GameEndDisplayScoreboard = 3,
	Max = 4
};

// Enum FortniteGame.EMinigameGameEndCallout
enum class EMinigameGameEndCallout : uint8 {
	WinLose = 0,
	Placement = 1,
	Cooperative = 2,
	EMinigameGameEndCallout_MAX = 3
};

// Enum FortniteGame.EMinigameCaptureObjectiveState
enum class EMinigameCaptureObjectiveState : uint8 {
	NotCaptured = 0,
	Captured = 1,
	EMinigameCaptureObjectiveState_MAX = 2
};

// Enum FortniteGame.EObjectiveType
enum class EObjectiveType : uint8 {
	DestructionObjective = 0,
	CaptureObjective = 1,
	EObjectiveType_MAX = 2
};

// Enum FortniteGame.ETrackedObjectiveQuery
enum class ETrackedObjectiveQuery : uint8 {
	All = 0,
	ExactTeam = 1,
	Friendly = 2,
	Neutral = 3,
	Hostile = 4,
	NotFriendly = 5,
	MAX = 6
};

// Enum FortniteGame.EMinigameScoreType
enum class EMinigameScoreType : uint8 {
	Time = 0,
	PointTotal = 1,
	EMinigameScoreType_MAX = 2
};

// Enum FortniteGame.EFortMinigameStatScope
enum class EFortMinigameStatScope : uint8 {
	Group = 0,
	Team = 1,
	Player = 2,
	EFortMinigameStatScope_MAX = 3
};

// Enum FortniteGame.EFortMinigameStatOperation
enum class EFortMinigameStatOperation : uint8 {
	Equal = 0,
	Less = 1,
	Greater = 2,
	LessOrEqual = 3,
	GreaterOrEqual = 4,
	EFortMinigameStatOperation_MAX = 5
};

// Enum FortniteGame.EFortMinigamePlayerSpawnLocationSetting
enum class EFortMinigamePlayerSpawnLocationSetting : uint8 {
	SpawnPads = 0,
	Device = 1,
	Preplaced = 2,
	Air = 3,
	CurrentLocation = 4,
	EFortMinigamePlayerSpawnLocationSetting_MAX = 5
};

// Enum FortniteGame.EFortMinigamePostGameSpawnLocationSetting
enum class EFortMinigamePostGameSpawnLocationSetting : uint8 {
	IslandStart = 0,
	PreGameLocation = 1,
	EFortMinigamePostGameSpawnLocationSetting_MAX = 2
};

// Enum FortniteGame.EFortMinigameSpawnPadSelection
enum class EFortMinigameSpawnPadSelection : uint8 {
	Random = 0,
	NearTeammates = 1,
	EFortMinigameSpawnPadSelection_MAX = 2
};

// Enum FortniteGame.EFortMinigameTimeAliveTeamTrackingMethod
enum class EFortMinigameTimeAliveTeamTrackingMethod : uint8 {
	Accumulate = 0,
	Max = 1,
	Min = 2
};

// Enum FortniteGame.EFortMinigameClassSlot
enum class EFortMinigameClassSlot : uint8 {
	ZeroIndex = 0,
	None = 255,
	EFortMinigameClassSlot_MAX = 256
};

// Enum FortniteGame.EFortMinigameClassResetType
enum class EFortMinigameClassResetType : uint8 {
	Never = 0,
	RoundEnd = 1,
	GameEnd = 2,
	PlayerDeath = 3,
	EFortMinigameClassResetType_MAX = 4
};

// Enum FortniteGame.EBuildingMode
enum class EBuildingMode : uint8 {
	None = 0,
	BuildingsOnly = 1,
	TrapsOnly = 2,
	All = 3,
	EBuildingMode_MAX = 4
};

// Enum FortniteGame.EMiniMapIconParameterDataType
enum class EMiniMapIconParameterDataType : uint8 {
	None = 0,
	Scalar = 1,
	Vector = 2,
	Texture = 3,
	EMiniMapIconParameterDataType_MAX = 4
};

// Enum FortniteGame.EFortMiniMapHeight
enum class EFortMiniMapHeight : uint8 {
	EFMH_Equal = 0,
	EFMH_Below = 1,
	EFMH_Above = 2,
	EFMH_MAX = 3
};

// Enum FortniteGame.EFortMiniMapContext
enum class EFortMiniMapContext : uint8 {
	EFMC_MiniMap = 0,
	EFMC_FullScreenMap = 1,
	EFMC_MAX = 2
};

// Enum FortniteGame.EFortMinimapLayer
enum class EFortMinimapLayer : uint8 {
	EFML_PrePOIText = 0,
	EFML_PostSquadIcons = 1,
	EFML_MAX = 2
};

// Enum FortniteGame.EFortMiniMapIconRotation
enum class EFortMiniMapIconRotation : uint8 {
	EFMMIR_None = 0,
	EFMMIR_Absolute = 1,
	EFMMIR_Relative = 2,
	EFMMIR_MAX = 3
};

// Enum FortniteGame.EFortMiniMapDrawCategory
enum class EFortMiniMapDrawCategory : uint8 {
	AthenaBackground = 0,
	MapLocation = 1,
	SafeZone = 2,
	BusPath = 3,
	SpecialActorIcon = 4,
	SquadPin = 5,
	MapIndicator = 6,
	MapCursor = 7,
	Elimination = 8,
	MAX = 9
};

// Enum FortniteGame.EFortCheatMissionGenType
enum class EFortCheatMissionGenType : uint8 {
	NewGeneration = 0,
	OldGeneration = 1,
	Max_None = 2,
	EFortCheatMissionGenType_MAX = 3
};

// Enum FortniteGame.EFortOptionGenerationResult
enum class EFortOptionGenerationResult : uint8 {
	NoOptionsGenerated = 0,
	NewOptionsGenerated = 1,
	ExistingOptionsGenerated = 2,
	EFortOptionGenerationResult_MAX = 3
};

// Enum FortniteGame.EMissionReplyTypes
enum class EMissionReplyTypes : uint8 {
	Handled = 0,
	NotHandled = 1,
	EMissionReplyTypes_MAX = 2
};

// Enum FortniteGame.EPollActorsInVolumeTypes
enum class EPollActorsInVolumeTypes : uint8 {
	DesignerPlacedOnly = 0,
	PlayerBuiltOnly = 1,
	All = 2,
	EPollActorsInVolumeTypes_MAX = 3
};

// Enum FortniteGame.ETimerOverrideSetting
enum class ETimerOverrideSetting : uint8 {
	DefaultBehavior = 0,
	ForceShow = 1,
	ForceHide = 2,
	ShowAtEnd = 3,
	ETimerOverrideSetting_MAX = 4
};

// Enum FortniteGame.ESchemaModificationType
enum class ESchemaModificationType : uint8 {
	AddOrModify = 0,
	Remove = 1,
	Count = 2,
	ESchemaModificationType_MAX = 3
};

// Enum FortniteGame.EMontageVisibilityRule
enum class EMontageVisibilityRule : uint8 {
	RequiredItem = 0,
	ForbiddenItem = 1,
	MetaTagQuery = 2,
	EMontageVisibilityRule_MAX = 3
};

// Enum FortniteGame.EFortMtxPlatform
enum class EFortMtxPlatform : uint8 {
	Epic = 0,
	PSN = 1,
	Live = 2,
	Shared = 3,
	EpicPC = 4,
	EpicPCKorea = 5,
	IOSAppStore = 6,
	EpicAndroid = 7,
	Nintendo = 8,
	WeGame = 9,
	Samsung = 10,
	GooglePlay = 11,
	EFortMtxPlatform_MAX = 12
};

// Enum FortniteGame.EFortMusicSectionStopBehavior
enum class EFortMusicSectionStopBehavior : uint8 {
	Crossfade = 0,
	AllowFadeOut = 1,
	EFortMusicSectionStopBehavior_MAX = 2
};

// Enum FortniteGame.EFortMusicSectionType
enum class EFortMusicSectionType : uint8 {
	Intro = 0,
	Loop = 1,
	Outro = 2,
	Max_None = 3,
	EFortMusicSectionType_MAX = 4
};

// Enum FortniteGame.EFortMusicCombatIntensity
enum class EFortMusicCombatIntensity : uint8 {
	Low = 0,
	Medium = 1,
	High = 2,
	VeryHigh = 3,
	Max_None = 4,
	EFortMusicCombatIntensity_MAX = 5
};

// Enum FortniteGame.EMusicFadeStyles
enum class EMusicFadeStyles : uint8 {
	CrossFade = 0,
	FadeOutThenIn = 1,
	Max_None = 2,
	EMusicFadeStyles_MAX = 3
};

// Enum FortniteGame.EMusicChannel
enum class EMusicChannel : uint8 {
	VoiceA = 0,
	VoiceB = 1,
	Max_None = 2,
	EMusicChannel_MAX = 3
};

// Enum FortniteGame.EMutatorListInitState
enum class EMutatorListInitState : uint8 {
	Default = 0,
	Enabled = 1,
	Disabled = 2,
	EMutatorListInitState_MAX = 3
};

// Enum FortniteGame.EMutatorOverrideSource
enum class EMutatorOverrideSource : uint8 {
	Default = 0,
	External = 1,
	EMutatorOverrideSource_MAX = 2
};

// Enum FortniteGame.EVisibilityResponse
enum class EVisibilityResponse : uint8 {
	Hide = 0,
	Show = 1,
	Custom = 2,
	EVisibilityResponse_MAX = 3
};

// Enum FortniteGame.EFortNearbyActorsTypes
enum class EFortNearbyActorsTypes : uint8 {
	None = 0,
	RealPlayers = 1,
	Bots = 2,
	NPCs = 4,
	AIPawns = 8,
	All = 15,
	EFortNearbyActorsTypes_MAX = 16
};

// Enum FortniteGame.EFXType
enum class EFXType : uint8 {
	GenericAnimNotify = 0,
	TrailAnimNotify = 1,
	WeaponImpactEffect = 2,
	WeaponMeleeImpactEffect = 3,
	Contrail = 4,
	Emote = 5,
	Trap = 6,
	Skin = 7,
	Glider = 8,
	Vehicle = 9,
	BackpackBling = 10,
	Water = 11,
	LootChest = 12,
	EnvironmentalAmbient = 13,
	WeaponRangedBeam = 14,
	WeaponBulletShells = 15,
	WeaponMuzzleFlashes = 16,
	PickAxe = 17,
	Curie = 18,
	Projectile = 19,
	EFXType_MAX = 20
};

// Enum FortniteGame.EFortOctopusSimEvent
enum class EFortOctopusSimEvent : uint8 {
	BeginBoostCooldown = 0,
	EFortOctopusSimEvent_MAX = 1
};

// Enum FortniteGame.EOutpostBuildings
enum class EOutpostBuildings : uint8 {
	StormShield = 0,
	HarvestingOptimizer = 1,
	StorageVault = 2,
	POST = 3,
	EOutpostBuildings_MAX = 4
};

// Enum FortniteGame.EServerInitializationState
enum class EServerInitializationState : uint8 {
	UNINITIALIZED = 0,
	STARTING_UP = 1,
	READY_FOR_PLAYERS = 2,
	EServerInitializationState_MAX = 3
};

// Enum FortniteGame.EFortPartyMemberInGameMode
enum class EFortPartyMemberInGameMode : uint8 {
	None = 0,
	InBattleRoyale = 1,
	InCreative = 2,
	InSaveTheWorld = 3,
	EFortPartyMemberInGameMode_MAX = 4
};

// Enum FortniteGame.EFortPartyMemberReadyCheckStatus
enum class EFortPartyMemberReadyCheckStatus : uint8 {
	None = 0,
	InProgress = 1,
	Complete = 2,
	Canceled = 3,
	EFortPartyMemberReadyCheckStatus_MAX = 4
};

// Enum FortniteGame.ESquadChangeType
enum class ESquadChangeType : uint8 {
	JoinSquad = 0,
	BenchSelf = 1,
	UnbenchSelf = 2,
	Swap = 3,
	None = 4,
	ESquadChangeType_MAX = 5
};

// Enum FortniteGame.EGameReadiness
enum class EGameReadiness : uint8 {
	NotReady = 0,
	Ready = 1,
	SittingOut = 2,
	EGameReadiness_MAX = 3
};

// Enum FortniteGame.EPartyMemberVoiceChatStatus
enum class EPartyMemberVoiceChatStatus : uint8 {
	Disabled = 0,
	Enabled = 1,
	PartyVoice = 2,
	GameVoice = 3,
	PlatformVoice = 4,
	EPartyMemberVoiceChatStatus_MAX = 5
};

// Enum FortniteGame.EPartyRiftPortalManagerValidityResult
enum class EPartyRiftPortalManagerValidityResult : uint8 {
	Valid = 0,
	Invalid = 1,
	EPartyRiftPortalManagerValidityResult_MAX = 2
};

// Enum FortniteGame.EConvertedType
enum class EConvertedType : uint8 {
	NPC = 0,
	Creature = 1,
	All = 2,
	Unknown = 3,
	EConvertedType_MAX = 4
};

// Enum FortniteGame.EUpdateCustomDepthOptimDirtyFlags
enum class EUpdateCustomDepthOptimDirtyFlags : uint8 {
	None = 0,
	CharacterParts = 1,
	Weapon = 2,
	PossessedProp = 4,
	EUpdateCustomDepthOptimDirtyFlags_MAX = 5
};

// Enum FortniteGame.EFortPawnComponent_DisguiseRevealReason
enum class EFortPawnComponent_DisguiseRevealReason : uint8 {
	ByDamage = 0,
	ByConversation = 1,
	ByProximity = 2,
	Unknown = 3,
	EFortPawnComponent_MAX = 4
};

// Enum FortniteGame.EFortPawnPushSize
enum class EFortPawnPushSize : uint8 {
	FFPS_Normal = 0,
	FPPS_Player = 1,
	FPPS_Large = 2,
	FPPS_SuperLarge = 3,
	EFortPawnPushSize_MAX = 4
};

// Enum FortniteGame.EFortControlRecoveryBehavior
enum class EFortControlRecoveryBehavior : uint8 {
	DefaultControl = 0,
	LimitedControl = 1,
	ChainControl = 2,
	EFortControlRecoveryBehavior_MAX = 3
};

// Enum FortniteGame.EFortWeaponListRemovalBehavior
enum class EFortWeaponListRemovalBehavior : uint8 {
	DestroyImmediately = 0,
	DeferredLifespan = 1,
	DoNotDestroy = 2,
	EFortWeaponListRemovalBehavior_MAX = 3
};

// Enum FortniteGame.EFortAnnouncerTeamVocalChords
enum class EFortAnnouncerTeamVocalChords : uint8 {
	Team1 = 0,
	Team2 = 1,
	Max_None = 2,
	EFortAnnouncerTeamVocalChords_MAX = 3
};

// Enum FortniteGame.EFortBadMatchTriggerOperation
enum class EFortBadMatchTriggerOperation : uint8 {
	LessThan = 0,
	LessThanOrEqual = 1,
	Equal = 2,
	GreaterThan = 3,
	GreaterThanOrEqual = 4,
	EFortBadMatchTriggerOperation_MAX = 5
};

// Enum FortniteGame.EFortBadMatchTriggerType
enum class EFortBadMatchTriggerType : uint8 {
	Unspecified = 0,
	SmallTeam = 1,
	LargeTeam = 2,
	LetoTeam = 3,
	EFortBadMatchTriggerType_MAX = 4
};

// Enum FortniteGame.EFortReplenishmentType
enum class EFortReplenishmentType : uint8 {
	Restricted = 0,
	ClampMin = 1,
	Add = 2,
	Ability = 3,
	EFortReplenishmentType_MAX = 4
};

// Enum FortniteGame.EFortRewardType
enum class EFortRewardType : uint8 {
	Default = 0,
	Missed = 1,
	Max_None = 2,
	EFortRewardType_MAX = 3
};

// Enum FortniteGame.EFortPhysicsObjectAwakeState
enum class EFortPhysicsObjectAwakeState : uint8 {
	Invalid = 0,
	Awake = 1,
	Asleep = 2,
	EFortPhysicsObjectAwakeState_MAX = 3
};

// Enum FortniteGame.EFortPhysicsObjectImpactDamageType
enum class EFortPhysicsObjectImpactDamageType : uint8 {
	Environment = 0,
	Pawn = 1,
	Vehicle = 2,
	Wildlife = 3,
	EFortPhysicsObjectImpactDamageType_MAX = 4
};

// Enum FortniteGame.EFortPhysicsObjectMovementState
enum class EFortPhysicsObjectMovementState : uint8 {
	None = 0,
	Flying = 1,
	Rolling = 2,
	Sliding = 3,
	Floating = 4,
	EFortPhysicsObjectMovementState_MAX = 5
};

// Enum FortniteGame.EFortPhysicsObjectActivationType
enum class EFortPhysicsObjectActivationType : uint8 {
	Unset = 0,
	Instant = 1,
	Lazy = 2,
	AlwaysInstant = 3,
	EFortPhysicsObjectActivationType_MAX = 4
};

// Enum FortniteGame.EFortPhysicsSimSize
enum class EFortPhysicsSimSize : uint8 {
	Small = 0,
	Average = 1,
	Medium = 2,
	Large = 3,
	Huge = 4,
	Giant = 5,
	Enormous = 6,
	Invalid = 7,
	EFortPhysicsSimSize_MAX = 8
};

// Enum FortniteGame.EFortPhysicsObjectType
enum class EFortPhysicsObjectType : uint8 {
	Invalid = 0,
	StaticObject = 1,
	PhysicsObject = 2,
	Vehicle = 3,
	Pawn = 4,
	Projectile = 5,
	Player = 6,
	EFortPhysicsObjectType_MAX = 7
};

// Enum FortniteGame.EPawnLaunchMinVelocityApply
enum class EPawnLaunchMinVelocityApply : uint8 {
	Add = 0,
	Min = 1,
	EPawnLaunchMinVelocityApply_MAX = 2
};

// Enum FortniteGame.EFortPickupTossState
enum class EFortPickupTossState : uint8 {
	NotTossed = 0,
	InProgress = 1,
	AtRest = 2,
	EFortPickupTossState_MAX = 3
};

// Enum FortniteGame.EManagedPickupBucket
enum class EManagedPickupBucket : uint8 {
	Default = 0,
	Junk = 1,
	Normal = 2,
	Important = 3,
	EManagedPickupBucket_MAX = 4
};

// Enum FortniteGame.EManagedPickupContext
enum class EManagedPickupContext : uint8 {
	Unknown = 0,
	PlayerDropped = 1,
	Overflow = 2,
	Spawned = 3,
	EManagedPickupContext_MAX = 4
};

// Enum FortniteGame.EFortPickupSourceTypeFlag
enum class EFortPickupSourceTypeFlag : uint8 {
	Other = 0,
	Player = 1,
	Destruction = 2,
	Container = 4,
	AI = 8,
	Tossed = 16,
	FloorLoot = 32,
	Fishing = 64,
	EFortPickupSourceTypeFlag_MAX = 65
};

// Enum FortniteGame.EFortPickupSpawnSource
enum class EFortPickupSpawnSource : uint8 {
	Unset = 0,
	PlayerElimination = 1,
	Chest = 2,
	SupplyDrop = 3,
	AmmoBox = 4,
	Drone = 5,
	ItemSpawner = 6,
	BotElimination = 7,
	NPCElimination = 8,
	LootDrop = 9,
	TossedByPlayer = 10,
	EFortPickupSpawnSource_MAX = 11
};

// Enum FortniteGame.EPinModalType
enum class EPinModalType : uint8 {
	AcceptFriendRequest = 0,
	SendFriendRequest = 1,
	MAX = 2
};

// Enum FortniteGame.EPinModalValidityState
enum class EPinModalValidityState : uint8 {
	None = 0,
	Requesting = 1,
	Success = 2,
	Invalid = 3,
	EPinModalValidityState_MAX = 4
};

// Enum FortniteGame.EFortPickerToDisplay
enum class EFortPickerToDisplay : uint8 {
	TrapPicker = 0,
	WeaponPicker = 1,
	SocialPicker = 2,
	ChatPicker = 3,
	NotePicker = 4,
	EmotePicker = 5,
	SquadQuickChatPicker = 6,
	BattleLabDevicePicker = 7,
	MusicSourcePicker = 8,
	NPCCommandPicker = 9,
	EFortPickerToDisplay_MAX = 10
};

// Enum FortniteGame.EQuickbarSlots
enum class EQuickbarSlots : uint8 {
	HarvestingTool = 0,
	Weapon1 = 1,
	Weapon2 = 2,
	Weapon3 = 3,
	Consumable = 4,
	Gadget1 = 5,
	Gadget2 = 6,
	Ability1 = 7,
	Ability2 = 8,
	Ability3 = 9,
	EQuickbarSlots_MAX = 10
};

// Enum FortniteGame.ECreativeQuickbarSlots
enum class ECreativeQuickbarSlots : uint8 {
	Phone = 0,
	ECreativeQuickbarSlots_MAX = 1
};

// Enum FortniteGame.EFortCrucibleWhitelistLevel
enum class EFortCrucibleWhitelistLevel : uint8 {
	None = 0,
	Basic = 1,
	Advanced = 2,
	EFortCrucibleWhitelistLevel_MAX = 3
};

// Enum FortniteGame.EMapZoomingMode
enum class EMapZoomingMode : uint8 {
	None = 0,
	ZoomingIn = 1,
	ZoomingOut = 2,
	EMapZoomingMode_MAX = 3
};

// Enum FortniteGame.EFortIdleCheckResult
enum class EFortIdleCheckResult : uint8 {
	Invalid = 0,
	ActivityDetected = 1,
	Idle = 2,
	IdlePastMaxTime = 3,
	EFortIdleCheckResult_MAX = 4
};

// Enum FortniteGame.ECameraStateRestoreReason
enum class ECameraStateRestoreReason : uint8 {
	Unknown = 0,
	ChangedFollowTarget = 1,
	ChangedCameraType = 2,
	InvokedHotKey = 3,
	Scrubbed = 4,
	Restored = 5,
	SpecialAction = 6,
	MAX = 7
};

// Enum FortniteGame.EHighlightReelTypes
enum class EHighlightReelTypes : uint8 {
	Generic = 0,
	GameSummary = 1,
	ExtendedGameSummary = 2,
	Builder = 3,
	FastMover = 4,
	LongDistance = 5,
	Multikill = 6,
	StormCloud = 7,
	EHighlightReelTypes_MAX = 8
};

// Enum FortniteGame.EFortPlayerWorkOverFramesMode
enum class EFortPlayerWorkOverFramesMode : uint8 {
	NotProcessing = 0,
	DefaultPartsWhileWaiting = 1,
	UpdateCharacterCustomization = 2,
	NumTypes = 3,
	EFortPlayerWorkOverFramesMode_MAX = 4
};

// Enum FortniteGame.EFortPlayerWorkOverFramesStage
enum class EFortPlayerWorkOverFramesStage : uint8 {
	NotProcessing = 0,
	PreloadingParts = 1,
	QueuePostLoad = 2,
	PostLoad = 3,
	InitializeCharacterParts = 4,
	FinishUpdatingParts = 5,
	FinishUpdatingCharacter = 6,
	NumTypes = 7,
	EFortPlayerWorkOverFramesStage_MAX = 8
};

// Enum FortniteGame.EFortPlayerPartState
enum class EFortPlayerPartState : uint8 {
	NeverInitalized = 0,
	AssetsPreloading = 1,
	QueuedForInitialization = 2,
	CurrentlyInitializing = 3,
	InitializationComplete = 4,
	InitializationComplete_EmptyPart = 5,
	InitializationFailed_NoParts = 6,
	NumTypes = 7,
	EFortPlayerPartState_MAX = 8
};

// Enum FortniteGame.EPartsShowingMode
enum class EPartsShowingMode : uint8 {
	Invisible = 0,
	ShowingTemporaryDefaultParts = 1,
	ShowingTemporaryFallbackParts = 2,
	ShowingDefaultParts = 3,
	ShowingFallbackParts = 4,
	ShowingDesiredParts = 5,
	EPartsShowingMode_MAX = 6
};

// Enum FortniteGame.EFortInputDevice
enum class EFortInputDevice : uint8 {
	Mouse = 0,
	Keyboard = 1,
	Gamepad = 2,
	Touch = 3,
	EFortInputDevice_MAX = 4
};

// Enum FortniteGame.EFortInputActionType
enum class EFortInputActionType : uint8 {
	Press = 0,
	Click = 1,
	Hold = 2,
	Release = 3,
	EFortInputActionType_MAX = 4
};

// Enum FortniteGame.EFortMotionYawAxis
enum class EFortMotionYawAxis : uint8 {
	Yaw = 0,
	Roll = 1,
	EFortMotionYawAxis_MAX = 2
};

// Enum FortniteGame.EGyroActiveMode
enum class EGyroActiveMode : uint8 {
	None = 0,
	ScopeOnly = 1,
	ScopeADS = 2,
	ScopeADSHarvesting = 3,
	ScopeADSHarvestingFiring = 4,
	All = 5,
	EGyroActiveMode_MAX = 6
};

// Enum FortniteGame.EGyroActiveBuildMode
enum class EGyroActiveBuildMode : uint8 {
	None = 0,
	Edit = 1,
	All = 2,
	EGyroActiveBuildMode_MAX = 3
};

// Enum FortniteGame.EGyroStickMode
enum class EGyroStickMode : uint8 {
	None = 0,
	Disables = 1,
	Enables = 2,
	EGyroStickMode_MAX = 3
};

// Enum FortniteGame.EGyroTouchMode
enum class EGyroTouchMode : uint8 {
	None = 0,
	Disables = 1,
	Enables = 2,
	EGyroTouchMode_MAX = 3
};

// Enum FortniteGame.EAxisDirection
enum class EAxisDirection : uint8 {
	Disabled = 0,
	Standard = 1,
	Inverted = 2,
	EAxisDirection_MAX = 3
};

// Enum FortniteGame.EGyroSpace
enum class EGyroSpace : uint8 {
	Local = 0,
	Player = 1,
	EGyroSpace_MAX = 2
};

// Enum FortniteGame.EGyroAcceleration
enum class EGyroAcceleration : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Custom = 4,
	Legacy = 5,
	EGyroAcceleration_MAX = 6
};

// Enum FortniteGame.EGyroButtonResponse
enum class EGyroButtonResponse : uint8 {
	NoChange = 0,
	Disable = 1,
	Trackball = 2,
	Invert = 3,
	Enable = 4,
	EGyroButtonResponse_MAX = 5
};

// Enum FortniteGame.ECameraResetAxes
enum class ECameraResetAxes : uint8 {
	Pitch = 0,
	Yaw = 1,
	Both = 2,
	ECameraResetAxes_MAX = 3
};

// Enum FortniteGame.EBodyPartVisibilityGrouping
enum class EBodyPartVisibilityGrouping : uint8 {
	AllParts = 0,
	AllButHead = 1,
	OnlyBackBling = 2,
	BackBlingAndCharm = 3,
	OnlyBody = 4,
	OnlyHead = 5,
	OnlyTail = 6,
	EBodyPartVisibilityGrouping_MAX = 7
};

// Enum FortniteGame.EFortPartVisibility
enum class EFortPartVisibility : uint8 {
	Visible = 0,
	Hidden = 1,
	HiddenCastShadow = 2,
	EFortPartVisibility_MAX = 3
};

// Enum FortniteGame.EItemInteractionType
enum class EItemInteractionType : uint8 {
	Search = 0,
	LockOnSearch = 1,
	None = 2,
	EItemInteractionType_MAX = 3
};

// Enum FortniteGame.EItemInteractionStatus
enum class EItemInteractionStatus : uint8 {
	Interrupted = 0,
	Completed = 1,
	TimedOut = 2,
	EItemInteractionStatus_MAX = 3
};

// Enum FortniteGame.EBackpackType
enum class EBackpackType : uint8 {
	Jetpack = 0,
	Medic = 1,
	StormTracker = 2,
	Glider = 3,
	EBackpackType_MAX = 4
};

// Enum FortniteGame.EFortPawnState
enum class EFortPawnState : uint8 {
	Default = 0,
	InCombat = 1,
	DBNO = 2,
	IsReviving = 4,
	BeingRevived = 8,
	Dead = 16,
	EFortPawnState_MAX = 17
};

// Enum FortniteGame.EKeepPlayingTogetherAnalyticEventPhase
enum class EKeepPlayingTogetherAnalyticEventPhase : uint8 {
	PrePostGamePhase = 0,
	Countdown = 1,
	TimedOut = 2,
	AllSquadMembersVoted = 3,
	EKeepPlayingTogetherAnalyticEventPhase_MAX = 4
};

// Enum FortniteGame.ECustomFeedFilterParticipantNames
enum class ECustomFeedFilterParticipantNames : uint8 {
	NoFiltering = 0,
	AllPlayers = 1,
	ECustomFeedFilterParticipantNames_MAX = 2
};

// Enum FortniteGame.EVehicleTrickAxis
enum class EVehicleTrickAxis : uint8 {
	X = 0,
	XNeg = 1,
	Y = 2,
	YNeg = 3,
	Z = 4,
	ZNeg = 5,
	Count = 6,
	EVehicleTrickAxis_MAX = 7
};

// Enum FortniteGame.EVehicleTrickType
enum class EVehicleTrickType : uint8 {
	None = 0,
	RollIncrement = 1,
	ReverseRollIncrement = 2,
	YawIncrement = 3,
	ReverseYawIncrement = 4,
	PitchIncrement = 5,
	ReversePitchIncrement = 6,
	HeightIncrement = 7,
	DistanceIncrement = 8,
	AirTimeIncrement = 9,
	ShoppingCart_Flying = 10,
	ShoppingCart_Stooping = 11,
	StartedLanding = 12,
	FailedLanding = 13,
	Cancelled = 14,
	StuckLanding = 15,
	Count = 16,
	EVehicleTrickType_MAX = 17
};

// Enum FortniteGame.EDBNOType
enum class EDBNOType : uint8 {
	On = 0,
	Off = 1,
	NotWhenRespawning = 2,
	EDBNOType_MAX = 3
};

// Enum FortniteGame.EFortGameType
enum class EFortGameType : uint8 {
	BR = 0,
	ZeroBuild = 1,
	Creative = 2,
	CreativeLTM = 3,
	Playground = 4,
	STW = 5,
	BRArena = 6,
	BRLTM = 7,
	Social = 8,
	MAX = 9
};

// Enum FortniteGame.ECustomGameVoiceChannel
enum class ECustomGameVoiceChannel : uint8 {
	Squad = 0,
	FullTeam = 1,
	ECustomGameVoiceChannel_MAX = 2
};

// Enum FortniteGame.EAthenaRespawnType
enum class EAthenaRespawnType : uint8 {
	None = 0,
	InfiniteRespawn = 1,
	InfiniteRespawnExceptStorm = 2,
	EAthenaRespawnType_MAX = 3
};

// Enum FortniteGame.EAthenaRespawnLocation
enum class EAthenaRespawnLocation : uint8 {
	LastDeath = 0,
	CreativePlayerStart = 1,
	EAthenaRespawnLocation_MAX = 2
};

// Enum FortniteGame.EAthenaWinCondition
enum class EAthenaWinCondition : uint8 {
	LastManStanding = 0,
	LastManStandingIncludingAllies = 1,
	TimedTeamFinalFight = 2,
	FirstToGoalScore = 3,
	TimedLastMenStanding = 4,
	MutatorControlled = 5,
	MutatorControlledGoalScore = 6,
	MutatorControlledChinaSupported = 7,
	EAthenaWinCondition_MAX = 8
};

// Enum FortniteGame.ERewardTimePlayedType
enum class ERewardTimePlayedType : uint8 {
	Default = 0,
	NoReward = 1,
	FlatValue = 2,
	ERewardTimePlayedType_MAX = 3
};

// Enum FortniteGame.ERewardPlacementBonusType
enum class ERewardPlacementBonusType : uint8 {
	Solo = 0,
	Duo = 1,
	Squad = 2,
	LargeTeam = 3,
	None = 4,
	TwoTeam = 5,
	MediumTeam = 6,
	QuickSolo = 7,
	QuickDuo = 8,
	QuickSquad = 9,
	QuickLargeTeam = 10,
	QuickTwoTeam = 11,
	QuickMediumTeam = 12,
	SinglePlacement = 13,
	ERewardPlacementBonusType_MAX = 14
};

// Enum FortniteGame.EWeaponSelectionPreservationType
enum class EWeaponSelectionPreservationType : uint8 {
	KeepSelectionWhenRespawning = 0,
	NeverKeepSelection = 1,
	EWeaponSelectionPreservationType_MAX = 2
};

// Enum FortniteGame.EPlaylistAdvertisementType
enum class EPlaylistAdvertisementType : uint8 {
	None = 0,
	New = 1,
	Updated = 2,
	EPlaylistAdvertisementType_MAX = 3
};

// Enum FortniteGame.EPlaylistVisibilityState
enum class EPlaylistVisibilityState : uint8 {
	Enabled = 1,
	Disabled = 2,
	EnabledButInvisible = 3,
	Hidden = 4,
	EPlaylistVisibilityState_MAX = 5
};

// Enum FortniteGame.EPlaysetOffsetType
enum class EPlaysetOffsetType : uint8 {
	CustomOffsetFromCorner = 0,
	Center = 1,
	EPlaysetOffsetType_MAX = 2
};

// Enum FortniteGame.EPlaysetCategory
enum class EPlaysetCategory : uint8 {
	Prefab = 0,
	Gallery = 1,
	Device = 2,
	EPlaysetCategory_MAX = 3
};

// Enum FortniteGame.EFortPlayspaceUserAcceptanceType
enum class EFortPlayspaceUserAcceptanceType : uint8 {
	CustomLogic = 0,
	Matchmaking = 1,
	VolumeBased = 2,
	EFortPlayspaceUserAcceptanceType_MAX = 3
};

// Enum FortniteGame.EFortPlayspaceMatchmakingRules
enum class EFortPlayspaceMatchmakingRules : uint8 {
	AllPlaylists = 0,
	SpecificPlaylists = 1,
	EFortPlayspaceMatchmakingRules_MAX = 2
};

// Enum FortniteGame.EPortalLinkCodeLockMode
enum class EPortalLinkCodeLockMode : uint8 {
	NeverLocked = 0,
	WindowLocked = 1,
	AlwaysLocked = 2,
	EPortalLinkCodeLockMode_MAX = 3
};

// Enum FortniteGame.EFortPreferredItemSlotItemType
enum class EFortPreferredItemSlotItemType : uint8 {
	Unassigned = 0,
	AssaultRifle = 1,
	Shotgun = 2,
	SMG = 3,
	Pistol = 4,
	SniperAndBow = 5,
	Launcher = 6,
	Utility = 7,
	Consumable = 8,
	Num = 9,
	EFortPreferredItemSlotItemType_MAX = 10
};

// Enum FortniteGame.EProfileGoState
enum class EProfileGoState : uint8 {
	None = 0,
	SettlingLocation = 1,
	RunningCommands = 2,
	CompletedScenario = 3,
	Summary = 4,
	Completed = 5,
	EProfileGoState_MAX = 6
};

// Enum FortniteGame.EProjectileWaterHitBehavior
enum class EProjectileWaterHitBehavior : uint8 {
	Overlap = 0,
	StopIfStopSimulatingOnHit = 1,
	StopOnOverlap = 2,
	EProjectileWaterHitBehavior_MAX = 3
};

// Enum FortniteGame.EFortIdleDetectionState
enum class EFortIdleDetectionState : uint8 {
	Disabled = 0,
	Default = 1,
	Suspicious = 2,
	Problematic = 3,
	Inactive = 4,
	EFortIdleDetectionState_MAX = 5
};

// Enum FortniteGame.EQuestEditorGenerateBackendNameReason
enum class EQuestEditorGenerateBackendNameReason : uint8 {
	NoAction = 0,
	Rebuild = 1,
	DuplicateQuest = 2,
	EQuestEditorGenerateBackendNameReason_MAX = 3
};

// Enum FortniteGame.EFortQuestRewardType
enum class EFortQuestRewardType : uint8 {
	BasicRewards = 0,
	BasicPlusSingleChoice = 1,
	EFortQuestRewardType_MAX = 2
};

// Enum FortniteGame.EObjectiveStatusUpdateType
enum class EObjectiveStatusUpdateType : uint8 {
	Always = 0,
	OnPercent = 1,
	OnComplete = 2,
	Never = 3,
	EObjectiveStatusUpdateType_MAX = 4
};

// Enum FortniteGame.EObjectiveConversationTriggerType
enum class EObjectiveConversationTriggerType : uint8 {
	StatEquals = 0,
	StatIncreasedby = 1,
	StatLessThan = 2,
	Max = 3
};

// Enum FortniteGame.EFortQuestSubtype
enum class EFortQuestSubtype : uint8 {
	None = 0,
	WeeklyChallenge = 1,
	PunchCard = 2,
	QuickChallenge = 3,
	Milestone = 4,
	MilestoneCapper = 5,
	UrgentQuest = 6,
	Autofill = 7,
	Discovery = 8,
	EFortQuestSubtype_MAX = 9
};

// Enum FortniteGame.EFortQuestMapNodeType
enum class EFortQuestMapNodeType : uint8 {
	MandatoryQuest = 0,
	SideQuest = 1,
	EFortQuestMapNodeType_MAX = 2
};

// Enum FortniteGame.EFortQuestMapNodeLabelPosition
enum class EFortQuestMapNodeLabelPosition : uint8 {
	Top = 0,
	Bottom = 1,
	EFortQuestMapNodeLabelPosition_MAX = 2
};

// Enum FortniteGame.ECosmeticType
enum class ECosmeticType : uint8 {
	Image = 0,
	Widget = 1,
	ECosmeticType_MAX = 2
};

// Enum FortniteGame.EInlineObjectiveStatTagCheckEntryType
enum class EInlineObjectiveStatTagCheckEntryType : uint8 {
	Target = 0,
	Source = 1,
	Context = 2,
	EInlineObjectiveStatTagCheckEntryType_MAX = 3
};

// Enum FortniteGame.EFortXPPropagationRule
enum class EFortXPPropagationRule : uint8 {
	Self = 0,
	Party = 1,
	Squad = 2,
	EFortXPPropagationRule_MAX = 3
};

// Enum FortniteGame.EFortQuestObjectiveItemEvent
enum class EFortQuestObjectiveItemEvent : uint8 {
	Craft = 0,
	Collect = 1,
	Acquire = 2,
	Consume = 3,
	OpenCardPack = 4,
	PurchaseCardPack = 5,
	Convert = 6,
	Upgrade = 7,
	UpgradeRarity = 8,
	QuestComplete = 9,
	AssignWorker = 10,
	LevelUpCollectionBook = 11,
	LevelUpAthenaSeason = 12,
	LevelUpBattlePass = 13,
	GainAthenaSeasonXp = 14,
	HasItem = 15,
	HasAccumulatedItem = 16,
	SlotInCollection = 17,
	AlterationRespec = 18,
	AlterationUpgrade = 19,
	HasCompletedQuest = 20,
	HasAssignedWorker = 21,
	HasUpgraded = 22,
	HasConverted = 23,
	HasUpgradedRarity = 24,
	HasLeveledUpCollectionBook = 25,
	SlotHeroInLoadout = 26,
	HasLeveledUpAthenaSeason = 27,
	HasLeveledUpBattlePass = 28,
	HasGainedAthenaSeasonXp = 29,
	MinigameTime = 30,
	Max_None = 31,
	EFortQuestObjectiveItemEvent_MAX = 32
};

// Enum FortniteGame.EFortQuestState
enum class EFortQuestState : uint8 {
	Inactive = 0,
	Active = 1,
	Completed = 2,
	Claimed = 3,
	EFortQuestState_MAX = 4
};

// Enum FortniteGame.EFortChallengeBundleInfoLockedReasonCode
enum class EFortChallengeBundleInfoLockedReasonCode : uint8 {
	Unlocked = 0,
	NoKnownUnlockMethod = 1,
	PurchaseTheBattlePass = 2,
	ReachSpecificTier = 3,
	TimeLeftBeforeUnlock = 4,
	EFortChallengeBundleInfoLockedReasonCode_MAX = 5
};

// Enum FortniteGame.ERegisteredPlayerUnregistrationStatus
enum class ERegisteredPlayerUnregistrationStatus : uint8 {
	Registered = 0,
	UnregistrationStarting = 1,
	UnregistrationWaitingForInitialLock = 2,
	UnregistrationWaitingForScoreSave = 3,
	UnregistrationWaitingForFinalSave = 4,
	UnregistrationWaitingForProfileUnlock = 5,
	UnregistrationComplete = 6,
	ERegisteredPlayerUnregistrationStatus_MAX = 7
};

// Enum FortniteGame.EJoinServerState
enum class EJoinServerState : uint8 {
	Inactive = 0,
	Rejoin = 1,
	Tutorial = 2,
	Abandon = 3,
	EJoinServerState_MAX = 4
};

// Enum FortniteGame.EHighlightFeatures
enum class EHighlightFeatures : uint8 {
	INVALID = 0,
	FollowingPlayerKill = 1,
	FollowingPlayerDeath = 2,
	InterestingDeathCause = 3,
	BusyBuilder = 4,
	FastMover = 5,
	LongDistanceKill = 6,
	Multikill = 7,
	StormCloudAction = 8,
	WinningMoment = 9,
	PlacementScore = 10,
	FollowingPlayerKillDBNO = 11,
	FollowingPlayerDBNOFinished = 12,
	MaxLongKillDistance = 13,
	VehicleMultikill = 14,
	VehiclePlayerLaunchDistance = 15,
	VehicleKills = 16,
	MaxMidFallKillTime = 17,
	MaxMidFallNoScopeKillTime = 18,
	MaxMidFallKillSpeed = 19,
	MaxMidFallNoScopeSpeed = 20,
	FallingElimination = 21,
	VehicleUsage = 22,
	COUNT = 23,
	EHighlightFeatures_MAX = 24
};

// Enum FortniteGame.EHighlightSignificances
enum class EHighlightSignificances : uint8 {
	NotSignificant = 0,
	SomewhatSignificant = 1,
	Significant = 21,
	VerySignificant = 31,
	Critical = 41,
	EHighlightSignificances_MAX = 42
};

// Enum FortniteGame.EDroneFollowMode
enum class EDroneFollowMode : uint8 {
	None = 0,
	ForceFacingLocation = 1,
	ForceFacingFollowedPlayer = 2,
	TetherToFollowedPlayer = 3,
	MAX = 4
};

// Enum FortniteGame.EEventMatchScreen
enum class EEventMatchScreen : uint8 {
	None = 0,
	ActivePlayerGrid = 1,
	EliminatedPlayerGrid = 2,
	MatchStatus = 3,
	Scoreboard = 4,
	EEventMatchScreen_MAX = 5
};

// Enum FortniteGame.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8 {
	NotRouted = 0,
	RelevantAllConnections = 1,
	RelevantAllInsideFortVolume = 2,
	Custom = 3,
	Spatialize_Static = 4,
	Spatialize_Dynamic = 5,
	Spatialize_Dormancy = 6,
	Instance_Dynamic = 7,
	EClassRepNodeMapping_MAX = 8
};

// Enum FortniteGame.EFortDynamicNodeType
enum class EFortDynamicNodeType : uint8 {
	AI = 0,
	PhysicsObject = 1,
	Vehicle = 2,
	NumTypes = 3,
	EFortDynamicNodeType_MAX = 4
};

// Enum FortniteGame.ENewsExternalURLMode
enum class ENewsExternalURLMode : uint8 {
	PatchNotes = 0,
	UpdateNotes = 1,
	MoreInformation = 2,
	ENewsExternalURLMode_MAX = 3
};

// Enum FortniteGame.EFortRuntimeOptionTabState
enum class EFortRuntimeOptionTabState : uint8 {
	Default = 0,
	Disabled = 1,
	Hidden = 2,
	EFortRuntimeOptionTabState_MAX = 3
};

// Enum FortniteGame.EFortRuntimeOptionTabStateTarget
enum class EFortRuntimeOptionTabStateTarget : uint8 {
	All = 0,
	Primary = 1,
	Secondary = 2,
	EFortRuntimeOptionTabStateTarget_MAX = 3
};

// Enum FortniteGame.EFortItemShopSection
enum class EFortItemShopSection : uint8 {
	RMTItemOffer = 0,
	Featured = 1,
	Daily = 2,
	SpecialFeatured = 3,
	SpecialDaily = 4,
	Standalone = 5,
	CommunityChoice = 6,
	MegaBundle = 7,
	BattlePass = 8,
	MAX_None = 9,
	EFortItemShopSection_MAX = 10
};

// Enum FortniteGame.ECrucibleWhitelistOverride
enum class ECrucibleWhitelistOverride : uint8 {
	DoNothing = 0,
	ForceOn = 1,
	ForceOff = 2,
	ECrucibleWhitelistOverride_MAX = 3
};

// Enum FortniteGame.EFortSafeZoneState
enum class EFortSafeZoneState : uint8 {
	None = 0,
	Starting = 1,
	Holding = 2,
	Shrinking = 3,
	EFortSafeZoneState_MAX = 4
};

// Enum FortniteGame.EFortUIScoreType
enum class EFortUIScoreType : uint8 {
	Combat = 0,
	Building = 1,
	Utility = 2,
	Badges = 3,
	Bonus = 4,
	Total = 5,
	Max_None = 6,
	EFortUIScoreType_MAX = 7
};

// Enum FortniteGame.EFortScriptedActionSource
enum class EFortScriptedActionSource : uint8 {
	Quest = 0,
	Token = 1,
	Manual = 2,
	Max_None = 3,
	EFortScriptedActionSource_MAX = 4
};

// Enum FortniteGame.EFortScriptedActionEnvironment
enum class EFortScriptedActionEnvironment : uint8 {
	FrontEnd = 0,
	GameServer = 1,
	GameClient = 2,
	Max_None = 3,
	EFortScriptedActionEnvironment_MAX = 4
};

// Enum FortniteGame.EServerManifestCommandType
enum class EServerManifestCommandType : uint8 {
	Move = 0,
	Copy = 1,
	Unknown = 2,
	EServerManifestCommandType_MAX = 3
};

// Enum FortniteGame.EServerManifestOutputFormat
enum class EServerManifestOutputFormat : uint8 {
	FlatFile = 0,
	Json = 1,
	HTTP = 2,
	EServerManifestOutputFormat_MAX = 3
};

// Enum FortniteGame.EFortSessionHelperJoinState
enum class EFortSessionHelperJoinState : uint8 {
	NotJoining = 0,
	RequestingReservation = 1,
	FailedReservation = 2,
	WaitingOnGame = 3,
	AttemptingJoin = 4,
	JoiningSession = 5,
	FailedJoin = 6,
	CanceledJoin = 7,
	EFortSessionHelperJoinState_MAX = 8
};

// Enum FortniteGame.ESkeletalAudioBoneEvent
enum class ESkeletalAudioBoneEvent : uint8 {
	None = 0,
	SlowThresholdStart = 1,
	SlowThresholdStop = 2,
	MediumThreshold = 3,
	FastThreshold = 4,
	ESkeletalAudioBoneEvent_MAX = 5
};

// Enum FortniteGame.ESkeletalAudioBoneSpace
enum class ESkeletalAudioBoneSpace : uint8 {
	Relative = 0,
	World = 1,
	ESkeletalAudioBoneSpace_MAX = 2
};

// Enum FortniteGame.ESkeletalAudioBoneVelocityType
enum class ESkeletalAudioBoneVelocityType : uint8 {
	Linear = 0,
	Rotational = 1,
	Custom = 2,
	ESkeletalAudioBoneVelocityType_MAX = 3
};

// Enum FortniteGame.ESkyTubeMovementDirection
enum class ESkyTubeMovementDirection : uint8 {
	BothWays = 0,
	Forward = 1,
	Reverse = 2,
	ESkyTubeMovementDirection_MAX = 3
};

// Enum FortniteGame.EFortSnapOnSurfaceBehavior
enum class EFortSnapOnSurfaceBehavior : uint8 {
	None = 0,
	Landscape = 1,
	Navmesh = 2,
	Trace = 3,
	EFortSnapOnSurfaceBehavior_MAX = 4
};

// Enum FortniteGame.EFortPowerRatingComparison
enum class EFortPowerRatingComparison : uint8 {
	InRange = 0,
	OverLevel = 1,
	UnderLevel = 2,
	Unknown = 3,
	EFortPowerRatingComparison_MAX = 4
};

// Enum FortniteGame.ESendFriendInviteFailureReason
enum class ESendFriendInviteFailureReason : uint8 {
	NotFound = 0,
	AlreadyFriends = 1,
	InvitePending = 2,
	AddingSelfFail = 3,
	AddingBlockedFail = 4,
	AutoDeclined = 5,
	BlockedByTarget = 6,
	InviteeInboxFull = 7,
	SelfOutboxFull = 8,
	MissingPin = 9,
	InvalidPin = 10,
	PinAttemptsExceeded = 11,
	UnknownError = 12,
	ESendFriendInviteFailureReason_MAX = 13
};

// Enum FortniteGame.EAcceptFriendInviteFailureReason
enum class EAcceptFriendInviteFailureReason : uint8 {
	InviterTooManyFriends = 0,
	SelfTooManyFriends = 1,
	MissingPin = 2,
	InvalidPin = 3,
	PinAttemptsExceeded = 4,
	UnknownError = 5,
	EAcceptFriendInviteFailureReason_MAX = 6
};

// Enum FortniteGame.EFortSocialFriendRequestMethod
enum class EFortSocialFriendRequestMethod : uint8 {
	LobbySuggestion = 0,
	LobbyPlayerPanel = 1,
	MassImportPlatformFriends = 2,
	AutoImportPlatformFriends = 3,
	PartyContextRewriteHelper = 4,
	SocialInteraction_AddFriend = 5,
	SocialInteraction_AddPlatformFriend = 6,
	EFortSocialFriendRequestMethod_MAX = 7
};

// Enum FortniteGame.ESocialTagsChangeReason
enum class ESocialTagsChangeReason : uint8 {
	Service = 0,
	Editor = 1,
	ESocialTagsChangeReason_MAX = 2
};

// Enum FortniteGame.EFortSoundIndicatorTypes
enum class EFortSoundIndicatorTypes : uint8 {
	Generic = 0,
	FootStep = 1,
	Gunshot = 2,
	Chest = 3,
	Glider = 4,
	Vehicle = 5,
	Infected = 6,
	Healing = 7,
	COUNT = 8,
	EFortSoundIndicatorTypes_MAX = 9
};

// Enum FortniteGame.EFortSpawnActorTime
enum class EFortSpawnActorTime : uint8 {
	PostPlaylistLoad = 0,
	StartOfStormHoldTime = 1,
	EFortSpawnActorTime_MAX = 2
};

// Enum FortniteGame.ESplineWaterAudioWindingOrder
enum class ESplineWaterAudioWindingOrder : uint8 {
	Clockwise = 0,
	Counterclockwise = 1,
	ESplineWaterAudioWindingOrder_MAX = 2
};

// Enum FortniteGame.ESplineWaterAudioFacingDirection
enum class ESplineWaterAudioFacingDirection : uint8 {
	None = 0,
	Inwards = 1,
	Outwards = 2,
	ESplineWaterAudioFacingDirection_MAX = 3
};

// Enum FortniteGame.EFortEventRepeat
enum class EFortEventRepeat : uint8 {
	EFER_Inactive = 0,
	EFER_Always = 1,
	EFER_OncePerPlayer = 2,
	EFER_OncePerCampaign = 3,
	EFER_OncePerMap = 4,
	EFER_MAX = 5
};

// Enum FortniteGame.EFortCompare
enum class EFortCompare : uint8 {
	EFC_LessThan = 0,
	EFC_LessThanOrEqual = 1,
	EFC_GreaterThan = 2,
	EFC_GreaterThanOrEqual = 3,
	EFC_Equals = 4,
	EFC_MAX = 5
};

// Enum FortniteGame.EFortEventConditionType
enum class EFortEventConditionType : uint8 {
	EFEC_StatCompare = 0,
	EFEC_MAX = 1
};

// Enum FortniteGame.EFortStatType
enum class EFortStatType : uint8 {
	Fortitude = 0,
	Offense = 1,
	Resistance = 2,
	Technology = 3,
	Fortitude_Team = 4,
	Offense_Team = 5,
	Resistance_Team = 6,
	Technology_Team = 7,
	Invalid = 8,
	EFortStatType_MAX = 9
};

// Enum FortniteGame.UCPTypes
enum class UCPTypes : uint8 {
	UCPAudio = 0,
	UCPVideo = 1,
	UCPBoth = 2,
	UCPNone = 3,
	UCPTypes_MAX = 4
};

// Enum FortniteGame.ESupervisedSettingRestrictionReason
enum class ESupervisedSettingRestrictionReason : uint8 {
	ParentalLimit = 0,
	EnforcedLimit = 1,
	None = 2,
	ESupervisedSettingRestrictionReason_MAX = 3
};

// Enum FortniteGame.ESupplyDropSpawnType
enum class ESupplyDropSpawnType : uint8 {
	SafeZoneDriven = 0,
	ItemDeliveryManagement = 1,
	MutatorManaged = 2,
	ESupplyDropSpawnType_MAX = 3
};

// Enum FortniteGame.ESupplyDropItemTrackType
enum class ESupplyDropItemTrackType : uint8 {
	SpecialActors = 0,
	ESupplyDropItemTrackType_MAX = 1
};

// Enum FortniteGame.EFortSwimmingAudioType
enum class EFortSwimmingAudioType : uint8 {
	Normal = 0,
	Sprint = 1,
	SprintStart = 2,
	PickaxeSwing = 3,
	NormalDBNO = 4,
	SprintBoostStart = 5,
	SwimStart = 6,
	SwimEnd = 7,
	Max_None = 8,
	EFortSwimmingAudioType_MAX = 9
};

// Enum FortniteGame.EFortAutoTestState
enum class EFortAutoTestState : uint8 {
	InitialLoad = 0,
	Login = 1,
	FrontendLoad = 2,
	FrontendPvELoad = 3,
	FrontendPvETest = 4,
	PvEMatchmaking = 5,
	ZoneLoad = 6,
	ZoneTest = 7,
	Finished = 8,
	MAX = 9
};

// Enum FortniteGame.EReplaySmokeTestStep
enum class EReplaySmokeTestStep : uint8 {
	Setup = 0,
	TogglePause = 1,
	StepForward = 2,
	StepBackward = 3,
	StepToEnd = 4,
	StepToBeginning = 5,
	SpeedUpPlayback = 6,
	SlowDownPlayback = 7,
	ToggleHideTimeline = 8,
	IterateCameraModes = 9,
	TogglePlayerOutlines = 10,
	ToggleNamePlates = 11,
	ToggleReplayRegion = 12,
	ZoomIn = 13,
	ZoomOut = 14,
	ToggleAutoFollowThirdPerson = 15,
	IncreaseExposure = 16,
	DecreaseExposure = 17,
	SetAutoExposure = 18,
	IncreaseAperture = 19,
	DecreaseAperture = 20,
	IncreaseFocalLength = 21,
	DecreaseFocalLength = 22,
	IncreaseFocusDistance = 23,
	DecreaseFocusDistance = 24,
	SetAutoFocus = 25,
	ToggleDamageEffects = 26,
	ToggleHideUI = 27,
	ToggleMap = 28,
	Reset = 29,
	MAX = 30
};

// Enum FortniteGame.EFortTheaterMapTileType
enum class EFortTheaterMapTileType : uint8 {
	Normal = 0,
	CriticalMission = 1,
	AlwaysActive = 2,
	Outpost = 3,
	NonMission = 4,
	PvPFOB = 5,
	EFortTheaterMapTileType_MAX = 6
};

// Enum FortniteGame.EFortMissionQuestValidityResult
enum class EFortMissionQuestValidityResult : uint8 {
	Invalid = 0,
	InvalidNotPlayable = 1,
	ValidLinked = 2,
	ValidObjectiveCondition = 3,
	ValidFallback = 4,
	EFortMissionQuestValidityResult_MAX = 5
};

// Enum FortniteGame.EFortMapNavigationDirection
enum class EFortMapNavigationDirection : uint8 {
	North = 0,
	NorthEast = 1,
	East = 2,
	SouthEast = 3,
	South = 4,
	SouthWest = 5,
	West = 6,
	NorthWest = 7,
	Invalid = 8,
	EFortMapNavigationDirection_MAX = 9
};

// Enum FortniteGame.EThresholdRequirement
enum class EThresholdRequirement : uint8 {
	LessThan = 0,
	LessThanOrEqual = 1,
	Equal = 2,
	GreaterThan = 3,
	GreaterThanOrEqual = 4,
	EThresholdRequirement_MAX = 5
};

// Enum FortniteGame.ECollectionSelectionMethod
enum class ECollectionSelectionMethod : uint8 {
	TierAsIndex = 0,
	TierAsIndexOverflowToLastValid = 1,
	Modulo = 2,
	Random = 3,
	None = 4,
	ECollectionSelectionMethod_MAX = 5
};

// Enum FortniteGame.EFortTODMPostProcess
enum class EFortTODMPostProcess : uint8 {
	Morning = 0,
	Day = 1,
	Evening = 2,
	Night = 3,
	Classic = 4,
	NumPostprocess = 5,
	EFortTODMPostProcess_MAX = 6
};

// Enum FortniteGame.EWidgetInterfaceTimerStatus
enum class EWidgetInterfaceTimerStatus : uint8 {
	None = 0,
	Active = 1,
	Paused = 2,
	Inactive = 3,
	EWidgetInterfaceTimerStatus_MAX = 4
};

// Enum FortniteGame.EFortTipDisplayPlatformGroup
enum class EFortTipDisplayPlatformGroup : uint8 {
	None = 0,
	Desktop = 1,
	Console = 2,
	Switch = 4,
	Mobile = 8,
	EFortTipDisplayPlatformGroup_MAX = 9
};

// Enum FortniteGame.EScoreMatchOperator
enum class EScoreMatchOperator : uint8 {
	Invalid = 0,
	LessThan = 1,
	LessThanOrEqual = 2,
	Equal = 3,
	GreaterThan = 4,
	GreaterThanOrEqual = 5,
	EScoreMatchOperator_MAX = 6
};

// Enum FortniteGame.ETournamentDisplayType
enum class ETournamentDisplayType : uint8 {
	Default = 0,
	Creative = 1,
	ETournamentDisplayType_MAX = 2
};

// Enum FortniteGame.EPayoutRewardType
enum class EPayoutRewardType : uint8 {
	Invalid = 0,
	Commerce = 1,
	GameRelated = 2,
	Token = 3,
	Score = 4,
	EPayoutRewardType_MAX = 5
};

// Enum FortniteGame.EPayoutScoringType
enum class EPayoutScoringType : uint8 {
	Invalid = 0,
	Points = 1,
	Ranking = 2,
	Percentile = 3,
	Persistent = 4,
	EPayoutScoringType_MAX = 5
};

// Enum FortniteGame.FTowhookExtensionState
enum class FTowhookExtensionState : uint8 {
	Hold = 0,
	Extend = 1,
	Contract = 2,
	FTowhookExtensionState_MAX = 3
};

// Enum FortniteGame.EMessageFeedRelationshipFilter
enum class EMessageFeedRelationshipFilter : uint8 {
	Anyone = 0,
	SquadAndTeamMembers = 1,
	SquadMembersOnly = 2,
	SelfOnly = 3,
	EMessageFeedRelationshipFilter_MAX = 4
};

// Enum FortniteGame.EMessageFeedSubject
enum class EMessageFeedSubject : uint8 {
	ToyOwner = 0,
	OtherPlayerInteractingWithToy = 1,
	EMessageFeedSubject_MAX = 2
};

// Enum FortniteGame.ETrackDirection
enum class ETrackDirection : uint8 {
	YNegative = 0,
	XPositive = 1,
	YPositive = 2,
	XNegative = 3,
	Max_None = 4,
	ETrackDirection_MAX = 5
};

// Enum FortniteGame.ETrackPieceType
enum class ETrackPieceType : uint8 {
	None = 0,
	Straight = 1,
	Turn = 2,
	TShape = 3,
	Cross = 4,
	Max_None = 5,
	ETrackPieceType_MAX = 6
};

// Enum FortniteGame.ETrackIncline
enum class ETrackIncline : uint8 {
	NoNeighbor = 0,
	Flat = 1,
	Up = 2,
	Down = 3,
	GradualUp = 4,
	GradualDown = 5,
	Max_None = 6,
	ETrackIncline_MAX = 7
};

// Enum FortniteGame.ETrackVerticality
enum class ETrackVerticality : uint8 {
	Floor = 0,
	Ramp = 1,
	GradualRamp = 2,
	Max_None = 3,
	ETrackVerticality_MAX = 4
};

// Enum FortniteGame.ETreadSide
enum class ETreadSide : uint8 {
	Invalid = 0,
	Left = 1,
	Right = 2,
	ETreadSide_MAX = 3
};

// Enum FortniteGame.EVelocityUnits
enum class EVelocityUnits : uint8 {
	CentimetersPerSecond = 0,
	KilometersPerHour = 1,
	EVelocityUnits_MAX = 2
};

// Enum FortniteGame.ESettingTab
enum class ESettingTab : uint8 {
	None = 0,
	Video = 1,
	Game = 2,
	GameUI = 3,
	Brightness = 4,
	Audio = 5,
	Accessibility = 6,
	Input = 7,
	MouseAndKeyboard = 8,
	Controller = 9,
	ControllerSensitivity = 10,
	TouchAndMotion = 11,
	Account = 12,
	CreativeWorld = 13,
	CreativePlayer = 14,
	ESettingTab_MAX = 15
};

// Enum FortniteGame.ESubGameAccessStatus
enum class ESubGameAccessStatus : uint8 {
	Disabled = 0,
	LimitedAccess = 1,
	OpenAccess = 2,
	ESubGameAccessStatus_MAX = 3
};

// Enum FortniteGame.ESubGameMatchmakingStatus
enum class ESubGameMatchmakingStatus : uint8 {
	Disabled = 0,
	Enabled = 1,
	ESubGameMatchmakingStatus_MAX = 2
};

// Enum FortniteGame.EFortItemCategoryOrdinal
enum class EFortItemCategoryOrdinal : uint8 {
	Primary = 0,
	Secondary = 1,
	Tertiary = 2,
	EFortItemCategoryOrdinal_MAX = 3
};

// Enum FortniteGame.EFortInventoryCustomFilter
enum class EFortInventoryCustomFilter : uint8 {
	Mythic = 0,
	Legendary = 1,
	Epic = 2,
	Rare = 3,
	Uncommon = 4,
	Common = 5,
	EFortInventoryCustomFilter_MAX = 6
};

// Enum FortniteGame.EChangeInStructDetected
enum class EChangeInStructDetected : uint8 {
	Dirty = 0,
	Clean = 1,
	EChangeInStructDetected_MAX = 2
};

// Enum FortniteGame.EFortBrushSize
enum class EFortBrushSize : uint8 {
	VeryVerySmall = 0,
	VerySmall = 1,
	Small = 2,
	Medium = 3,
	Large = 4,
	VeryLarge = 5,
	EFortBrushSize_MAX = 6
};

// Enum FortniteGame.EFortTargetSelectionShape
enum class EFortTargetSelectionShape : uint8 {
	Sphere = 0,
	Cone = 1,
	Box = 2,
	Capsule = 3,
	Line = 4,
	Cylinder = 5,
	Custom = 6,
	CustomOnSource = 7,
	EFortTargetSelectionShape_MAX = 8
};

// Enum FortniteGame.EFortTargetSelectionTestType
enum class EFortTargetSelectionTestType : uint8 {
	Overlap = 0,
	Swept = 1,
	Ballistic = 2,
	EFortTargetSelectionTestType_MAX = 3
};

// Enum FortniteGame.EFortWeaponType
enum class EFortWeaponType : uint8 {
	None = 0,
	RangedAny = 1,
	Pistol = 2,
	Shotgun = 3,
	Rifle = 4,
	SMG = 5,
	Sniper = 6,
	GrenadeLauncher = 7,
	RocketLauncher = 8,
	Bow = 9,
	Minigun = 10,
	LMG = 11,
	BiplaneGun = 12,
	MeleeAny = 13,
	Harvesting = 14,
	MAX = 15
};

// Enum FortniteGame.EFortTargetSelectionFilter
enum class EFortTargetSelectionFilter : uint8 {
	Damageable = 0,
	Everything = 1,
	Pawns = 2,
	Buildings = 3,
	Walls = 4,
	Traps = 5,
	Players = 6,
	AIPawns = 7,
	Instigator = 8,
	WeakSpots = 9,
	World = 10,
	Max = 11
};

// Enum FortniteGame.EFortDisplayGender
enum class EFortDisplayGender : uint8 {
	Unknown = 0,
	Male = 1,
	Female = 2,
	NumTypes = 3,
	EFortDisplayGender_MAX = 4
};

// Enum FortniteGame.EFortCustomCharmType
enum class EFortCustomCharmType : uint8 {
	Weapon = 0,
	Lapel = 1,
	Backpack1 = 2,
	Backpack2 = 3,
	NumTypes = 4,
	EFortCustomCharmType_MAX = 5
};

// Enum FortniteGame.EFortPawnDisplayContext
enum class EFortPawnDisplayContext : uint8 {
	BattleRoyale = 0,
	VaultItemsFromOffer = 1,
	VaultItem = 2,
	VaultItems = 3,
	VaultItemFromDefinition = 4,
	CampaignFrontEndPlayer = 5,
	CampaignNPC = 6,
	CampaignHeroInspect = 7,
	CampaignHeroLoadoutSupport = 8,
	CampaignOutfitPicker = 9,
	EFortPawnDisplayContext_MAX = 10
};

// Enum FortniteGame.EFortDayPhasePrio
enum class EFortDayPhasePrio : uint8 {
	Default = 0,
	DailySummary = 1,
	EFortDayPhasePrio_MAX = 2
};

// Enum FortniteGame.EFortWeaponTriggerType
enum class EFortWeaponTriggerType : uint8 {
	OnPress = 0,
	Automatic = 1,
	OnRelease = 2,
	OnPressAndRelease = 3,
	Custom = 4,
	EFortWeaponTriggerType_MAX = 5
};

// Enum FortniteGame.EFortMovementStyle
enum class EFortMovementStyle : uint8 {
	Running = 0,
	Walking = 1,
	Charging = 2,
	Sprinting = 3,
	PersonalVehicle = 4,
	Flying = 5,
	Tethered = 6,
	EFortMovementStyle_MAX = 7
};

// Enum FortniteGame.EFortMovementUrgency
enum class EFortMovementUrgency : uint8 {
	None = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	NumLevels = 4,
	EFortMovementUrgency_MAX = 5
};

// Enum FortniteGame.EFortTileEdgeType
enum class EFortTileEdgeType : uint8 {
	Undefined = 0,
	 = 1,
	 = 2,
	 = 3,
	 = 4,
	 = 5,
	 = 6,
	MAX = 7
};

// Enum FortniteGame.EFortAIUtility
enum class EFortAIUtility : uint8 {
	KillPlayersMelee = 0,
	KillPlayersRanged = 1,
	KillPlayersArtillery = 2,
	DestroyBuildingsMelee = 3,
	DestroyBuildingsRanged = 4,
	DestroyBuildingsArtillery = 5,
	DestroyTraps = 6,
	Tank = 7,
	Infiltrate = 8,
	Mob = 9,
	Support = 10,
	Kiting = 11,
	AreaOfDenial = 12,
	DisableTraps = 13,
	Dormant = 14,
	Assassin = 15,
	MAX = 16
};

// Enum FortniteGame.EFortIndicatorState
enum class EFortIndicatorState : uint8 {
	Hidden = 0,
	OnlyFriendsVisible = 1,
	Visible = 2,
	EFortIndicatorState_MAX = 3
};

// Enum FortniteGame.EKeepContainerType
enum class EKeepContainerType : uint8 {
	Base = 0,
	Storeroom = 1,
	FirstAid = 2,
	Armory = 3,
	Workshop = 4,
	AmmoStash = 5,
	Max = 6
};

// Enum FortniteGame.EKeepDefenseState
enum class EKeepDefenseState : uint8 {
	Inactive = 0,
	Warmup = 1,
	Defense = 2,
	LastAlive = 3,
	Max = 4
};

// Enum FortniteGame.ECraftingUpgradeDataFlags
enum class ECraftingUpgradeDataFlags : uint8 {
	None = 0,
	OverrideWrap = 1,
	Durability = 2,
	PhantomAmmo = 4,
	LoadedAmmo = 8,
	ModSlots = 16,
	All = 255,
	ECraftingUpgradeDataFlags_MAX = 256
};

// Enum FortniteGame.EFortEventNameType
enum class EFortEventNameType : uint8 {
	Mission = 0,
	Client = 1,
	EFortEventNameType_MAX = 2
};

// Enum FortniteGame.ETutorialType
enum class ETutorialType : uint8 {
	None = 0,
	Callout = 1,
	GuardScreen = 2,
	WidgetIntro = 3,
	Highlight = 4,
	ETutorialType_MAX = 5
};

// Enum FortniteGame.EFortNotificationQueueType
enum class EFortNotificationQueueType : uint8 {
	Toasts = 0,
	Stickies = 1,
	Messages = 2,
	Max = 3
};

// Enum FortniteGame.EFortClientAnnouncementQueueType
enum class EFortClientAnnouncementQueueType : uint8 {
	Toasts = 0,
	Stickies = 1,
	Max = 2
};

// Enum FortniteGame.EStormShieldDefense
enum class EStormShieldDefense : uint8 {
	NotSSD = 0,
	StormShieldExpansion = 1,
	WargameSimulation = 2,
	EStormShieldDefense_MAX = 3
};

// Enum FortniteGame.EFortGliderType
enum class EFortGliderType : uint8 {
	Glider = 0,
	Umbrella = 1,
	EFortGliderType_MAX = 2
};

// Enum FortniteGame.EAthenaPickerType
enum class EAthenaPickerType : uint8 {
	EditMode = 0,
	Interact = 1,
	MAX = 2
};

// Enum FortniteGame.EMobileInteractionIconTypes
enum class EMobileInteractionIconTypes : uint8 {
	Interact = 0,
	Swap = 1,
	Revive = 2,
	Blocked = 3,
	MAX = 4
};

// Enum FortniteGame.EFortErrorSeverity
enum class EFortErrorSeverity : uint8 {
	Unspecified = 0,
	Silent = 1,
	Passive = 2,
	Blocking = 3,
	SevereBlocking = 4,
	EFortErrorSeverity_MAX = 5
};

// Enum FortniteGame.EFortMatchmakingTileStyle
enum class EFortMatchmakingTileStyle : uint8 {
	None = 0,
	Special = 1,
	HighStakes = 2,
	Showdown = 3,
	EFortMatchmakingTileStyle_MAX = 4
};

// Enum FortniteGame.EFortMatchmakingViolatorStyle
enum class EFortMatchmakingViolatorStyle : uint8 {
	None = 0,
	Basic = 1,
	HighStakes = 2,
	Showdown = 3,
	FirstTimeUser = 4,
	EFortMatchmakingViolatorStyle_MAX = 5
};

// Enum FortniteGame.EFortLobbyType
enum class EFortLobbyType : uint8 {
	Default = 0,
	Tournament = 1,
	Creative = 2,
	Division = 3,
	EFortLobbyType_MAX = 4
};

// Enum FortniteGame.EEventTournamentType
enum class EEventTournamentType : uint8 {
	Online = 0,
	Onsite = 1,
	Test = 2,
	Unknown = 3,
	EEventTournamentType_MAX = 4
};

// Enum FortniteGame.EFortCreativeAdType
enum class EFortCreativeAdType : uint8 {
	Default = 0,
	Playset = 1,
	Toy = 2,
	Game = 3,
	Island = 4,
	Knob = 5,
	EFortCreativeAdType_MAX = 6
};

// Enum FortniteGame.EFortCreativeAdColorPreset
enum class EFortCreativeAdColorPreset : uint8 {
	Default = 0,
	Emphasized = 1,
	Common = 2,
	Uncommon = 3,
	Rare = 4,
	Epic = 5,
	Legendary = 6,
	EFortCreativeAdColorPreset_MAX = 7
};

// Enum FortniteGame.EFortStartupPhase
enum class EFortStartupPhase : uint8 {
	InitializingEngine = 0,
	EarlyStartupLoading = 1,
	EarlyStartupFinished = 2,
	GameStartupLoading = 3,
	GameStartupFinished = 4,
	Invalid = 5,
	Count = 5,
	EFortStartupPhase_MAX = 6
};

// Enum FortniteGame.EFortGameFeature
enum class EFortGameFeature : uint8 {
	EarlyStartup = 0,
	DedicatedServer = 1,
	KairosInitial = 2,
	KairosCapture = 3,
	KairosLoadElectraPlayer = 4,
	DanceRoyale = 5,
	Frontend = 6,
	GameplayAthena = 7,
	GameplayCampaignTutorial = 8,
	GameplayCampaign = 9,
	GameplayCreative = 10,
	Invalid = 11,
	Count = 11,
	EFortGameFeature_MAX = 12
};

// Enum FortniteGame.EFortGameFeatureState
enum class EFortGameFeatureState : uint8 {
	Unknown = 0,
	Unavailable = 1,
	Downloading = 2,
	DownloadFailed = 3,
	Available = 4,
	Preloading = 5,
	Preloaded = 6,
	Loading = 7,
	Loaded = 8,
	Count = 8,
	EFortGameFeatureState_MAX = 9
};

// Enum FortniteGame.EFortPlaylistTeamSizeType
enum class EFortPlaylistTeamSizeType : uint8 {
	Solo = 0,
	Duo = 1,
	Trio = 2,
	Squad = 3,
	LargeTeam = 4,
	MAX = 5
};

// Enum FortniteGame.ECreativeItemCategory
enum class ECreativeItemCategory : uint8 {
	Prefabs = 0,
	Devices = 1,
	Weapons = 2,
	Consumables = 3,
	Gallery = 4,
	None = 5,
	ECreativeItemCategory_MAX = 6
};

// Enum FortniteGame.ECreativeOptionDestructiveActionOperator
enum class ECreativeOptionDestructiveActionOperator : uint8 {
	Invalid = 0,
	LessThan = 1,
	NotEqual = 2,
	GreaterThan = 3,
	ECreativeOptionDestructiveActionOperator_MAX = 4
};

// Enum FortniteGame.EFortLeaderboardMetric
enum class EFortLeaderboardMetric : uint8 {
	Score = 0,
	Kills = 1,
	TeamScore = 2,
	EFortLeaderboardMetric_MAX = 3
};

// Enum FortniteGame.EFortQuickTimeEventResult
enum class EFortQuickTimeEventResult : uint8 {
	None = 0,
	Miss = 1,
	Good = 2,
	Great = 3,
	Perfect = 4,
	EFortQuickTimeEventResult_MAX = 5
};

// Enum FortniteGame.EMissionStormShieldState
enum class EMissionStormShieldState : uint8 {
	IDLE = 0,
	GROWING = 1,
	SHRINKING = 2,
	MAX = 3
};

// Enum FortniteGame.EFortServerTickRate
enum class EFortServerTickRate : uint8 {
	UseDefault = 0,
	Twenty = 1,
	Thirty = 2,
	EFortServerTickRate_MAX = 3
};

// Enum FortniteGame.EHighResTexturesChangeReason
enum class EHighResTexturesChangeReason : uint8 {
	UserGameSettings = 0,
	QualityLevelSelectScreenSettings = 1,
	ContentOnDemandFreedUpMemorySelection = 2,
	ContentOnDemandDisplayOutOfMemory = 3,
	ContentOnDemandOutOfMemoryErrorClosed = 4,
	EHighResTexturesChangeReason_MAX = 5
};

// Enum FortniteGame.EFortUIFriendNotificationType
enum class EFortUIFriendNotificationType : uint8 {
	Default = 0,
	FriendRequest = 1,
	PartyInviteSent = 2,
	PartyInvite = 3,
	InviteFriendToParty = 4,
	PartyRequest = 5,
	AutoImportFriendSuggestion = 6,
	PartyMemberCreated = 7,
	EFortUIFriendNotificationType_MAX = 8
};

// Enum FortniteGame.EFortNotificationType
enum class EFortNotificationType : uint8 {
	Default = 0,
	Power = 1,
	HealthWarning = 2,
	Error = 3,
	GiftSent = 4,
	VoiceChannel = 5,
	DonutChallenge = 6,
	SocialNotification = 7,
	BattlePassPageUnlock = 8,
	DownloadOnDemandError = 9,
	Max = 10
};

// Enum FortniteGame.EFortNotificationPriority
enum class EFortNotificationPriority : uint8 {
	Vote = 0,
	Friend = 1,
	BoostedXP = 2,
	TwitchHigh = 3,
	GeneralSendNotification = 4,
	TwitchLow = 10,
	Max = 11
};

// Enum FortniteGame.EFortContextualReticleTypes
enum class EFortContextualReticleTypes : uint8 {
	FCR_GenericFailure = 0,
	FCR_Upgrade = 1,
	FCR_Repair = 2,
	FCR_Locked = 3,
	FCR_Placement = 4,
	FCR_Edit = 5,
	FCR_NoTarget = 6,
	FCR_InProgress = 7,
	FCR_None = 8,
	FCR_MAX = 9
};

// Enum FortniteGame.EFortUserCloudRequestType
enum class EFortUserCloudRequestType : uint8 {
	LoadCloudFile = 0,
	SaveCloudFile = 1,
	EFortUserCloudRequestType_MAX = 2
};

// Enum FortniteGame.EFortUserCloudRequestResult
enum class EFortUserCloudRequestResult : uint8 {
	Success = 0,
	Failure_CloudStorageDisabled = 1,
	Failure_CloudStorageError = 2,
	Failure_FileNotFoundInUserFileList = 3,
	Failure_SavingNotAllowedForSpecifiedUser = 4,
	EFortUserCloudRequestResult_MAX = 5
};

// Enum FortniteGame.EUserOptionDefinitionGenerationFlags
enum class EUserOptionDefinitionGenerationFlags : uint8 {
	None = 0,
	AutoAdded = 1,
	Inherited = 2,
	EUserOptionDefinitionGenerationFlags_MAX = 3
};

// Enum FortniteGame.EFortVariantTokenEquipRule
enum class EFortVariantTokenEquipRule : uint8 {
	EquipBaseVariantOnly = 0,
	AlsoEquipAdditionalGrants = 1,
	AlsoEquipPreviewGrantsIfOwned = 2,
	EquipAllExceptUnowned = 3,
	EFortVariantTokenEquipRule_MAX = 4
};

// Enum FortniteGame.EFortValetVehicleType
enum class EFortValetVehicleType : uint8 {
	Default = 0,
	Sport = 1,
	BasicTruck = 2,
	EFortValetVehicleType_MAX = 3
};

// Enum FortniteGame.EVehicleAudioInterpolationType
enum class EVehicleAudioInterpolationType : uint8 {
	None = 0,
	CustomCurve = 1,
	Linear = 2,
	EVehicleAudioInterpolationType_MAX = 3
};

// Enum FortniteGame.EVehicleAudioTriggerDir
enum class EVehicleAudioTriggerDir : uint8 {
	Forward = 0,
	Backward = 1,
	EVehicleAudioTriggerDir_MAX = 2
};

// Enum FortniteGame.EVehicleMovementMode
enum class EVehicleMovementMode : uint8 {
	OnGround = 0,
	InAir = 1,
	WipeOut = 2,
	MaxCount = 3,
	EVehicleMovementMode_MAX = 4
};

// Enum FortniteGame.EVehicleSessionEndReason
enum class EVehicleSessionEndReason : uint8 {
	Invalid = 0,
	NoPassengers = 1,
	EVehicleSessionEndReason_MAX = 2
};

// Enum FortniteGame.EVehicleFuelState
enum class EVehicleFuelState : uint8 {
	Uninitialized = 0,
	UsingVehicleFuel = 1,
	NotUsingVehicleFuel = 2,
	EVehicleFuelState_MAX = 3
};

// Enum FortniteGame.ESeatSelectionRule
enum class ESeatSelectionRule : uint8 {
	TwoClosest = 0,
	ClosestToPlayer = 1,
	ClosestToAim = 2,
	TwoClosestThenClosestToPlayer = 3,
	ESeatSelectionRule_MAX = 4
};

// Enum FortniteGame.ETryExitVehicleBehavior
enum class ETryExitVehicleBehavior : uint8 {
	DoNotForce = 0,
	ForceOnBlocking = 1,
	ForceAlways = 2,
	ETryExitVehicleBehavior_MAX = 3
};

// Enum FortniteGame.EFortVisibilityBehavior
enum class EFortVisibilityBehavior : uint8 {
	Proximity = 0,
	OnceSeenAlwaysSeen = 1,
	AlwaysSeen = 2,
	Invalid = 3,
	EFortVisibilityBehavior_MAX = 4
};

// Enum FortniteGame.EVolumeShape
enum class EVolumeShape : uint8 {
	Sphere = 0,
	Box = 1,
	EVolumeShape_MAX = 2
};

// Enum FortniteGame.EActorFilterPolicy
enum class EActorFilterPolicy : uint8 {
	POL_FilterActorsWithoutVolumeReference = 0,
	POL_IgnorePreviewActors = 1,
	POL_MAX = 2
};

// Enum FortniteGame.EVolumeValidityResult
enum class EVolumeValidityResult : uint8 {
	Valid = 0,
	Invalid = 1,
	EVolumeValidityResult_MAX = 2
};

// Enum FortniteGame.EFortReloadMontageSection
enum class EFortReloadMontageSection : uint8 {
	Intro = 0,
	Loop = 1,
	Outro = 2,
	EFortReloadMontageSection_MAX = 3
};

// Enum FortniteGame.EFortWeaponChargeStateForFireFX
enum class EFortWeaponChargeStateForFireFX : uint8 {
	Partial = 0,
	Full = 1,
	Over = 2,
	Max_None = 3,
	EFortWeaponChargeStateForFireFX_MAX = 4
};

// Enum FortniteGame.EFortWeaponReduceMeshWorkSetting
enum class EFortWeaponReduceMeshWorkSetting : uint8 {
	DisableTick = 0,
	DontReduceWork = 1,
	HandledInAnimInstance = 2,
	EFortWeaponReduceMeshWorkSetting_MAX = 3
};

// Enum FortniteGame.EFortWeaponAbilityRemovalReason
enum class EFortWeaponAbilityRemovalReason : uint8 {
	RemovedFromInventory = 0,
	EndPlay = 1,
	Unequipped = 2,
	INVALID_MAX = 3,
	EFortWeaponAbilityRemovalReason_MAX = 4
};

// Enum FortniteGame.EFortWeaponAbilityRemovalPolicy
enum class EFortWeaponAbilityRemovalPolicy : uint8 {
	GameDefault = 0,
	Remove = 1,
	Persist = 2,
	EFortWeaponAbilityRemovalPolicy_MAX = 3
};

// Enum FortniteGame.EFortRecoilCurveType
enum class EFortRecoilCurveType : uint8 {
	WithTime = 0,
	WithOverheat = 1,
	EFortRecoilCurveType_MAX = 2
};

// Enum FortniteGame.EFortDisplayTier
enum class EFortDisplayTier : uint8 {
	Invalid = 0,
	Handmade = 1,
	Copper = 2,
	Silver = 3,
	Malachite = 4,
	Obsidian = 5,
	Brightcore = 6,
	Spectrolite = 7,
	Shadowshard = 8,
	Sunbeam = 9,
	Moonglow = 10,
	EFortDisplayTier_MAX = 11
};

// Enum FortniteGame.EFortMeleeFX
enum class EFortMeleeFX : uint8 {
	Idle = 0,
	Swing = 1,
	AnimTrail = 2,
	EFortMeleeFX_MAX = 3
};

// Enum FortniteGame.EFortDualWieldSwingState
enum class EFortDualWieldSwingState : uint8 {
	None = 0,
	MainHand = 1,
	OffHand = 2,
	BothHands = 3,
	EFortDualWieldSwingState_MAX = 4
};

// Enum FortniteGame.EFortDualWieldDataSource
enum class EFortDualWieldDataSource : uint8 {
	BaseConfiguration = 0,
	DataDriven = 1,
	EFortDualWieldDataSource_MAX = 2
};

// Enum FortniteGame.MountedCannonLaunchPlayerMode
enum class MountedCannonLaunchPlayerMode : uint8 {
	Off = 0,
	PrimaryFire = 1,
	SecondaryFire = 2,
	PrimaryWhileTargeting = 3,
	MountedCannonLaunchPlayerMode_MAX = 4
};

// Enum FortniteGame.EWorldItemDropBehavior
enum class EWorldItemDropBehavior : uint8 {
	DropAsPickup = 0,
	DestroyOnDrop = 1,
	DropAsPickupDestroyOnEmpty = 2,
	DropAsPickupEvenWhenEmpty = 3,
	EWorldItemDropBehavior_MAX = 4
};

// Enum FortniteGame.EFortWorldRecordAction
enum class EFortWorldRecordAction : uint8 {
	LoadWorldOnly = 0,
	SaveWorldOnly = 1,
	SaveZoneAndWorld = 2,
	LoadZoneAndWorld = 3,
	SaveDeployableBasesAndWorld = 4,
	Max_None = 5,
	EFortWorldRecordAction_MAX = 6
};

// Enum FortniteGame.EFortWorldRecordState
enum class EFortWorldRecordState : uint8 {
	StartProcessing = 0,
	WaitingForResponse = 1,
	RetrievingTheaterInformation = 2,
	RetrievingZoneInformation = 3,
	LoadingWorldRecord = 4,
	LoadingZoneRecord = 5,
	SavingZoneRecord = 6,
	SavingPlayerProfiles = 7,
	SavingPlayerDeployableBases = 8,
	Succeeded = 9,
	Failed = 10,
	Max_None = 11,
	EFortWorldRecordState_MAX = 12
};

// Enum FortniteGame.EFortQueuedActionUserStatus
enum class EFortQueuedActionUserStatus : uint8 {
	Succeeded = 0,
	Failed = 1,
	WaitingForCloudRequest = 2,
	WaitingForProfileSave = 3,
	EFortQueuedActionUserStatus_MAX = 4
};

// Enum FortniteGame.EFortLevelStreamingState
enum class EFortLevelStreamingState : uint8 {
	LSS_Unloaded = 0,
	LSS_Loaded = 1,
	LSS_UnconditionalFoundationsUpdated = 2,
	LSS_AllFoundationsUpdated = 3,
	LSS_NewActorsCreatedButNotUpdated = 4,
	LSS_AllUpdated = 5,
	LSS_Ready = 6,
	LSS_MAX = 7
};

// Enum FortniteGame.EFortWorldManagerState
enum class EFortWorldManagerState : uint8 {
	WMS_Created = 0,
	WMS_QueryingWorld = 1,
	WMS_WorldQueryComplete = 2,
	WMS_CreatingNewWorld = 3,
	WMS_LoadingExistingWorld = 4,
	WMS_Running = 5,
	WMS_Failed = 6,
	WMS_MAX = 7
};

// Enum FortniteGame.EDeployableBaseUseType
enum class EDeployableBaseUseType : uint8 {
	Neighborhood = 0,
	PvECombat = 1,
	EDeployableBaseUseType_MAX = 2
};

// Enum FortniteGame.EFortActivityValidationResult
enum class EFortActivityValidationResult : uint8 {
	NotFound = 0,
	InvalidKeyTooShort = 1,
	InvalidKeyCharacters = 2,
	IneligibleParty = 3,
	IslandPrivate = 4,
	CreativePublishedSuccess = 5,
	EFortActivityValidationResult_MAX = 6
};

// Enum FortniteGame.EFortWeaponUpgradeCosts
enum class EFortWeaponUpgradeCosts : uint8 {
	NotSet = 0,
	WoodUncommon = 1,
	WoodRare = 2,
	WoodVeryRare = 3,
	WoodSuperRare = 4,
	MetalUncommon = 5,
	MetalRare = 6,
	MetalVeryRare = 7,
	MetalSuperRare = 8,
	BrickUncommon = 9,
	BrickRare = 10,
	BrickVeryRare = 11,
	BrickSuperRare = 12,
	HorizontalWoodCommon = 13,
	HorizontalWoodUncommon = 14,
	HorizontalWoodRare = 15,
	HorizontalWoodVeryRare = 16,
	HorizontalWoodSuperRare = 17,
	HorizontalMetalCommon = 18,
	HorizontalMetalUncommon = 19,
	HorizontalMetalRare = 20,
	HorizontalMetalVeryRare = 21,
	HorizontalMetalSuperRare = 22,
	HorizontalBrickCommon = 23,
	HorizontalBrickUncommon = 24,
	HorizontalBrickRare = 25,
	HorizontalBrickVeryRare = 26,
	HorizontalBrickSuperRare = 27,
	EFortWeaponUpgradeCosts_MAX = 28
};

// Enum FortniteGame.EFortWeaponUpgradeDirection
enum class EFortWeaponUpgradeDirection : uint8 {
	NotSet = 0,
	Vertical = 1,
	Horizontal = 2,
	EFortWeaponUpgradeDirection_MAX = 3
};

// Enum FortniteGame.EFortWeaponUpgradeInteractionResult
enum class EFortWeaponUpgradeInteractionResult : uint8 {
	Upgradable = 0,
	NotEnoughResources = 1,
	CannotUpgrade = 2,
	CannotInteract = 3,
	EFortWeaponUpgradeInteractionResult_MAX = 4
};

// Enum FortniteGame.EPlayerAttributeClampType
enum class EPlayerAttributeClampType : uint8 {
	Minimum = 0,
	Maximum = 1,
	EPlayerAttributeClampType_MAX = 2
};

// Enum FortniteGame.EFortSharedAnimationState
enum class EFortSharedAnimationState : uint8 {
	Anim_Walk = 0,
	Anim_Run = 1,
	Anim_Turn = 2,
	Anim_Attack = 3,
	Anim_Death = 4,
	Anim_Knockback = 5,
	Anim_FullBodyHit = 6,
	Anim_Pushed = 7,
	Anim_Dance = 8,
	Anim_Idle = 9,
	Anim_RangedAttack = 10,
	Anim_MAX = 11
};

// Enum FortniteGame.EDroneFacingLocationMode
enum class EDroneFacingLocationMode : uint8 {
	NotFacingLocation = 0,
	FindingPoint = 1,
	TrackingPoint = 2,
	EDroneFacingLocationMode_MAX = 3
};

// Enum FortniteGame.ELayoutDataType
enum class ELayoutDataType : uint8 {
	Custom = 0,
	DefaultToolLayout = 1,
	DefaultGameLayout = 2,
	MAX_Local = 3,
	CustomCloudLayout = 4,
	ELayoutDataType_MAX = 5
};

// Enum FortniteGame.EFireModeType
enum class EFireModeType : uint8 {
	Unset = 0,
	TapToShoot = 1,
	FireButton = 2,
	AutoFire = 3,
	ForceTouch = 4,
	Custom = 5,
	MAX = 6
};

// Enum FortniteGame.ESpawnPointState
enum class ESpawnPointState : uint8 {
	Inactive = 0,
	Active_CarryObjectInRange = 1,
	Active_CarryObjectOutOfRange = 2,
	IntelCaptured = 3,
	IntelDownloaded = 4,
	ESpawnPointState_MAX = 5
};

// Enum FortniteGame.EInputActivationType
enum class EInputActivationType : uint8 {
	Activate = 0,
	Deactivate = 1,
	EInputActivationType_MAX = 2
};

// Enum FortniteGame.EIslandInspectorState
enum class EIslandInspectorState : uint8 {
	Initializing = 0,
	Ready = 1,
	AwaitingProcessCommand = 2,
	ProcessingCommand = 3,
	EIslandInspectorState_MAX = 4
};

// Enum FortniteGame.ELevelSaveRecordVersion
enum class ELevelSaveRecordVersion : uint8 {
	CloudSaveInfoAdded = 0,
	TimestampConversion = 1,
	SoftActorClassReferences = 2,
	SoftActorComponentClassReferences = 3,
	DuplicateNewActorRecordsRemoved = 4,
	StartOfResaveWhenNotLatestVersion = 5,
	LowerCloseThresholdForDuplicates = 6,
	DeprecatedDeleteAndNewActorRecords = 7,
	DependenciesFromSerializedWorld = 8,
	RemovingSerializedDependencies = 9,
	AddingVolumeInfoRecordsMap = 10,
	AddingVolumeGridDependency = 11,
	AddingScale = 12,
	AddingDataHash = 13,
	AddedIslandTemplateId = 14,
	AddedLevelStreamedDeleteRecord = 15,
	UsingSaveActorGUID = 16,
	UsingActorFNameForEditorSpawning = 17,
	AddedPlayerPersistenceUserWipeNumber = 18,
	Unused = 19,
	AddedVkPalette = 20,
	SwitchingToCoreSerialization = 21,
	AddedNavmeshRequired = 22,
	InitialUEFiveChange = 23,
	AddedPersistenceRequired = 24,
	AddedLevelInstance = 25,
	AddedInnerArchiverSerialization = 26,
	AddedHardReferenceTracking = 27,
	AddedDataHeaderSize = 28,
	AddedCrossReferenceSaving = 29,
	SpawningActorsWithConsistentName = 30,
	UpdatePackageNameFromIslandTemplateId = 31,
	LargeWorldCoordinateSerializationChange = 32,
	SeasionTwentyTwoRelease = 33,
	EnforceUniqueLabels = 34,
	AddedConfigForNonSaveGameProperties = 35,
	VersionPlusOne = 36,
	LatestVersion = 35,
	ELevelSaveRecordVersion_MAX = 37
};

// Enum FortniteGame.ELevelSaveCategory
enum class ELevelSaveCategory : uint8 {
	ActorInstance = 0,
	VolumeInfoActor = 1,
	ELevelSaveCategory_MAX = 2
};

// Enum FortniteGame.EFortEncounterPacingMode
enum class EFortEncounterPacingMode : uint8 {
	SpawnPointsPercentageCurve = 0,
	IntensityCurve = 1,
	Burst = 2,
	Fixed = 3,
	EFortEncounterPacingMode_MAX = 4
};

// Enum FortniteGame.EFortEncounterSpawnLocationPlacementMode
enum class EFortEncounterSpawnLocationPlacementMode : uint8 {
	Directional = 0,
	Ring = 1,
	Volume = 2,
	Custom = 3,
	Max_None = 4,
	EFortEncounterSpawnLocationPlacementMode_MAX = 5
};

// Enum FortniteGame.EFortEncounterSpawnLocationManagementMode
enum class EFortEncounterSpawnLocationManagementMode : uint8 {
	Spawn = 0,
	Search = 1,
	EFortEncounterSpawnLocationManagementMode_MAX = 2
};

// Enum FortniteGame.EFortEncounterUtilitiesMode
enum class EFortEncounterUtilitiesMode : uint8 {
	LockedOnly = 0,
	LockedAndFree = 1,
	EFortEncounterUtilitiesMode_MAX = 2
};

// Enum FortniteGame.EFortEncounterSpawnLimitType
enum class EFortEncounterSpawnLimitType : uint8 {
	NoLimit = 0,
	NumPawnsLimit = 1,
	SpawnPointLimit = 2,
	UserDefined = 3,
	MAX = 4
};

// Enum FortniteGame.EMissionGenerationCategory
enum class EMissionGenerationCategory : uint8 {
	Primary = 0,
	Secondary = 1,
	Tertiary = 2,
	Survivor = 3,
	Max_None = 4,
	EMissionGenerationCategory_MAX = 5
};

// Enum FortniteGame.EFortMissionStatus
enum class EFortMissionStatus : uint8 {
	Created = 0,
	InProgress = 1,
	Succeeded = 2,
	Failed = 3,
	NeutralCompletion = 4,
	Quit = 5,
	Max_None = 6,
	EFortMissionStatus_MAX = 7
};

// Enum FortniteGame.EFortObjectiveRequirement
enum class EFortObjectiveRequirement : uint8 {
	Optional = 0,
	Required = 1,
	RequiredButCanFail = 2,
	EFortObjectiveRequirement_MAX = 3
};

// Enum FortniteGame.EFortMissionType
enum class EFortMissionType : uint8 {
	Primary = 0,
	Secondary = 1,
	Max_None = 2,
	EFortMissionType_MAX = 3
};

// Enum FortniteGame.EFortMissionAudibility
enum class EFortMissionAudibility : uint8 {
	UseVisibility = 0,
	Audible = 1,
	Inaudible = 2,
	EFortMissionAudibility_MAX = 3
};

// Enum FortniteGame.EMusicEventResolutionRule
enum class EMusicEventResolutionRule : uint8 {
	NewestWins = 0,
	OldestWins = 1,
	ClosestWins = 2,
	EverythingWins = 3,
	EMusicEventResolutionRule_MAX = 4
};

// Enum FortniteGame.EDistanceTravelDirection
enum class EDistanceTravelDirection : uint8 {
	Any = 0,
	Vertical = 1,
	Horizontal = 2,
	EDistanceTravelDirection_MAX = 3
};

// Enum FortniteGame.EDistanceTravelMode
enum class EDistanceTravelMode : uint8 {
	Any = 0,
	Vehicle = 1,
	Running = 2,
	Swimming = 3,
	FlyingOrFalling = 4,
	Crouch = 5,
	EDistanceTravelMode_MAX = 6
};

// Enum FortniteGame.EFortBudgetType
enum class EFortBudgetType : uint8 {
	Live = 0,
	Preview = 1,
	Max = 2
};

// Enum FortniteGame.EClipMessageSettings
enum class EClipMessageSettings : uint8 {
	DontShow = 0,
	ShowString = 1,
	DeduceUnicornAnnotation = 2,
	ShotTitleScreen = 3,
	EClipMessageSettings_MAX = 4
};

// Enum FortniteGame.EPegasusTimelineCategories
enum class EPegasusTimelineCategories : uint8 {
	Unassigned = 0,
	Player = 1,
	Combat = 2,
	Building = 3,
	Inventory = 4,
	Social = 5,
	Resources = 6,
	EPegasusTimelineCategories_MAX = 7
};

// Enum FortniteGame.EPlateHawkInputEvents
enum class EPlateHawkInputEvents : uint8 {
	PrimaryFire = 0,
	SecondaryFire = 1,
	Sprint = 2,
	Reload = 3,
	EPlateHawkInputEvents_MAX = 4
};

// Enum FortniteGame.ESceneQueryShape
enum class ESceneQueryShape : uint8 {
	Sphere = 0,
	Box = 1,
	Capsule = 2,
	VolumeBounds = 3,
	ESceneQueryShape_MAX = 4
};

// Enum FortniteGame.EPrimitiveCrosstalkFunctions
enum class EPrimitiveCrosstalkFunctions : uint8 {
	SendTagAsPayload = 0,
	SendTaggedObjectPayload = 1,
	SendTaggedStringPayload = 2,
	SendTaggedIntPayload = 3,
	GetTaggedObjectPayload = 4,
	GetTaggedStringPayload = 5,
	GetTaggedIntPayload = 6,
	BindNoParamEventToTaggedDelegate = 7,
	UnbindNoParamEventFromTaggedDelegate = 8,
	UnbindObjectCallbacksFromAllTaggedDelegates = 9,
	EPrimitiveCrosstalkFunctions_MAX = 10
};

// Enum FortniteGame.ELockedWidgetsDisplayType
enum class ELockedWidgetsDisplayType : uint8 {
	None = 0,
	LockedQuestsInBundles = 1,
	LockedBundlesInSchedules = 2,
	LockedTransientQuests = 4,
	ELockedWidgetsDisplayType_MAX = 5
};

// Enum FortniteGame.ELockedWidgetUnlockType
enum class ELockedWidgetUnlockType : uint8 {
	QuestDaysFromEventStart = 0,
	QuestChallengesCompleteUntilUnlocked = 1,
	BundleDaysFromEventStart = 2,
	PrerequisiteQuest = 3,
	ELockedWidgetUnlockType_MAX = 4
};

// Enum FortniteGame.ELockedWidgetDisplayQuantity
enum class ELockedWidgetDisplayQuantity : uint8 {
	ShowAll = 0,
	ShowNextOnly = 1,
	ELockedWidgetDisplayQuantity_MAX = 2
};

// Enum FortniteGame.EQuestSharingLevel
enum class EQuestSharingLevel : uint8 {
	None = 0,
	Assistance = 1,
	Shared = 2,
	EQuestSharingLevel_MAX = 3
};

// Enum FortniteGame.EQuickHealingRequirementFlags
enum class EQuickHealingRequirementFlags : uint8 {
	Nothing = 0,
	NeedsHealing = 1,
	NeedsShields = 2,
	NeedsBoth = 3,
	Invalid = 4,
	EQuickHealingRequirementFlags_MAX = 5
};

// Enum FortniteGame.EVideoManagerStates
enum class EVideoManagerStates : uint8 {
	INVALID = 0,
	LoadingReplay = 1,
	ScrubbingReplay = 2,
	WaitingForShotSetup = 3,
	WatchingShot = 4,
	ExportingShot = 5,
	PostExportedShot = 6,
	EVideoManagerStates_MAX = 7
};

// Enum FortniteGame.EVideoManagerJobTypes
enum class EVideoManagerJobTypes : uint8 {
	EliminationExtraction = 0,
	DefinedShotSequence = 1,
	EVideoManagerJobTypes_MAX = 2
};

// Enum FortniteGame.ERespawnAndSpectatePlayerRespawningState
enum class ERespawnAndSpectatePlayerRespawningState : uint8 {
	None = 0,
	WaitingOnTimer = 1,
	WaitingOnPlayerSelection = 2,
	WaitingOnClientReady = 3,
	Respawning = 4,
	RespawnFinishing = 5,
	ERespawnAndSpectatePlayerRespawningState_MAX = 6
};

// Enum FortniteGame.ESaveLocation
enum class ESaveLocation : uint8 {
	Local_ForDevice = 0,
	Local_MAX = 1
};

// Enum FortniteGame.EIndexNavigationResult
enum class EIndexNavigationResult : uint8 {
	Succeeded = 0,
	Modified = 1,
	Clamped = 2,
	StepOff = 3,
	NoMove = 4,
	EIndexNavigationResult_MAX = 5
};

// Enum FortniteGame.ESineWaveTarget
enum class ESineWaveTarget : uint8 {
	TranslationX = 0,
	TranslationY = 1,
	TranslationZ = 2,
	RotationPitch = 3,
	RotationRoll = 4,
	RotationYaw = 5,
	ESineWaveTarget_MAX = 6
};

// Enum FortniteGame.ESpecialEventInputActionBindType
enum class ESpecialEventInputActionBindType : uint8 {
	Consume = 0,
	Bind = 1,
	None = 2,
	ESpecialEventInputActionBindType_MAX = 3
};

// Enum FortniteGame.ESpecialRelevancyMode
enum class ESpecialRelevancyMode : uint8 {
	NormalRelevancy = 0,
	SoloRelevancy = 1,
	SquadRelevancy = 2,
	MultiSquad = 3,
	Custom = 4,
	MAX = 5
};

// Enum FortniteGame.ETasksOverFramesSchedulePriorityCategory
enum class ETasksOverFramesSchedulePriorityCategory : uint8 {
	Default = 0,
	CharacterCustomization = 1,
	ETasksOverFramesSchedulePriorityCategory_MAX = 2
};

// Enum FortniteGame.ETriState
enum class ETriState : uint8 {
	DefaultState = 0,
	TrueState = 1,
	FalseState = 2,
	ETriState_MAX = 3
};

// Enum FortniteGame.EUnicornSocialFeatures
enum class EUnicornSocialFeatures : uint8 {
	INVALID = 0,
	FriendPlay = 1,
	DancePartyManpower = 2,
	CongaLineManpower = 3,
	SocialPartyDuration = 4,
	COUNT = 5,
	EUnicornSocialFeatures_MAX = 6
};

// Enum FortniteGame.EHighlightReelIds
enum class EHighlightReelIds : uint8 {
	INVALID = 0,
	MainHighlightReel = 1,
	ShortHighlightReel = 2,
	MicroHighlights = 3,
	EntireGameReel = 4,
	ShortExtendedHighlightReel = 5,
	MediumHighlightReel = 6,
	MediumExtendedHighlightReel = 7,
	ShorterHighlightReel = 8,
	PlayerSpotlightReel = 9,
	PlayerSpotlightNoDeathsReel = 10,
	VATReel = 11,
	COUNT = 12,
	EHighlightReelIds_MAX = 13
};

// Enum FortniteGame.EWrapPreviewGridLockerMode
enum class EWrapPreviewGridLockerMode : uint8 {
	IgnoreLockerConfiguration = 0,
	SupportedWeaponsOnly = 1,
	UnsupportedWeaponsOnly = 2,
	EWrapPreviewGridLockerMode_MAX = 3
};

// ScriptStruct FortniteGame.AircraftFlightInfo
// Size: 0x48 (Inherited: 0x00)
struct FAircraftFlightInfo {
	struct FVector_NetQuantize100 FlightStartLocation; // 0x00(0x18)
	struct FRotator FlightStartRotation; // 0x18(0x18)
	float FlightSpeed; // 0x30(0x04)
	float TimeTillFlightEnd; // 0x34(0x04)
	float TimeTillDropStart; // 0x38(0x04)
	float TimeTillDropEnd; // 0x3c(0x04)
	bool bEjectPlayersAtDropZoneExit; // 0x40(0x01)
	bool bVisiblePostAthenaAircraftPhase; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// ScriptStruct FortniteGame.FortMutatorAudioStinger
// Size: 0x10 (Inherited: 0x00)
struct FFortMutatorAudioStinger {
	struct USoundCue* SoundCue; // 0x00(0x08)
	float LoopTimeBeforeFade; // 0x08(0x04)
	float FadeTime; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.AthenaGameMessageData
// Size: 0x50 (Inherited: 0x00)
struct FAthenaGameMessageData {
	enum class EAthenaGameMsgType MsgType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText MsgText; // 0x08(0x18)
	struct USoundCue* MsgSound; // 0x20(0x08)
	struct UMediaSource* MsgMediaSource; // 0x28(0x08)
	float MsgDelay; // 0x30(0x04)
	bool bIsTeamBased; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	int32_t TeamIndex; // 0x38(0x04)
	float DisplayTime; // 0x3c(0x04)
	enum class EAthenaGameMessageDataFlags MessageFlags; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct APlayerController* TargetPlayerController; // 0x48(0x08)
};

// ScriptStruct FortniteGame.UraniumRoundData
// Size: 0x18 (Inherited: 0x00)
struct FUraniumRoundData {
	int8_t CurrentRoundNumber; // 0x00(0x01)
	int8_t CurrentRoundCheckPoint; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<struct FUraniumSingleRoundInfo> SingleRoundInfos; // 0x08(0x10)
};

// ScriptStruct FortniteGame.UraniumSingleRoundInfo
// Size: 0x30 (Inherited: 0x00)
struct FUraniumSingleRoundInfo {
	char RoundTeamWinner; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText RoundName; // 0x08(0x18)
	struct USoundBase* RoundSound; // 0x20(0x08)
	int32_t PointsForWinning; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.UraniumPOIData
// Size: 0x14 (Inherited: 0x00)
struct FUraniumPOIData {
	struct FGameplayTag POITag; // 0x00(0x04)
	struct TWeakObjectPtr<struct AFortCheckPointSplineActor> SplineActor; // 0x04(0x08)
	struct TWeakObjectPtr<struct ACameraActor> CameraActor; // 0x0c(0x08)
};

// ScriptStruct FortniteGame.PlayerObjectiveTracking
// Size: 0x10 (Inherited: 0x00)
struct FPlayerObjectiveTracking {
	struct TWeakObjectPtr<struct AFortPlayerController> PlayerController; // 0x00(0x08)
	struct UFortQuestObjectiveInfo* CurrentObjectiveToTrack; // 0x08(0x08)
};

// ScriptStruct FortniteGame.QuickBarData
// Size: 0x10 (Inherited: 0x00)
struct FQuickBarData {
	struct TArray<struct FQuickBarSlotData> QuickbarSlots; // 0x00(0x10)
};

// ScriptStruct FortniteGame.QuickBarSlotData
// Size: 0x40 (Inherited: 0x00)
struct FQuickBarSlotData {
	struct TArray<enum class EFortItemType> AcceptedItemTypes; // 0x00(0x10)
	bool bStaticSlot; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TSoftObjectPtr<UFortWorldItemDefinition> DefaultItem; // 0x18(0x28)
};

// ScriptStruct FortniteGame.CumulativeFrameTimeWithoutSleepLimits
// Size: 0x18 (Inherited: 0x00)
struct FCumulativeFrameTimeWithoutSleepLimits {
	double FrameTimeWithoutSleep; // 0x00(0x08)
	double MaxCumulativeFrameTimeAboveThreshold; // 0x08(0x08)
	double MaxNumberOfFramesAboveThreshold; // 0x10(0x08)
};

// ScriptStruct FortniteGame.ItemAndCount
// Size: 0x20 (Inherited: 0x00)
struct FItemAndCount {
	int32_t Count; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UFortItemDefinition* Item; // 0x08(0x08)
	struct FGuid ItemVariantGuid; // 0x10(0x10)
};

// ScriptStruct FortniteGame.HotfixVolumePlacement
// Size: 0x88 (Inherited: 0x08)
struct FHotfixVolumePlacement : FTableRowBase {
	struct FString Map; // 0x08(0x10)
	struct FVector Center; // 0x18(0x18)
	struct FVector Extent; // 0x30(0x18)
	struct FRotator Rotation; // 0x48(0x18)
	struct FString GameInclude; // 0x60(0x10)
	struct FString GameExclude; // 0x70(0x10)
	bool bNeededOnClient; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// ScriptStruct FortniteGame.AthenaStreamIdOverride
// Size: 0x20 (Inherited: 0x00)
struct FAthenaStreamIdOverride {
	struct FString SourceName; // 0x00(0x10)
	struct FString OverriddenId; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortSpawnActorData
// Size: 0x20 (Inherited: 0x00)
struct FFortSpawnActorData {
	struct UFortSpawnActorInfo* SpawnActorInfo; // 0x00(0x08)
	int32_t NumSpawnsRemaining; // 0x08(0x04)
	float TimeUntilNextSpawn; // 0x0c(0x04)
	struct TArray<struct AActor*> SpawnedFortSpawnActors; // 0x10(0x10)
};

// ScriptStruct FortniteGame.AthenaVehicleOverride
// Size: 0x60 (Inherited: 0x00)
struct FAthenaVehicleOverride {
	struct FString RequiredCalendarEvent; // 0x00(0x10)
	struct TSoftClassPtr<UObject> DefaultVehicleClass; // 0x10(0x28)
	struct TSoftClassPtr<UObject> OverrideVehicleClass; // 0x38(0x28)
};

// ScriptStruct FortniteGame.ExitCraftSpawnData
// Size: 0x08 (Inherited: 0x00)
struct FExitCraftSpawnData {
	struct UFortAthenaExitCraftInfo* ExitCraftInfo; // 0x00(0x08)
};

// ScriptStruct FortniteGame.BuildingGameplayActorSpawnData
// Size: 0x14 (Inherited: 0x00)
struct FBuildingGameplayActorSpawnData {
	int32_t BGAIndex; // 0x00(0x04)
	int32_t NumSpawnedBGAs; // 0x04(0x04)
	int32_t NumBGAsToSpawn; // 0x08(0x04)
	float NextSpawnTime; // 0x0c(0x04)
	enum class EBuildingGameplayActorAircraftSpawnSide LastSpawnSide; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.SupplyDropSpawnData
// Size: 0x50 (Inherited: 0x00)
struct FSupplyDropSpawnData {
	struct UFortSupplyDropInfo* SupplyDropInfo; // 0x00(0x08)
	struct FSupplyDropZoneBasedSpawnData ZoneBasedData; // 0x08(0x28)
	struct FSupplyDropItemDeliverySpawnData ItemDeliveryData; // 0x30(0x20)
};

// ScriptStruct FortniteGame.SupplyDropItemDeliverySpawnData
// Size: 0x20 (Inherited: 0x00)
struct FSupplyDropItemDeliverySpawnData {
	int32_t NumItemsToDeliver; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<float> QueuedSpawnTimes; // 0x08(0x10)
	float NextSpawnTime; // 0x18(0x04)
	int32_t NumInitialSpawns; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.SupplyDropZoneBasedSpawnData
// Size: 0x28 (Inherited: 0x00)
struct FSupplyDropZoneBasedSpawnData {
	struct TArray<struct AFortAthenaSupplyDrop*> SpawnedSupplyDrops; // 0x00(0x10)
	int32_t NumDropsRemainingInWave; // 0x10(0x04)
	float NextWaveSpawnTime; // 0x14(0x04)
	float NextSpawnTime; // 0x18(0x04)
	enum class EAthenaGamePhase CurrGamePhase; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	int32_t CurrSubPhase; // 0x20(0x04)
	int32_t TotalSupplyDropsSpawnedInSubPhase; // 0x24(0x04)
};

// ScriptStruct FortniteGame.ScorePlacementTable
// Size: 0xe0 (Inherited: 0x00)
struct FScorePlacementTable {
	struct TArray<float> Solo; // 0x00(0x10)
	struct TArray<float> Duos; // 0x10(0x10)
	struct TArray<float> Squads; // 0x20(0x10)
	struct TArray<float> FiftyFifty; // 0x30(0x10)
	struct TArray<float> LargeTeam; // 0x40(0x10)
	struct TArray<float> MediumTeam; // 0x50(0x10)
	struct TArray<float> QuickSolo; // 0x60(0x10)
	struct TArray<float> QuickDuo; // 0x70(0x10)
	struct TArray<float> QuickSquad; // 0x80(0x10)
	struct TArray<float> QuickLargeTeam; // 0x90(0x10)
	struct TArray<float> QuickTwoTeam; // 0xa0(0x10)
	struct TArray<float> QuickMediumTeam; // 0xb0(0x10)
	struct TArray<float> SinglePlacement; // 0xc0(0x10)
	struct TArray<float> Default; // 0xd0(0x10)
};

// ScriptStruct FortniteGame.GCSettingsOverride
// Size: 0x0c (Inherited: 0x00)
struct FGCSettingsOverride {
	struct FName PlaylistName; // 0x00(0x04)
	bool bEnableGCOnServerDuringMatch; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float GCFrequency; // 0x08(0x04)
};

// ScriptStruct FortniteGame.TimeOfDayOverride
// Size: 0x0c (Inherited: 0x00)
struct FTimeOfDayOverride {
	struct FName PlaylistName; // 0x00(0x04)
	float TimeOfDay; // 0x04(0x04)
	float TimeOfDaySpeed; // 0x08(0x04)
};

// ScriptStruct FortniteGame.EndOfDayRecap
// Size: 0x20 (Inherited: 0x00)
struct FEndOfDayRecap {
	int32_t DayNumber; // 0x00(0x04)
	int32_t TeamScoreAtStartOfDay; // 0x04(0x04)
	int32_t TeamScoreAtEndOfDay; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct FFortPlayerScoreReport> ScoreReports; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortPlayerScoreReport
// Size: 0x2b0 (Inherited: 0x00)
struct FFortPlayerScoreReport {
	struct FUniqueNetIdRepl PlayerId; // 0x00(0x30)
	struct FString PlayerName; // 0x30(0x10)
	struct TWeakObjectPtr<struct AFortPlayerState> PlayerState; // 0x40(0x08)
	enum class EFortTeam PlayerTeam; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	struct FReplicatedStatValues ReplicatedStats_Campaign[0x23]; // 0x4c(0x118)
	struct FReplicatedStatValues ReplicatedStats_Zone[0x23]; // 0x164(0x118)
	int32_t InitialLevel; // 0x27c(0x04)
	int32_t InitialExperienceAmount; // 0x280(0x04)
	struct FFortExperienceDelta ExperienceInfoDelta; // 0x284(0x24)
	int32_t LastExperienceDeltaAmount; // 0x2a8(0x04)
	int32_t LastScoreDeltaAmount; // 0x2ac(0x04)
};

// ScriptStruct FortniteGame.FortExperienceDelta
// Size: 0x24 (Inherited: 0x00)
struct FFortExperienceDelta {
	int32_t Level; // 0x00(0x04)
	int32_t Xp; // 0x04(0x04)
	int32_t BaseXPEarned; // 0x08(0x04)
	int32_t BonusXPEarned; // 0x0c(0x04)
	int32_t BoostXPEarned; // 0x10(0x04)
	int32_t BoostXPMissed; // 0x14(0x04)
	int32_t RestXPEarned; // 0x18(0x04)
	int32_t GroupBoostXPEarned; // 0x1c(0x04)
	enum class EFortIsFinalXpUpdate IsFinalXpUpdate; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
};

// ScriptStruct FortniteGame.ReplicatedStatValues
// Size: 0x08 (Inherited: 0x00)
struct FReplicatedStatValues {
	int32_t StatValue; // 0x00(0x04)
	int32_t ScoreValue; // 0x04(0x04)
};

// ScriptStruct FortniteGame.BuildingContainerDebugInfo
// Size: 0x38 (Inherited: 0x00)
struct FBuildingContainerDebugInfo {
	struct FVector Location; // 0x00(0x18)
	struct FGameplayTagContainer LocationTags; // 0x18(0x20)
};

// ScriptStruct FortniteGame.GameStateLootInfo
// Size: 0x20 (Inherited: 0x00)
struct FGameStateLootInfo {
	struct TArray<struct FFortTreasureChestSpawnInfo> TreasureChestSpawnInfos; // 0x00(0x10)
	struct TArray<struct FFortAmmoBoxSpawnInfo> AmmoBoxSpawnInfos; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortAmmoBoxSpawnInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortAmmoBoxSpawnInfo {
	struct ABuildingContainer* AmmoBoxClass; // 0x00(0x08)
	struct FScalableFloat AmmoBoxMinSpawnPercent; // 0x08(0x28)
	struct FScalableFloat AmmoBoxMaxSpawnPercent; // 0x30(0x28)
	struct FScalableFloat GoldenPoiAmmoBoxMinSpawnPercent; // 0x58(0x28)
	struct FScalableFloat GoldenPoiAmmoBoxMaxSpawnPercent; // 0x80(0x28)
};

// ScriptStruct FortniteGame.FortTreasureChestSpawnInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortTreasureChestSpawnInfo {
	struct ABuildingContainer* TreasureChestClass; // 0x00(0x08)
	struct FScalableFloat TreasureChestMinSpawnPercent; // 0x08(0x28)
	struct FScalableFloat TreasureChestMaxSpawnPercent; // 0x30(0x28)
	struct FScalableFloat GoldenPoiTreasureChestMinSpawnPercent; // 0x58(0x28)
	struct FScalableFloat GoldenPoiTreasureChestMaxSpawnPercent; // 0x80(0x28)
};

// ScriptStruct FortniteGame.AppliedHomebaseData
// Size: 0x30 (Inherited: 0x00)
struct FAppliedHomebaseData {
	struct TWeakObjectPtr<struct UAbilitySystemComponent> Source; // 0x00(0x08)
	struct TWeakObjectPtr<struct UAbilitySystemComponent> Target; // 0x08(0x08)
	struct TArray<struct FActiveGameplayEffectHandle> AppliedEffects; // 0x10(0x10)
	struct TArray<struct FFortAbilitySetHandle> AppliedAbilitySets; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortAbilitySetHandle
// Size: 0x38 (Inherited: 0x00)
struct FFortAbilitySetHandle {
	struct TWeakObjectPtr<struct UAbilitySystemComponent> TargetAbilitySystemComponent; // 0x00(0x08)
	struct TArray<struct FGameplayAbilitySpecHandle> GrantedAbilityHandles; // 0x08(0x10)
	struct TArray<struct FActiveGameplayEffectHandle> AppliedEffectHandles; // 0x18(0x10)
	struct TArray<struct FGuid> ItemGuidsForAdditionalItems; // 0x28(0x10)
};

// ScriptStruct FortniteGame.TeamChangeRequest
// Size: 0x10 (Inherited: 0x00)
struct FTeamChangeRequest {
	struct AFortPlayerController* RequestingController; // 0x00(0x08)
	char DesiredTeam; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct FortniteGame.OnTimeHitInfo
// Size: 0x28 (Inherited: 0x00)
struct FOnTimeHitInfo {
	struct FDelegate TimeCallback; // 0x00(0x0c)
	char pad_C[0x1c]; // 0x0c(0x1c)
};

// ScriptStruct FortniteGame.AdditionalLevelStreamed
// Size: 0x08 (Inherited: 0x00)
struct FAdditionalLevelStreamed {
	struct FName LevelName; // 0x00(0x04)
	bool bIsServerOnly; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct FortniteGame.Voter
// Size: 0x40 (Inherited: 0x00)
struct FVoter {
	int32_t VoteDecision; // 0x00(0x04)
	int32_t LastVoteDecision; // 0x04(0x04)
	struct FUniqueNetIdRepl NetId; // 0x08(0x30)
	int32_t NumVotesCast; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct FortniteGame.TieredWaveSetData
// Size: 0x1c8 (Inherited: 0x00)
struct FTieredWaveSetData {
	int32_t EDOIdx; // 0x00(0x04)
	float BreatherBetweenWaves; // 0x04(0x04)
	enum class EWaveRules WaveRules; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FGameplayTag EnemyTypeToKillMod; // 0x0c(0x04)
	struct TArray<struct TSoftObjectPtr<UFortMissionInfo>> WaveMissions; // 0x10(0x10)
	float WaveLengthMod; // 0x20(0x04)
	float NumKillsMod; // 0x24(0x04)
	float KillPointsMod; // 0x28(0x04)
	float DifficultyAddMod; // 0x2c(0x04)
	bool bDeferTemporaryModifiers; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TSoftClassPtr<UObject> OverrideSpawnPointsMultiplier; // 0x38(0x28)
	struct TSoftClassPtr<UObject> OverrideSpawnPointsCurve; // 0x60(0x28)
	struct TSoftClassPtr<UObject> OverrideSpawnProgression; // 0x88(0x28)
	struct TSoftClassPtr<UObject> OverrideUtilitiesAdjustment; // 0xb0(0x28)
	struct TSoftClassPtr<UObject> OverrideUtilitiesFree; // 0xd8(0x28)
	struct TSoftClassPtr<UObject> OverrideUtilitiesLocked; // 0x100(0x28)
	struct TSoftClassPtr<UObject> OverrideDistance; // 0x128(0x28)
	struct TSoftClassPtr<UObject> OverrideDirectionNumber; // 0x150(0x28)
	struct TSoftClassPtr<UObject> OverrideModifierTags; // 0x178(0x28)
	struct TSoftClassPtr<UObject> OverrideTimedModifierTags; // 0x1a0(0x28)
};

// ScriptStruct FortniteGame.ActiveGameplayModifierHandle
// Size: 0x04 (Inherited: 0x00)
struct FActiveGameplayModifierHandle {
	int32_t Handle; // 0x00(0x04)
};

// ScriptStruct FortniteGame.FortVoteConfig
// Size: 0x14 (Inherited: 0x00)
struct FFortVoteConfig {
	int32_t NumVoteOptions; // 0x00(0x04)
	float VoteDuration; // 0x04(0x04)
	float FailedVoteLockOutDuration; // 0x08(0x04)
	int32_t MaxVotesAllowedPerPlayer; // 0x0c(0x04)
	enum class EFortVoteArbitratorType VoteArbitratorType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.FortAIDirectorEvent
// Size: 0x20 (Inherited: 0x00)
struct FFortAIDirectorEvent {
	enum class EFortAIDirectorEvent event; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* EventSource; // 0x08(0x08)
	struct UObject* EventTarget; // 0x10(0x08)
	float EventValue; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.VoteData
// Size: 0x80 (Inherited: 0x00)
struct FVoteData {
	enum class EFortVoteType VoteType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FUniqueNetIdRepl VoteInstigatorNetId; // 0x08(0x30)
	struct FFortVoteConfig VoteConfig; // 0x38(0x14)
	float VoteStartTime; // 0x4c(0x04)
	float VoteEndTime; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<struct FVoter> Voters; // 0x58(0x10)
	int32_t NumVotersWithMaxVotes; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FTimerHandle EndVoteTimerHandle; // 0x70(0x08)
	enum class EFortVoteStatus VoteStatus; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// ScriptStruct FortniteGame.PlayerBuildableClassContainer
// Size: 0x10 (Inherited: 0x00)
struct FPlayerBuildableClassContainer {
	struct TArray<struct ABuildingSMActor*> BuildingClasses; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortZoneMissionAlertData
// Size: 0x30 (Inherited: 0x00)
struct FFortZoneMissionAlertData {
	struct TArray<struct FFortItemQuantityPair> MissionAlertRewards; // 0x00(0x10)
	struct FString MissionAlertCategoryName; // 0x10(0x10)
	struct FString MissionAlertID; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortItemQuantityPair
// Size: 0x0c (Inherited: 0x00)
struct FFortItemQuantityPair {
	struct FPrimaryAssetId ItemPrimaryAssetId; // 0x00(0x08)
	int32_t Quantity; // 0x08(0x04)
};

// ScriptStruct FortniteGame.FortZoneDifficultyIncreaseRewardData
// Size: 0x10 (Inherited: 0x00)
struct FFortZoneDifficultyIncreaseRewardData {
	struct TArray<struct FFortItemQuantityPair> Rewards; // 0x00(0x10)
};

// ScriptStruct FortniteGame.ActiveGameplayModifierArray
// Size: 0x130 (Inherited: 0x108)
struct FActiveGameplayModifierArray : FFastArraySerializer {
	struct TArray<struct FActiveGameplayModifier> Items; // 0x108(0x10)
	struct TArray<struct FActiveGameplayModifier> DeferredGameplayModifiers; // 0x118(0x10)
	int32_t ModifierHandleGenerator; // 0x128(0x04)
	bool bSupportRuntimeModifierShutdown; // 0x12c(0x01)
	char pad_12D[0x3]; // 0x12d(0x03)
};

// ScriptStruct FortniteGame.ActiveGameplayModifier
// Size: 0xd8 (Inherited: 0x0c)
struct FActiveGameplayModifier : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct UFortGameplayModifierItemDefinition* ModifierDef; // 0x10(0x08)
	struct FActiveGameplayModifierHandle ModifierHandle; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct AFortGameplayMutator*> Mutators; // 0x20(0x10)
	int32_t Expiration; // 0x30(0x04)
	char pad_34[0xa4]; // 0x34(0xa4)
};

// ScriptStruct FortniteGame.ReplicatedMontageMap
// Size: 0x18 (Inherited: 0x00)
struct FReplicatedMontageMap {
	struct TArray<struct FReplicatedMontageIndexPair> Mappings; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct FortniteGame.ReplicatedMontageIndexPair
// Size: 0x10 (Inherited: 0x00)
struct FReplicatedMontageIndexPair {
	struct UAnimMontage* Montage; // 0x00(0x08)
	int32_t Index; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.EvaluationResult
// Size: 0x30 (Inherited: 0x00)
struct FEvaluationResult {
	bool bSucceeded; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ErrorCode; // 0x08(0x10)
	struct FText ErrorMessage; // 0x18(0x18)
};

// ScriptStruct FortniteGame.DBNOCustomSettings
// Size: 0x2c (Inherited: 0x00)
struct FDBNOCustomSettings {
	enum class EDBNOMutatorType Enabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float TenacityDepletionRate; // 0x04(0x04)
	float ReviveHealthPercentage; // 0x08(0x04)
	bool bAllowRevives; // 0x0c(0x01)
	bool bAllowCarry; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	float TimeToRevive; // 0x10(0x04)
	bool bAlertTeam; // 0x14(0x01)
	bool LastManStandingMode; // 0x15(0x01)
	bool bAllowInterrogation; // 0x16(0x01)
	bool bAllowInterrogationReveal; // 0x17(0x01)
	int32_t SelectedTeam; // 0x18(0x04)
	bool bTeamAffectsAllButSelected; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	int32_t SelectedClass; // 0x20(0x04)
	bool bClassAffectsAllButSelected; // 0x24(0x01)
	enum class ETenacityType TenacityType; // 0x25(0x01)
	char pad_26[0x2]; // 0x26(0x02)
	float TenacityAmount; // 0x28(0x04)
};

// ScriptStruct FortniteGame.PlayersLeft
// Size: 0x0c (Inherited: 0x00)
struct FPlayersLeft {
	int32_t Humans; // 0x00(0x04)
	int32_t Bots; // 0x04(0x04)
	int32_t Total; // 0x08(0x04)
};

// ScriptStruct FortniteGame.TotalPlayers
// Size: 0x0c (Inherited: 0x00)
struct FTotalPlayers {
	int32_t Humans; // 0x00(0x04)
	int32_t Bots; // 0x04(0x04)
	int32_t Total; // 0x08(0x04)
};

// ScriptStruct FortniteGame.SpawnMachineRepDataArray
// Size: 0x120 (Inherited: 0x108)
struct FSpawnMachineRepDataArray : FFastArraySerializer {
	struct TArray<struct FSpawnMachineRepData> SpawnMachineRepDataArray; // 0x108(0x10)
	struct AFortGameStateAthena* OwningGameState; // 0x118(0x08)
};

// ScriptStruct FortniteGame.SpawnMachineRepData
// Size: 0x38 (Inherited: 0x0c)
struct FSpawnMachineRepData : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct FVector Location; // 0x10(0x18)
	enum class ESpawnMachineState SpawnMachineState; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float SpawnMachineCooldownStartTime; // 0x2c(0x04)
	float SpawnMachineCooldownEndTime; // 0x30(0x04)
	int32_t SpawnMachineRepDataHandle; // 0x34(0x04)
};

// ScriptStruct FortniteGame.MeshNetworkStatus
// Size: 0x03 (Inherited: 0x00)
struct FMeshNetworkStatus {
	bool bEnabled; // 0x00(0x01)
	bool bConnectedToRoot; // 0x01(0x01)
	enum class EMeshNetworkNodeType GameServerNodeType; // 0x02(0x01)
};

// ScriptStruct FortniteGame.GameplayMutatorObjectDataArray
// Size: 0x118 (Inherited: 0x108)
struct FGameplayMutatorObjectDataArray : FFastArraySerializer {
	struct TArray<struct FGameplayMutatorObjectData> ObjectDataList; // 0x108(0x10)
};

// ScriptStruct FortniteGame.GameplayMutatorObjectData
// Size: 0x28 (Inherited: 0x0c)
struct FGameplayMutatorObjectData : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct UObject* TheObject; // 0x10(0x08)
	int32_t ObjectId; // 0x18(0x04)
	int32_t ObjectValue1; // 0x1c(0x04)
	int32_t ObjectValue2; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct FortniteGame.GameplayMutatorEventData
// Size: 0x10 (Inherited: 0x00)
struct FGameplayMutatorEventData {
	int32_t EventId; // 0x00(0x04)
	int32_t EventParam1; // 0x04(0x04)
	int32_t EventParam2; // 0x08(0x04)
	int32_t EventParam3; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.PlaylistPropertyArray
// Size: 0x1e8 (Inherited: 0x108)
struct FPlaylistPropertyArray : FFastArraySerializer {
	struct TArray<struct FPropertyOverride> PropertyOverrides; // 0x108(0x10)
	int32_t PlaylistReplicationKey; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UFortPlaylistAthena* BasePlaylist; // 0x120(0x08)
	struct UFortPlaylistAthena* OverridePlaylist; // 0x128(0x08)
	struct TMap<struct FString, struct FPropertyOverrideScope> PropertyOverrideScopes; // 0x130(0x50)
	char pad_180[0x68]; // 0x180(0x68)
};

// ScriptStruct FortniteGame.PropertyOverrideScope
// Size: 0x10 (Inherited: 0x00)
struct FPropertyOverrideScope {
	struct TArray<struct FPropertyOverride> PropertyOverrides; // 0x00(0x10)
};

// ScriptStruct FortniteGame.PropertyOverride
// Size: 0x40 (Inherited: 0x0c)
struct FPropertyOverride : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString PropertyScope; // 0x10(0x10)
	struct FString PropertyName; // 0x20(0x10)
	struct FString PropertyData; // 0x30(0x10)
};

// ScriptStruct FortniteGame.AIPawnCustomizationPreloadData
// Size: 0x10 (Inherited: 0x00)
struct FAIPawnCustomizationPreloadData {
	float Priority; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UFortAIPawnCustomizationDefinition* Customization; // 0x08(0x08)
};

// ScriptStruct FortniteGame.AICharacterPartsPreloadData
// Size: 0x10 (Inherited: 0x00)
struct FAICharacterPartsPreloadData {
	float Priority; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UCustomCharacterPart* CharacterPart; // 0x08(0x08)
};

// ScriptStruct FortniteGame.DynamicLandData
// Size: 0xf0 (Inherited: 0x00)
struct FDynamicLandData {
	struct FName Name; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FVector WorldPosition; // 0x08(0x18)
	float Rotation; // 0x20(0x04)
	char pad_24[0xc]; // 0x24(0x0c)
	struct FSlateBrush LandBrush; // 0x30(0xc0)
};

// ScriptStruct FortniteGame.GameMemberInfoArray
// Size: 0x120 (Inherited: 0x108)
struct FGameMemberInfoArray : FFastArraySerializer {
	struct TArray<struct FGameMemberInfo> Members; // 0x108(0x10)
	struct AFortGameStateAthena* OwningGameState; // 0x118(0x08)
};

// ScriptStruct FortniteGame.GameMemberInfo
// Size: 0x40 (Inherited: 0x0c)
struct FGameMemberInfo : FFastArraySerializerItem {
	char SquadId; // 0x0c(0x01)
	char TeamIndex; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	struct FUniqueNetIdRepl MemberUniqueId; // 0x10(0x30)
};

// ScriptStruct FortniteGame.FortWinnerPlayerData
// Size: 0x04 (Inherited: 0x00)
struct FFortWinnerPlayerData {
	int32_t PlayerId; // 0x00(0x04)
};

// ScriptStruct FortniteGame.StormCapDamageThresholdInfo
// Size: 0x08 (Inherited: 0x00)
struct FStormCapDamageThresholdInfo {
	float ThresholdFloor; // 0x00(0x04)
	float ThresholdCeiling; // 0x04(0x04)
};

// ScriptStruct FortniteGame.FortItemEntry
// Size: 0x1a0 (Inherited: 0x0c)
struct FFortItemEntry : FFastArraySerializerItem {
	int32_t Count; // 0x0c(0x04)
	int32_t PreviousCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UFortItemDefinition* ItemDefinition; // 0x18(0x08)
	int16_t OrderIndex; // 0x20(0x02)
	char pad_22[0x2]; // 0x22(0x02)
	float Durability; // 0x24(0x04)
	int32_t Level; // 0x28(0x04)
	int32_t LoadedAmmo; // 0x2c(0x04)
	int32_t PhantomReserveAmmo; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<struct FString> AlterationDefinitions; // 0x38(0x10)
	struct TArray<struct FFortSavedWeaponModSlot> SavedWeaponModSlots; // 0x48(0x10)
	struct FString ItemSource; // 0x58(0x10)
	struct FGuid ItemGuid; // 0x68(0x10)
	struct FGuid TrackerGuid; // 0x78(0x10)
	struct FGuid ItemVariantGuid; // 0x88(0x10)
	int32_t ControlOverride; // 0x98(0x04)
	bool inventory_overflow_date; // 0x9c(0x01)
	bool bWasGifted; // 0x9d(0x01)
	bool bIsReplicatedCopy; // 0x9e(0x01)
	bool bIsDirty; // 0x9f(0x01)
	bool bUpdateStatsOnCollection; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
	struct FFortGiftingInfo GiftingInfo; // 0xa8(0x28)
	struct TArray<struct FFortItemEntryStateValue> StateValues; // 0xd0(0x10)
	struct TWeakObjectPtr<struct AFortInventory> ParentInventory; // 0xe0(0x08)
	struct FGameplayAbilitySpecHandle GameplayAbilitySpecHandle; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TArray<struct UFortAlterationItemDefinition*> AlterationInstances; // 0xf0(0x10)
	struct TArray<struct FFortWeaponModSlot> WeaponModSlots; // 0x100(0x10)
	struct TSoftObjectPtr<UAthenaItemWrapDefinition> WrapOverride; // 0x110(0x28)
	struct TArray<float> GenericAttributeValues; // 0x138(0x10)
	char pad_148[0x50]; // 0x148(0x50)
	int32_t PickupVariantIndex; // 0x198(0x04)
	int32_t ItemVariantDataMappingIndex; // 0x19c(0x04)
};

// ScriptStruct FortniteGame.FortWeaponModSlot
// Size: 0x10 (Inherited: 0x00)
struct FFortWeaponModSlot {
	struct UFortWeaponModItemDefinition* WeaponMod; // 0x00(0x08)
	bool bIsDynamic; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct FortniteGame.FortItemEntryStateValue
// Size: 0x0c (Inherited: 0x00)
struct FFortItemEntryStateValue {
	int32_t IntValue; // 0x00(0x04)
	struct FName NameValue; // 0x04(0x04)
	enum class EFortItemEntryState StateType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct FortniteGame.FortGiftingInfo
// Size: 0x28 (Inherited: 0x00)
struct FFortGiftingInfo {
	struct FString PlayerName; // 0x00(0x10)
	struct UFortHeroType* HeroType; // 0x10(0x08)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct FortniteGame.FortSavedWeaponModSlot
// Size: 0x18 (Inherited: 0x00)
struct FFortSavedWeaponModSlot {
	struct FString WeaponModTemplateID; // 0x00(0x10)
	bool bIsDynamic; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct FortniteGame.CosmeticVariantInfo
// Size: 0x08 (Inherited: 0x00)
struct FCosmeticVariantInfo {
	struct FGameplayTag VariantChannelTag; // 0x00(0x04)
	struct FGameplayTag ActiveVariantTag; // 0x04(0x04)
};

// ScriptStruct FortniteGame.McpVariantChannelInfo
// Size: 0x40 (Inherited: 0x08)
struct FMcpVariantChannelInfo : FCosmeticVariantInfo {
	struct FGameplayTagContainer OwnedVariantTags; // 0x08(0x20)
	struct UFortItemDefinition* ItemVariantIsUsedFor; // 0x28(0x08)
	struct FString CustomData; // 0x30(0x10)
};

// ScriptStruct FortniteGame.ChoiceData
// Size: 0x30 (Inherited: 0x00)
struct FChoiceData {
	int32_t MenuIdentifier; // 0x00(0x04)
	bool bShowCloseButton; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct FText Title; // 0x08(0x18)
	struct TArray<struct FChoiceDataEntry> Items; // 0x20(0x10)
};

// ScriptStruct FortniteGame.ChoiceDataEntry
// Size: 0x50 (Inherited: 0x00)
struct FChoiceDataEntry {
	struct FText ButtonText; // 0x00(0x18)
	struct FText ButtonDescription; // 0x18(0x18)
	struct FText ConfirmText; // 0x30(0x18)
	bool bEnabled; // 0x48(0x01)
	bool bRequireConfirmation; // 0x49(0x01)
	bool bCloseAfterSelection; // 0x4a(0x01)
	char pad_4B[0x5]; // 0x4b(0x05)
};

// ScriptStruct FortniteGame.AttributeModifierInfo
// Size: 0x20 (Inherited: 0x00)
struct FAttributeModifierInfo {
	char pad_0[0x8]; // 0x00(0x08)
	struct UGameplayEffect* InstantGEs; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct FortniteGame.BuildingWeakSpotData
// Size: 0x50 (Inherited: 0x00)
struct FBuildingWeakSpotData {
	struct TWeakObjectPtr<struct UObject> ParentObject; // 0x00(0x08)
	struct FVector_NetQuantizeNormal Normal; // 0x08(0x18)
	struct FVector_NetQuantize10 Position; // 0x20(0x18)
	int32_t HitCount; // 0x38(0x04)
	char pad_3C[0x14]; // 0x3c(0x14)
};

// ScriptStruct FortniteGame.VoiceChatDistanceAttenuationSettings
// Size: 0x98 (Inherited: 0x00)
struct FVoiceChatDistanceAttenuationSettings {
	struct FVector2D DistanceRange; // 0x00(0x10)
	struct FRuntimeFloatCurve AttenuationCurve; // 0x10(0x88)
};

// ScriptStruct FortniteGame.FortRequirementsInfo
// Size: 0x60 (Inherited: 0x00)
struct FFortRequirementsInfo {
	int32_t CommanderLevel; // 0x00(0x04)
	int32_t PersonalPowerRating; // 0x04(0x04)
	int32_t MaxPersonalPowerRating; // 0x08(0x04)
	int32_t PartyPowerRating; // 0x0c(0x04)
	int32_t MaxPartyPowerRating; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct UFortQuestItemDefinition*> ActiveQuestDefinitions; // 0x18(0x10)
	struct UFortQuestItemDefinition* QuestDefinition; // 0x28(0x08)
	struct FDataTableRowHandle ObjectiveStatHandle; // 0x30(0x10)
	struct UFortQuestItemDefinition* UncompletedQuestDefinition; // 0x40(0x08)
	struct UFortItemDefinition* ItemDefinition; // 0x48(0x08)
	struct FString EventFlag; // 0x50(0x10)
};

// ScriptStruct FortniteGame.CreateBuildingActorData
// Size: 0x50 (Inherited: 0x00)
struct FCreateBuildingActorData {
	uint32_t BuildingClassHandle; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FVector_NetQuantize10 BuildLoc; // 0x08(0x18)
	struct FRotator BuildRot; // 0x20(0x18)
	bool bMirrored; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float SyncKey; // 0x3c(0x04)
	struct FBuildingClassData BuildingClassData; // 0x40(0x10)
};

// ScriptStruct FortniteGame.BuildingClassData
// Size: 0x10 (Inherited: 0x00)
struct FBuildingClassData {
	struct ABuildingActor* BuildingClass; // 0x00(0x08)
	int32_t PreviousBuildingLevel; // 0x08(0x04)
	char UpgradeLevel; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct FortniteGame.FortRebootEligiblePartyFriendInfo
// Size: 0x38 (Inherited: 0x00)
struct FFortRebootEligiblePartyFriendInfo {
	struct FUniqueNetIdRepl UserId; // 0x00(0x30)
	bool bIsPlatformFriend; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct FortniteGame.FortGameplayEventContainer
// Size: 0x18 (Inherited: 0x00)
struct FFortGameplayEventContainer {
	char pad_0[0x8]; // 0x00(0x08)
	struct TArray<struct FFortGameplayEventReference> EventRefs; // 0x08(0x10)
};

// ScriptStruct FortniteGame.FortGameplayEventReference
// Size: 0x38 (Inherited: 0x00)
struct FFortGameplayEventReference {
	struct FFortGameplayEventObjectHandle ObjectHandle; // 0x00(0x30)
	enum class EFortGameplayEventReferenceType EventRefType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FName EventRefMemberName; // 0x34(0x04)
};

// ScriptStruct FortniteGame.FortGameplayEventObjectHandle
// Size: 0x30 (Inherited: 0x00)
struct FFortGameplayEventObjectHandle {
	struct TSoftObjectPtr<UObject> ObjectRef; // 0x00(0x28)
	int32_t ObjectTrackingGUID; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.FortGameplayEventContainer_Named
// Size: 0x20 (Inherited: 0x18)
struct FFortGameplayEventContainer_Named : FFortGameplayEventContainer {
	struct FName EventName; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.FortPickupTossOverrideData
// Size: 0x10 (Inherited: 0x00)
struct FFortPickupTossOverrideData {
	bool bIsValid; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MinTossDist; // 0x04(0x04)
	float MaxTossDist; // 0x08(0x04)
	float SpawnDirectionConeHalfAngle; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.FortMcpCollectedItemProperties
// Size: 0x48 (Inherited: 0x00)
struct FFortMcpCollectedItemProperties {
	struct FString VariantTag; // 0x00(0x10)
	struct TArray<struct FString> ContextTags; // 0x10(0x10)
	struct FJsonObjectWrapper Properties; // 0x20(0x20)
	enum class EFortCollectedState SeenState; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t Count; // 0x44(0x04)
};

// ScriptStruct FortniteGame.ItemVariantHandle
// Size: 0x18 (Inherited: 0x00)
struct FItemVariantHandle {
	struct UFortItemDefinition* Item; // 0x00(0x08)
	struct FGuid ItemVariantGuid; // 0x08(0x10)
};

// ScriptStruct FortniteGame.LockOnInfo
// Size: 0x50 (Inherited: 0x00)
struct FLockOnInfo {
	enum class ELockOnState State; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct TWeakObjectPtr<struct AFortWeapon> Weapon; // 0x04(0x08)
	struct TWeakObjectPtr<struct AActor> LockOnTarget; // 0x0c(0x08)
	char pad_14[0x4]; // 0x14(0x04)
	struct FRotator CamRotAtTargetAcquisiton; // 0x18(0x18)
	struct FVector2D LockOnCoords; // 0x30(0x10)
	float TargetAcquisitionTime; // 0x40(0x04)
	float TargetLockOnTime; // 0x44(0x04)
	float TargetOutOfSightTime; // 0x48(0x04)
	float CooldownStartTime; // 0x4c(0x04)
};

// ScriptStruct FortniteGame.FortPersistentGameplayStatContainer
// Size: 0x10 (Inherited: 0x00)
struct FFortPersistentGameplayStatContainer {
	struct TArray<struct FFortPersistentGameplayStatValue> GameplayStats; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortPersistentGameplayStatValue
// Size: 0x18 (Inherited: 0x00)
struct FFortPersistentGameplayStatValue {
	struct FString StatName; // 0x00(0x10)
	int32_t StatValue; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct FortniteGame.FortUpdatedObjectiveStat
// Size: 0x20 (Inherited: 0x00)
struct FFortUpdatedObjectiveStat {
	struct UFortQuestItemDefinition* Quest; // 0x00(0x08)
	struct FName BackendName; // 0x08(0x04)
	int32_t StatValue; // 0x0c(0x04)
	int32_t ShadowStatValue; // 0x10(0x04)
	int32_t StatDelta; // 0x14(0x04)
	int32_t CurrentStage; // 0x18(0x04)
	bool bSharedQuestUpdate; // 0x1c(0x01)
	bool bShowToast; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
};

// ScriptStruct FortniteGame.FortRewardReport
// Size: 0x70 (Inherited: 0x00)
struct FFortRewardReport {
	struct FText MissionName; // 0x00(0x18)
	struct FText TheaterName; // 0x18(0x18)
	struct FText Difficulty; // 0x30(0x18)
	float DifficultyValue; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FFortRewardActivity> RewardActivities; // 0x50(0x10)
	bool bIsFinalized; // 0x60(0x01)
	char pad_61[0xf]; // 0x61(0x0f)
};

// ScriptStruct FortniteGame.FortRewardActivity
// Size: 0x78 (Inherited: 0x00)
struct FFortRewardActivity {
	enum class EFortRewardActivityType ActivityType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FGuid ActivityGuid; // 0x04(0x10)
	char pad_14[0x4]; // 0x14(0x04)
	struct FText TitleText; // 0x18(0x18)
	struct FText DescriptionText; // 0x30(0x18)
	float RewardDisplayTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FFortItemEntry> RewardItems; // 0x50(0x10)
	struct TArray<struct FFortItemEntry> MissedRewardItems; // 0x60(0x10)
	enum class EFortCompletionResult ActivityCompletionResult; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	int32_t AdditionalCompletionMissionPoints; // 0x74(0x04)
};

// ScriptStruct FortniteGame.FortAthenaLoadout
// Size: 0x168 (Inherited: 0x00)
struct FFortAthenaLoadout {
	char pad_0[0x10]; // 0x00(0x10)
	struct FString BannerIconId; // 0x10(0x10)
	struct FString BannerColorId; // 0x20(0x10)
	struct UAthenaSkyDiveContrailItemDefinition* SkyDiveContrail; // 0x30(0x08)
	struct UAthenaGliderItemDefinition* Glider; // 0x38(0x08)
	struct UAthenaPickaxeItemDefinition* Pickaxe; // 0x40(0x08)
	bool bIsDefaultCharacter; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct UAthenaCharacterItemDefinition* Character; // 0x50(0x08)
	struct TArray<struct FMcpVariantChannelInfo> CharacterVariantChannels; // 0x58(0x10)
	bool bForceUpdateVariants; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UAthenaHatItemDefinition* Hat; // 0x70(0x08)
	struct UAthenaBackpackItemDefinition* Backpack; // 0x78(0x08)
	struct UAthenaLoadingScreenItemDefinition* LoadingScreen; // 0x80(0x08)
	struct UAthenaBattleBusItemDefinition* BattleBus; // 0x88(0x08)
	struct UAthenaVehicleCosmeticItemDefinition* VehicleDecoration; // 0x90(0x08)
	struct UAthenaCallingCardItemDefinition* CallingCard; // 0x98(0x08)
	struct UAthenaMapMarkerItemDefinition* MapMarker; // 0xa0(0x08)
	struct TArray<struct UAthenaDanceItemDefinition*> Dances; // 0xa8(0x10)
	struct UAthenaVictoryPoseItemDefinition* VictoryPose; // 0xb8(0x08)
	struct UAthenaMusicPackItemDefinition* MusicPack; // 0xc0(0x08)
	struct UAthenaItemWrapDefinition* ItemWrapOverride; // 0xc8(0x08)
	struct TArray<struct UAthenaItemWrapDefinition*> ItemWraps; // 0xd0(0x10)
	struct UAthenaCharmItemDefinition* CharmOverride; // 0xe0(0x08)
	struct TArray<struct UAthenaCharmItemDefinition*> Charms; // 0xe8(0x10)
	struct UAthenaPetItemDefinition* PetSkin; // 0xf8(0x08)
	char pad_100[0x8]; // 0x100(0x08)
	struct UFortMcpProfileAthena* CachedProfileSource; // 0x108(0x08)
	char pad_110[0x58]; // 0x110(0x58)
};

// ScriptStruct FortniteGame.QueuedItemsToDropViaPickup
// Size: 0x20 (Inherited: 0x00)
struct FQueuedItemsToDropViaPickup {
	struct AFortPawn* DestructionPawn; // 0x00(0x08)
	int32_t TotalNumItemsToDrop; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct UFortWorldItem*> ItemsToDrop; // 0x10(0x10)
};

// ScriptStruct FortniteGame.DelayedQuickBarActionContainer
// Size: 0x120 (Inherited: 0x108)
struct FDelayedQuickBarActionContainer : FFastArraySerializer {
	struct TArray<struct FDelayedQuickBarAction> Items; // 0x108(0x10)
	char pad_118[0x8]; // 0x118(0x08)
};

// ScriptStruct FortniteGame.DelayedQuickBarAction
// Size: 0x38 (Inherited: 0x0c)
struct FDelayedQuickBarAction : FFastArraySerializerItem {
	uint32_t ActionId; // 0x0c(0x04)
	enum class EFortDelayedQuickBarAction Action; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FGuid ItemGuid; // 0x14(0x10)
	struct FPrimaryAssetId ItemDefinitionAssetId; // 0x24(0x08)
	enum class EFortQuickBars QuickBarType; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	int32_t QuickBarSlot; // 0x30(0x04)
	bool bForceExecution; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
};

// ScriptStruct FortniteGame.RecentlyRemovedQuickbarInfo
// Size: 0x20 (Inherited: 0x00)
struct FRecentlyRemovedQuickbarInfo {
	struct FGuid ItemGuid; // 0x00(0x10)
	int32_t RemovedFromSlot; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UFortItemDefinition* ItemDefinition; // 0x18(0x08)
};

// ScriptStruct FortniteGame.FortDamageNumberInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortDamageNumberInfo {
	struct FVector WorldLocation; // 0x00(0x18)
	struct FVector HitNormal; // 0x18(0x18)
	bool bIsCriticalDamage; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	int32_t Damage; // 0x34(0x04)
	enum class EFortDamageNumberType DamageNumberType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float VisualDamageScale; // 0x3c(0x04)
	enum class EFortElementalDamageType ElementalDamageType; // 0x40(0x01)
	enum class EStatCategory ScoreType; // 0x41(0x01)
	bool bAttachScoreNumberToPlayer; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x48(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> MeshMIDs; // 0x50(0x10)
	float MeshMIDMoveToCameraValue; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<int32_t> DamageNumberArray; // 0x68(0x10)
	struct FGameplayTagContainer DamagedActorTags; // 0x78(0x20)
	struct TWeakObjectPtr<struct AActor> DamagedActor; // 0x98(0x08)
	struct TWeakObjectPtr<struct APawn> DamageCauser; // 0xa0(0x08)
};

// ScriptStruct FortniteGame.LastBuildableState
// Size: 0x10 (Inherited: 0x00)
struct FLastBuildableState {
	struct UBuildingEditModeMetadata* LastBuildableMetaData; // 0x00(0x08)
	bool LastBuildableMirrored; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32_t LastBuildableRotationIterations; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.AIDirectorDebugInfo
// Size: 0x28 (Inherited: 0x00)
struct FAIDirectorDebugInfo {
	float Timestamp; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<float> DebugGraphData; // 0x08(0x10)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct FortniteGame.VehicleTrickInfo
// Size: 0x198 (Inherited: 0x00)
