// AnimBlueprintGeneratedClass Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C
// Size: 0x4858 (Inherited: 0xb30)
struct UFortnite_Player_LowerBodyJog_AnimBP_C : UFortWalkAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xb30(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xb38(0x250)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xd88(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xd90(0x08)
	struct FAnimNode_Root ; // 0xd98(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xdb8(0xc0)
	struct FAnimNode_Root ; // 0xe78(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xe98(0xc0)
	struct FAnimNode_Root ; // 0xf58(0x20)
	struct FAnimNode_Root ; // 0xf78(0x20)
	struct FAnimNode_Root ; // 0xf98(0x20)
	struct FAnimNode_Root ; // 0xfb8(0x20)
	struct FAnimNode_Root ; // 0xfd8(0x20)
	struct FAnimNode_Root ; // 0xff8(0x20)
	struct FAnimNode_Root ; // 0x1018(0x20)
	struct FAnimNode_Root ; // 0x1038(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1058(0xc0)
	struct FAnimNode_Root ; // 0x1118(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1138(0xc0)
	struct FAnimNode_Root ; // 0x11f8(0x20)
	struct FAnimNode_Root ; // 0x1218(0x20)
	struct FAnimNode_Root ; // 0x1238(0x20)
	struct FAnimNode_Root ; // 0x1258(0x20)
	struct FAnimNode_Root ; // 0x1278(0x20)
	struct FAnimNode_Root ; // 0x1298(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x12b8(0xc0)
	struct FAnimNode_Root ; // 0x1378(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1398(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1458(0xc0)
	struct FAnimNode_Root ; // 0x1518(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1538(0xc0)
	struct FAnimNode_Root ; // 0x15f8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1618(0xc0)
	struct FAnimNode_Root ; // 0x16d8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x16f8(0x68)
	struct FAnimNode_Root ; // 0x1760(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1780(0x48)
	struct FAnimNode_RotateRootBone ; // 0x17c8(0xa8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1870(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x18d8(0x68)
	struct FAnimNode_Root ; // 0x1940(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x1960(0x68)
	struct FAnimNode_RotateRootBone ; // 0x19c8(0xa8)
	struct FFortAnimNode_SpeedWarping ; // 0x1a70(0x200)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x1c70(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x1c90(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1cb0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x1cf8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1d60(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1dc8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x1e10(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1e78(0x48)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1ec0(0x20)
	struct FAnimNode_TransitionResult ; // 0x1ee0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f08(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f30(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f58(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f80(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fa8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ff8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2020(0x28)
	struct FAnimNode_TransitionResult ; // 0x2048(0x28)
	struct FAnimNode_TransitionResult ; // 0x2070(0x28)
	struct FAnimNode_TransitionResult ; // 0x2098(0x28)
	struct FAnimNode_TransitionResult ; // 0x20c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x20e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2110(0x28)
	struct FAnimNode_TransitionResult ; // 0x2138(0x28)
	struct FAnimNode_TransitionResult ; // 0x2160(0x28)
	struct FAnimNode_TransitionResult ; // 0x2188(0x28)
	struct FAnimNode_TransitionResult ; // 0x21b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x21d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2200(0x28)
	struct FAnimNode_TransitionResult ; // 0x2228(0x28)
	struct FAnimNode_TransitionResult ; // 0x2250(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2278(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x22a0(0x48)
	struct FAnimNode_RotateRootBone ; // 0x22e8(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x2390(0x40)
	struct FAnimNode_SequencePlayer ; // 0x23d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2410(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2450(0x40)
	struct FAnimNode_StateResult ; // 0x2490(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x24b0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x24f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2518(0x20)
	struct FFortAnimNode_SpeedWarping ; // 0x2538(0x200)
	struct FAnimNode_SequencePlayer ; // 0x2738(0x40)
	struct FAnimNode_RotateRootBone ; // 0x2778(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x2820(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x28c8(0xa8)
	struct FAnimNode_RotateRootBone ; // 0x2970(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x2a18(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2a58(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2a98(0x40)
	struct FAnimNode_StateResult ; // 0x2ad8(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x2af8(0x48)
	struct FAnimNode_RotateRootBone ; // 0x2b40(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x2be8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c28(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c68(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2ca8(0x40)
	struct FAnimNode_StateResult ; // 0x2ce8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2d08(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2d28(0x20)
	struct FAnimNode_ModifyBone ; // 0x2d48(0x128)
	struct FAnimNode_BlendListByEnum ; // 0x2e70(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2eb8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2f00(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2f40(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2f80(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2fc0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3000(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3040(0xe0)
	struct FAnimNode_RotateRootBone ; // 0x3120(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x31c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3208(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3248(0x40)
	struct FAnimNode_StateResult ; // 0x3288(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x32a8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x32c8(0x20)
	struct FAnimNode_ModifyBone ; // 0x32e8(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3410(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3430(0x20)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x3450(0x200)
	struct FAnimNode_SequencePlayer ; // 0x3650(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3690(0x48)
	struct FAnimNode_SequencePlayer ; // 0x36d8(0x40)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3718(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x37d8(0x40)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3818(0xa8)
	struct FAnimNode_StateResult ; // 0x38c0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x38e0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3908(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3948(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3988(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x39d0(0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3a98(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3ab8(0x20)
	struct FAnimNode_ModifyBone ; // 0x3ad8(0x128)
	struct FAnimNode_StateResult ; // 0x3c00(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3c20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3c48(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3c70(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3cb8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3cd8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3cf8(0x128)
	struct FAnimNode_StateResult ; // 0x3e20(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x3e40(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x3f08(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3fd0(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x4098(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4160(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x41c8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4230(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4278(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4340(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4388(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x43d0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x43f0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x44b8(0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x45b8(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x46b8(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4778(0xc0)
	double JogStartPosition; // 0x4838(0x08)
	double CrouchPlayRate; // 0x4840(0x08)
	double PivotAnimBlendTime; // 0x4848(0x08)
	double StartAnimBlendTime; // 0x4850(0x08)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodySprint(struct FPoseLink InPoseSprint, struct FPoseLink& ItemFullBodySprint); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFullBodySprint // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemCrouchTurningAdditive(struct FPoseLink& ItemCrouchTurningAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemCrouchTurningAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemSlopeSliding(struct FPoseLink& ItemSlopeSliding); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSlopeSliding // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFlyModeStartAdditive(struct FPoseLink& ItemFlyModeStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFlyModeStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemFlyModeLoopAdditive(struct FPoseLink& ItemFlyModeLoopAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFlyModeLoopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogStartAdditive(struct FPoseLink InPoseJogStartAdditive, struct FPoseLink& ItemJogStartAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJogStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogStopAdditive(struct FPoseLink InPoseJogStopAdditive, struct FPoseLink& ItemJogStopAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJogStopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogPrePivotAdditive(struct FPoseLink InPosePrePivotAdditive, struct FPoseLink& ItemJogPrePivotAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJogPrePivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogPostPivotAdditive(struct FPoseLink InPosePostPivotAdditive, struct FPoseLink& ItemJogPostPivotAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemJogPostPivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemLowerBodyLeanAdditive(struct FPoseLink InPoseLowerBodyLeanAdditive, struct FPoseLink& ItemLowerBodyLeanAdditive); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyLeanAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogStart(struct FPoseLink InPoseLowerBodyJogStart, struct FPoseLink& ItemLowerBodyJogStart); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyJogStart // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogStop(struct FPoseLink InPoseLowerBodyJogStop, struct FPoseLink& ItemLowerBodyJogStop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyJogStop // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogPrePivot(struct FPoseLink InPoseLowerBodyJogPrePivot, struct FPoseLink& ItemLowerBodyJogPrePivot); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyJogPrePivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogPostPivot(struct FPoseLink InPoseLowerBodyJogPostPivot, struct FPoseLink& ItemLowerBodyJogPostPivot); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemLowerBodyJogPostPivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void Movement_HeavyWeapon(struct FPoseLink& Movement_HeavyWeapon); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_HeavyWeapon // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void Movement_Crouching(struct FPoseLink& Movement_Crouching); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_Crouching // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void Movement_Standing(struct FPoseLink& Movement_Standing); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.Movement_Standing // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimGraph(struct FPoseLink UpperBody, struct FPoseLink PreUpperBodySlot, struct FPoseLink& AnimGraph); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Fortnite_Player_LowerBodyJog_AnimBP(int32_t EntryPoint); // Function Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.ExecuteUbergraph_Fortnite_Player_LowerBodyJog_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

