// ScriptStruct Fortnite_M_Avg_Player_DBNO_AnimBP.Fortnite_M_Avg_Player_DBNO_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x168 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	float ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	int32_t ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct FName ; // 0x28(0x04)
	int32_t ; // 0x2c(0x04)
	float ; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	struct UBlendSpace* ; // 0x48(0x08)
	struct FName ; // 0x50(0x04)
	int32_t ; // 0x54(0x04)
	struct FInputScaleBiasClampConstants ; // 0x58(0x2c)
	float ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	enum class EAnimSyncMethod ; // 0x90(0x01)
	enum class EAnimGroupRole ; // 0x91(0x01)
	char pad_92[0x2]; // 0x92(0x02)
	struct FName ; // 0x94(0x04)
	struct FName ; // 0x98(0x04)
	int32_t ; // 0x9c(0x04)
	struct UBlendSpace* ; // 0xa0(0x08)
	bool ; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	float ; // 0xac(0x04)
	bool ; // 0xb0(0x01)
	enum class EAnimSyncMethod ; // 0xb1(0x01)
	enum class EAnimGroupRole ; // 0xb2(0x01)
	char pad_B3[0x1]; // 0xb3(0x01)
	struct FName ; // 0xb4(0x04)
	struct FAnimNodeFunctionRef ; // 0xb8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xd0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x150(0x18)
};

// ScriptStruct Fortnite_M_Avg_Player_DBNO_AnimBP.Fortnite_M_Avg_Player_DBNO_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x18 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
};

