// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C
// Size: 0x2028 (Inherited: 0x6a0)
struct UFortnite_M_Avg_Player_ZipLine_AnimBlueprint_C : UFortZiplineAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6a0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6a8(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x738(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x740(0x08)
	struct FAnimNode_Root ; // 0x748(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x768(0xc0)
	struct FAnimNode_Root ; // 0x828(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x848(0xc0)
	struct FAnimNode_Root ; // 0x908(0x20)
	struct FAnimNode_Root ; // 0x928(0x20)
	struct FAnimNode_Root ; // 0x948(0x20)
	struct FAnimNode_Root ; // 0x968(0x20)
	struct FAnimNode_Root ; // 0x988(0x20)
	struct FAnimNode_Root ; // 0x9a8(0x20)
	struct FAnimNode_BlendListByBool ; // 0x9c8(0x48)
	struct FAnimNode_BlendListByBool ; // 0xa10(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa58(0x40)
	struct FAnimNode_SequencePlayer ; // 0xa98(0x40)
	struct FAnimNode_SequencePlayer ; // 0xad8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb18(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xb58(0x48)
	struct FAnimNode_Root ; // 0xba0(0x20)
	struct FAnimNode_BlendListByBool ; // 0xbc0(0x48)
	struct FAnimNode_BlendListByBool ; // 0xc08(0x48)
	struct FAnimNode_SequencePlayer ; // 0xc50(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc90(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcd0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd10(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xd50(0x48)
	struct FAnimNode_Root ; // 0xd98(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xdb8(0xc0)
	struct FAnimNode_Root ; // 0xe78(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xe98(0xc0)
	struct FAnimNode_Root ; // 0xf58(0x20)
	struct FAnimNode_Root ; // 0xf78(0x20)
	struct FAnimNode_Root ; // 0xf98(0x20)
	struct FAnimNode_Root ; // 0xfb8(0x20)
	struct FAnimNode_Root ; // 0xfd8(0x20)
	struct FAnimNode_Root ; // 0xff8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1018(0xc0)
	struct FAnimNode_Root ; // 0x10d8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x10f8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x11b8(0xc0)
	struct FAnimNode_Root ; // 0x1278(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1298(0xc0)
	struct FAnimNode_Root ; // 0x1358(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1378(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1438(0x20)
	struct FAnimNode_TransitionResult ; // 0x1458(0x28)
	struct FAnimNode_TransitionResult ; // 0x1480(0x28)
	struct FAnimNode_TransitionResult ; // 0x14a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14d0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x14f8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1520(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1568(0x40)
	struct FAnimNode_SequencePlayer ; // 0x15a8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x15e8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1628(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1670(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x16b0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x1790(0x40)
	struct FAnimNode_SequencePlayer ; // 0x17d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1810(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1850(0x40)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1890(0x48)
	struct FAnimNode_StateResult ; // 0x18d8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x18f8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x1920(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1988(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1a50(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1b18(0x40)
	struct FAnimNode_StateResult ; // 0x1b58(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x1b78(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1c40(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1ca8(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1d70(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1d90(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1e58(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1f20(0x100)
	double PivotAnimBlendTime; // 0x2020(0x08)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodySprint(struct FPoseLink InPoseSprint, struct FPoseLink& ItemFullBodySprint); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFullBodySprint // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemCrouchTurningAdditive(struct FPoseLink& ItemCrouchTurningAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemCrouchTurningAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemSlopeSliding(struct FPoseLink& ItemSlopeSliding); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSlopeSliding // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFlyModeStartAdditive(struct FPoseLink& ItemFlyModeStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFlyModeStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemFlyModeLoopAdditive(struct FPoseLink& ItemFlyModeLoopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFlyModeLoopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogStartAdditive(struct FPoseLink InPoseJogStartAdditive, struct FPoseLink& ItemJogStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogStopAdditive(struct FPoseLink InPoseJogStopAdditive, struct FPoseLink& ItemJogStopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogStopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogPrePivotAdditive(struct FPoseLink InPosePrePivotAdditive, struct FPoseLink& ItemJogPrePivotAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogPrePivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemJogPostPivotAdditive(struct FPoseLink InPosePostPivotAdditive, struct FPoseLink& ItemJogPostPivotAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogPostPivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemLowerBodyLeanAdditive(struct FPoseLink InPoseLowerBodyLeanAdditive, struct FPoseLink& ItemLowerBodyLeanAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyLeanAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogStart(struct FPoseLink InPoseLowerBodyJogStart, struct FPoseLink& ItemLowerBodyJogStart); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogStart // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogStop(struct FPoseLink InPoseLowerBodyJogStop, struct FPoseLink& ItemLowerBodyJogStop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogStop // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogPrePivot(struct FPoseLink InPoseLowerBodyJogPrePivot, struct FPoseLink& ItemLowerBodyJogPrePivot); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogPrePivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemLowerBodyJogPostPivot(struct FPoseLink InPoseLowerBodyJogPostPivot, struct FPoseLink& ItemLowerBodyJogPostPivot); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogPostPivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Fortnite_M_Avg_Player_ZipLine_AnimBlueprint(int32_t EntryPoint); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ExecuteUbergraph_Fortnite_M_Avg_Player_ZipLine_AnimBlueprint // (Final|UbergraphFunction) // @ game+0xd67374
};

