// ScriptStruct Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x2c0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct TArray<float> ; // 0x08(0x10)
	struct FName ; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<float> ; // 0x20(0x10)
	struct FName ; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UBlendSpace* ; // 0x38(0x08)
	struct UBlendSpace* ; // 0x40(0x08)
	struct UBlendSpace* ; // 0x48(0x08)
	struct UBlendSpace* ; // 0x50(0x08)
	struct UBlendSpace* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct FName ; // 0x78(0x04)
	enum class EBlendListTransitionType ; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct FName ; // 0x98(0x04)
	struct FName ; // 0x9c(0x04)
	struct FName ; // 0xa0(0x04)
	struct FName ; // 0xa4(0x04)
	struct FName ; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct TArray<float> ; // 0xb0(0x10)
	struct TArray<int32_t> ; // 0xc0(0x10)
	struct FName ; // 0xd0(0x04)
	struct FName ; // 0xd4(0x04)
	struct FName ; // 0xd8(0x04)
	struct FName ; // 0xdc(0x04)
	struct FName ; // 0xe0(0x04)
	struct FName ; // 0xe4(0x04)
	struct TArray<float> ; // 0xe8(0x10)
	struct TArray<int32_t> ; // 0xf8(0x10)
	struct FName ; // 0x108(0x04)
	struct FName ; // 0x10c(0x04)
	struct FName ; // 0x110(0x04)
	struct FName ; // 0x114(0x04)
	struct FName ; // 0x118(0x04)
	enum class EAnimGroupRole ; // 0x11c(0x01)
	enum class EAnimGroupRole ; // 0x11d(0x01)
	char pad_11E[0x2]; // 0x11e(0x02)
	struct FName ; // 0x120(0x04)
	struct FName ; // 0x124(0x04)
	struct TArray<float> ; // 0x128(0x10)
	struct TArray<int32_t> ; // 0x138(0x10)
	struct TArray<float> ; // 0x148(0x10)
	struct FName ; // 0x158(0x04)
	struct FName ; // 0x15c(0x04)
	struct FName ; // 0x160(0x04)
	struct FName ; // 0x164(0x04)
	int32_t ; // 0x168(0x04)
	enum class EAnimSyncMethod ; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	struct FName ; // 0x170(0x04)
	int32_t ; // 0x174(0x04)
	struct FInputScaleBiasClampConstants ; // 0x178(0x2c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct UBlendProfile* ; // 0x1a8(0x08)
	struct UCurveFloat* ; // 0x1b0(0x08)
	enum class EAlphaBlendOption ; // 0x1b8(0x01)
	enum class EBlendListTransitionType ; // 0x1b9(0x01)
	char pad_1BA[0x6]; // 0x1ba(0x06)
	struct TArray<float> ; // 0x1c0(0x10)
	struct TArray<int32_t> ; // 0x1d0(0x10)
	struct FName ; // 0x1e0(0x04)
	int32_t ; // 0x1e4(0x04)
	float ; // 0x1e8(0x04)
	bool ; // 0x1ec(0x01)
	char pad_1ED[0x3]; // 0x1ed(0x03)
	float ; // 0x1f0(0x04)
	bool ; // 0x1f4(0x01)
	enum class EAnimSyncMethod ; // 0x1f5(0x01)
	enum class EAnimGroupRole ; // 0x1f6(0x01)
	char pad_1F7[0x1]; // 0x1f7(0x01)
	struct FName ; // 0x1f8(0x04)
	struct FName ; // 0x1fc(0x04)
	int32_t ; // 0x200(0x04)
	struct FName ; // 0x204(0x04)
	struct FName ; // 0x208(0x04)
	int32_t ; // 0x20c(0x04)
	struct FAnimNodeFunctionRef ; // 0x210(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x228(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x2a8(0x18)
};

// ScriptStruct Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// Size: 0x870 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* __AnimSequenceBase; // 0x08(0x08)
	struct UBlendSpace* ; // 0x10(0x08)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	struct UBlendSpace* ; // 0x20(0x08)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	int32_t ; // 0x50(0x04)
	char ; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	struct UBlendSpace* ; // 0x58(0x08)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
	struct UBlendSpace* ; // 0x68(0x08)
	float ; // 0x70(0x04)
	float ; // 0x74(0x04)
	char ; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UBlendSpace* ; // 0x80(0x08)
	float ; // 0x88(0x04)
	float ; // 0x8c(0x04)
	struct UBlendSpace* ; // 0x90(0x08)
	float ; // 0x98(0x04)
	float ; // 0x9c(0x04)
	struct UBlendSpace* ; // 0xa0(0x08)
	float ; // 0xa8(0x04)
	float ; // 0xac(0x04)
	struct UBlendSpace* ; // 0xb0(0x08)
	float ; // 0xb8(0x04)
	float ; // 0xbc(0x04)
	float ; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UBlendSpace* ; // 0xc8(0x08)
	float ; // 0xd0(0x04)
	float ; // 0xd4(0x04)
	float ; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct UBlendSpace* ; // 0xe0(0x08)
	float ; // 0xe8(0x04)
	float ; // 0xec(0x04)
	float ; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct UBlendSpace* ; // 0xf8(0x08)
	float ; // 0x100(0x04)
	float ; // 0x104(0x04)
	float ; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UBlendSpace* ; // 0x110(0x08)
	float ; // 0x118(0x04)
	float ; // 0x11c(0x04)
	float ; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UBlendSpace* ; // 0x128(0x08)
	float ; // 0x130(0x04)
	float ; // 0x134(0x04)
	float ; // 0x138(0x04)
	int32_t ; // 0x13c(0x04)
	float ; // 0x140(0x04)
	float ; // 0x144(0x04)
	float ; // 0x148(0x04)
	float ; // 0x14c(0x04)
	float ; // 0x150(0x04)
	float ; // 0x154(0x04)
	float ; // 0x158(0x04)
	float ; // 0x15c(0x04)
	bool ; // 0x160(0x01)
	char pad_161[0x3]; // 0x161(0x03)
	int32_t ; // 0x164(0x04)
	float ; // 0x168(0x04)
	float ; // 0x16c(0x04)
	float ; // 0x170(0x04)
	float ; // 0x174(0x04)
	float ; // 0x178(0x04)
	float ; // 0x17c(0x04)
	int32_t ; // 0x180(0x04)
	int32_t ; // 0x184(0x04)
	struct UBlendSpace* ; // 0x188(0x08)
	float ; // 0x190(0x04)
	float ; // 0x194(0x04)
	struct UBlendSpace* ; // 0x198(0x08)
	float ; // 0x1a0(0x04)
	float ; // 0x1a4(0x04)
	struct UBlendSpace* ; // 0x1a8(0x08)
	float ; // 0x1b0(0x04)
	float ; // 0x1b4(0x04)
	struct UBlendSpace* ; // 0x1b8(0x08)
	float ; // 0x1c0(0x04)
	float ; // 0x1c4(0x04)
	struct UBlendSpace* ; // 0x1c8(0x08)
	float ; // 0x1d0(0x04)
	float ; // 0x1d4(0x04)
	struct UBlendSpace* ; // 0x1d8(0x08)
	float ; // 0x1e0(0x04)
	float ; // 0x1e4(0x04)
	char ; // 0x1e8(0x01)
	char pad_1E9[0x7]; // 0x1e9(0x07)
	struct UBlendSpace* ; // 0x1f0(0x08)
	float ; // 0x1f8(0x04)
	float ; // 0x1fc(0x04)
	char ; // 0x200(0x01)
	char pad_201[0x7]; // 0x201(0x07)
	struct UBlendSpace* ; // 0x208(0x08)
	float ; // 0x210(0x04)
	float ; // 0x214(0x04)
	struct UBlendSpace* ; // 0x218(0x08)
	float ; // 0x220(0x04)
	float ; // 0x224(0x04)
	struct UBlendSpace* ; // 0x228(0x08)
	float ; // 0x230(0x04)
	float ; // 0x234(0x04)
	struct UBlendSpace* ; // 0x238(0x08)
	float ; // 0x240(0x04)
	float ; // 0x244(0x04)
	struct UBlendSpace* ; // 0x248(0x08)
	float ; // 0x250(0x04)
	float ; // 0x254(0x04)
	struct UBlendSpace* ; // 0x258(0x08)
	float ; // 0x260(0x04)
	float ; // 0x264(0x04)
	struct UBlendSpace* ; // 0x268(0x08)
	float ; // 0x270(0x04)
	float ; // 0x274(0x04)
	struct UBlendSpace* ; // 0x278(0x08)
	float ; // 0x280(0x04)
	float ; // 0x284(0x04)
	struct UBlendSpace* ; // 0x288(0x08)
	float ; // 0x290(0x04)
	float ; // 0x294(0x04)
	struct UBlendSpace* ; // 0x298(0x08)
	float ; // 0x2a0(0x04)
	float ; // 0x2a4(0x04)
	struct UBlendSpace* ; // 0x2a8(0x08)
	float ; // 0x2b0(0x04)
	float ; // 0x2b4(0x04)
	struct UBlendSpace* ; // 0x2b8(0x08)
	float ; // 0x2c0(0x04)
	float ; // 0x2c4(0x04)
	struct UBlendSpace* ; // 0x2c8(0x08)
	float ; // 0x2d0(0x04)
	float ; // 0x2d4(0x04)
	struct UBlendSpace* ; // 0x2d8(0x08)
	float ; // 0x2e0(0x04)
	float ; // 0x2e4(0x04)
	char ; // 0x2e8(0x01)
	char ; // 0x2e9(0x01)
	char ; // 0x2ea(0x01)
	char pad_2EB[0x5]; // 0x2eb(0x05)
	struct UBlendSpace* ; // 0x2f0(0x08)
	float ; // 0x2f8(0x04)
	float ; // 0x2fc(0x04)
	struct UBlendSpace* ; // 0x300(0x08)
	float ; // 0x308(0x04)
	float ; // 0x30c(0x04)
	struct UBlendSpace* ; // 0x310(0x08)
	float ; // 0x318(0x04)
	float ; // 0x31c(0x04)
	char ; // 0x320(0x01)
	char ; // 0x321(0x01)
	char ; // 0x322(0x01)
	char pad_323[0x5]; // 0x323(0x05)
	struct UBlendSpace* ; // 0x328(0x08)
	float ; // 0x330(0x04)
	float ; // 0x334(0x04)
	struct UBlendSpace* ; // 0x338(0x08)
	float ; // 0x340(0x04)
	float ; // 0x344(0x04)
	struct UBlendSpace* ; // 0x348(0x08)
	float ; // 0x350(0x04)
	float ; // 0x354(0x04)
	struct UBlendSpace* ; // 0x358(0x08)
	float ; // 0x360(0x04)
	float ; // 0x364(0x04)
	struct UBlendSpace* ; // 0x368(0x08)
	float ; // 0x370(0x04)
	float ; // 0x374(0x04)
	struct UBlendSpace* ; // 0x378(0x08)
	float ; // 0x380(0x04)
	float ; // 0x384(0x04)
	struct UBlendSpace* ; // 0x388(0x08)
	float ; // 0x390(0x04)
	float ; // 0x394(0x04)
	struct UBlendSpace* ; // 0x398(0x08)
	float ; // 0x3a0(0x04)
	float ; // 0x3a4(0x04)
	struct UBlendSpace* ; // 0x3a8(0x08)
	float ; // 0x3b0(0x04)
	float ; // 0x3b4(0x04)
	char ; // 0x3b8(0x01)
	char ; // 0x3b9(0x01)
	char ; // 0x3ba(0x01)
	char pad_3BB[0x5]; // 0x3bb(0x05)
	struct UBlendSpace* ; // 0x3c0(0x08)
	float ; // 0x3c8(0x04)
	float ; // 0x3cc(0x04)
	struct UBlendSpace* ; // 0x3d0(0x08)
	float ; // 0x3d8(0x04)
	float ; // 0x3dc(0x04)
	char ; // 0x3e0(0x01)
	char ; // 0x3e1(0x01)
	char pad_3E2[0x6]; // 0x3e2(0x06)
	struct UBlendSpace* ; // 0x3e8(0x08)
	float ; // 0x3f0(0x04)
	float ; // 0x3f4(0x04)
	char ; // 0x3f8(0x01)
	char ; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
	struct UAnimSequenceBase* ; // 0x400(0x08)
	struct UAnimSequenceBase* ; // 0x408(0x08)
	struct UAnimSequenceBase* ; // 0x410(0x08)
	struct UAnimSequenceBase* ; // 0x418(0x08)
	char ; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct UAnimSequenceBase* ; // 0x428(0x08)
	struct UAnimSequenceBase* ; // 0x430(0x08)
	struct UAnimSequenceBase* ; // 0x438(0x08)
	struct UAnimSequenceBase* ; // 0x440(0x08)
	struct UAnimSequenceBase* ; // 0x448(0x08)
	struct UBlendSpace* ; // 0x450(0x08)
	float ; // 0x458(0x04)
	float ; // 0x45c(0x04)
	struct UBlendSpace* ; // 0x460(0x08)
	float ; // 0x468(0x04)
	float ; // 0x46c(0x04)
	struct UBlendSpace* ; // 0x470(0x08)
	float ; // 0x478(0x04)
	float ; // 0x47c(0x04)
	struct UBlendSpace* ; // 0x480(0x08)
	float ; // 0x488(0x04)
	float ; // 0x48c(0x04)
	struct UBlendSpace* ; // 0x490(0x08)
	float ; // 0x498(0x04)
	float ; // 0x49c(0x04)
	char ; // 0x4a0(0x01)
	char ; // 0x4a1(0x01)
	char pad_4A2[0x6]; // 0x4a2(0x06)
	struct UBlendSpace* ; // 0x4a8(0x08)
	float ; // 0x4b0(0x04)
	float ; // 0x4b4(0x04)
	struct UBlendSpace* ; // 0x4b8(0x08)
	float ; // 0x4c0(0x04)
	float ; // 0x4c4(0x04)
	struct UBlendSpace* ; // 0x4c8(0x08)
	float ; // 0x4d0(0x04)
	float ; // 0x4d4(0x04)
	struct UBlendSpace* ; // 0x4d8(0x08)
	float ; // 0x4e0(0x04)
	float ; // 0x4e4(0x04)
	char ; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct UBlendSpace* ; // 0x4f0(0x08)
	float ; // 0x4f8(0x04)
	float ; // 0x4fc(0x04)
	struct UBlendSpace* ; // 0x500(0x08)
	float ; // 0x508(0x04)
	float ; // 0x50c(0x04)
	struct UBlendSpace* ; // 0x510(0x08)
	float ; // 0x518(0x04)
	float ; // 0x51c(0x04)
	struct UBlendSpace* ; // 0x520(0x08)
	float ; // 0x528(0x04)
	float ; // 0x52c(0x04)
	struct UBlendSpace* ; // 0x530(0x08)
	float ; // 0x538(0x04)
	float ; // 0x53c(0x04)
	struct UBlendSpace* ; // 0x540(0x08)
	float ; // 0x548(0x04)
	float ; // 0x54c(0x04)
	struct UBlendSpace* ; // 0x550(0x08)
	float ; // 0x558(0x04)
	float ; // 0x55c(0x04)
	struct UBlendSpace* ; // 0x560(0x08)
	float ; // 0x568(0x04)
	float ; // 0x56c(0x04)
	struct UBlendSpace* ; // 0x570(0x08)
	float ; // 0x578(0x04)
	float ; // 0x57c(0x04)
	struct UBlendSpace* ; // 0x580(0x08)
	float ; // 0x588(0x04)
	float ; // 0x58c(0x04)
	struct UBlendSpace* ; // 0x590(0x08)
	float ; // 0x598(0x04)
	float ; // 0x59c(0x04)
	struct UBlendSpace* ; // 0x5a0(0x08)
	float ; // 0x5a8(0x04)
	float ; // 0x5ac(0x04)
	struct UBlendSpace* ; // 0x5b0(0x08)
	float ; // 0x5b8(0x04)
	float ; // 0x5bc(0x04)
	struct UBlendSpace* ; // 0x5c0(0x08)
	float ; // 0x5c8(0x04)
	float ; // 0x5cc(0x04)
	struct UBlendSpace* ; // 0x5d0(0x08)
	float ; // 0x5d8(0x04)
	float ; // 0x5dc(0x04)
	struct UBlendSpace* ; // 0x5e0(0x08)
	float ; // 0x5e8(0x04)
	float ; // 0x5ec(0x04)
	struct UBlendSpace* ; // 0x5f0(0x08)
	float ; // 0x5f8(0x04)
	float ; // 0x5fc(0x04)
	struct UBlendSpace* ; // 0x600(0x08)
	float ; // 0x608(0x04)
	float ; // 0x60c(0x04)
	struct UBlendSpace* ; // 0x610(0x08)
	float ; // 0x618(0x04)
	float ; // 0x61c(0x04)
	struct UBlendSpace* ; // 0x620(0x08)
	float ; // 0x628(0x04)
	float ; // 0x62c(0x04)
	struct UBlendSpace* ; // 0x630(0x08)
	float ; // 0x638(0x04)
	float ; // 0x63c(0x04)
	struct UBlendSpace* ; // 0x640(0x08)
	float ; // 0x648(0x04)
	float ; // 0x64c(0x04)
	struct UBlendSpace* ; // 0x650(0x08)
	float ; // 0x658(0x04)
	float ; // 0x65c(0x04)
	struct UBlendSpace* ; // 0x660(0x08)
	float ; // 0x668(0x04)
	float ; // 0x66c(0x04)
	char ; // 0x670(0x01)
	char ; // 0x671(0x01)
	char ; // 0x672(0x01)
	char ; // 0x673(0x01)
	char ; // 0x674(0x01)
	char ; // 0x675(0x01)
	char ; // 0x676(0x01)
	char ; // 0x677(0x01)
	char ; // 0x678(0x01)
	char pad_679[0x7]; // 0x679(0x07)
	struct UBlendSpace* ; // 0x680(0x08)
	float ; // 0x688(0x04)
	float ; // 0x68c(0x04)
	float ; // 0x690(0x04)
	char pad_694[0x4]; // 0x694(0x04)
	struct UBlendSpace* ; // 0x698(0x08)
	float ; // 0x6a0(0x04)
	float ; // 0x6a4(0x04)
	struct UBlendSpace* ; // 0x6a8(0x08)
	float ; // 0x6b0(0x04)
	float ; // 0x6b4(0x04)
	struct UBlendSpace* ; // 0x6b8(0x08)
	float ; // 0x6c0(0x04)
	float ; // 0x6c4(0x04)
	struct UBlendSpace* ; // 0x6c8(0x08)
	float ; // 0x6d0(0x04)
	float ; // 0x6d4(0x04)
	struct UBlendSpace* ; // 0x6d8(0x08)
	float ; // 0x6e0(0x04)
	float ; // 0x6e4(0x04)
	struct UBlendSpace* ; // 0x6e8(0x08)
	float ; // 0x6f0(0x04)
	float ; // 0x6f4(0x04)
	struct UBlendSpace* ; // 0x6f8(0x08)
	float ; // 0x700(0x04)
	float ; // 0x704(0x04)
	struct UBlendSpace* ; // 0x708(0x08)
	float ; // 0x710(0x04)
	float ; // 0x714(0x04)
	char ; // 0x718(0x01)
	char ; // 0x719(0x01)
	char ; // 0x71a(0x01)
	char pad_71B[0x5]; // 0x71b(0x05)
	struct UBlendSpace* ; // 0x720(0x08)
	float ; // 0x728(0x04)
	float ; // 0x72c(0x04)
	struct UBlendSpace* ; // 0x730(0x08)
	float ; // 0x738(0x04)
	float ; // 0x73c(0x04)
	float ; // 0x740(0x04)
	char ; // 0x744(0x01)
	char ; // 0x745(0x01)
	char pad_746[0x2]; // 0x746(0x02)
	struct UBlendSpace* ; // 0x748(0x08)
	float ; // 0x750(0x04)
	float ; // 0x754(0x04)
	char ; // 0x758(0x01)
	char pad_759[0x7]; // 0x759(0x07)
	struct UBlendSpace* ; // 0x760(0x08)
	float ; // 0x768(0x04)
	float ; // 0x76c(0x04)
	struct UBlendSpace* ; // 0x770(0x08)
	float ; // 0x778(0x04)
	float ; // 0x77c(0x04)
	struct UBlendSpace* ; // 0x780(0x08)
	float ; // 0x788(0x04)
	float ; // 0x78c(0x04)
	struct UBlendSpace* ; // 0x790(0x08)
	float ; // 0x798(0x04)
	float ; // 0x79c(0x04)
	struct UBlendSpace* ; // 0x7a0(0x08)
	float ; // 0x7a8(0x04)
	float ; // 0x7ac(0x04)
	struct UBlendSpace* ; // 0x7b0(0x08)
	float ; // 0x7b8(0x04)
	float ; // 0x7bc(0x04)
	char ; // 0x7c0(0x01)
	char pad_7C1[0x7]; // 0x7c1(0x07)
	struct UBlendSpace* ; // 0x7c8(0x08)
	float ; // 0x7d0(0x04)
	float ; // 0x7d4(0x04)
	char ; // 0x7d8(0x01)
	char pad_7D9[0x7]; // 0x7d9(0x07)
	struct UBlendSpace* ; // 0x7e0(0x08)
	float ; // 0x7e8(0x04)
	float ; // 0x7ec(0x04)
	struct UBlendSpace* ; // 0x7f0(0x08)
	float ; // 0x7f8(0x04)
	float ; // 0x7fc(0x04)
	struct UBlendSpace* ; // 0x800(0x08)
	float ; // 0x808(0x04)
	float ; // 0x80c(0x04)
	struct UBlendSpace* ; // 0x810(0x08)
	float ; // 0x818(0x04)
	float ; // 0x81c(0x04)
	struct UBlendSpace* ; // 0x820(0x08)
	float ; // 0x828(0x04)
	float ; // 0x82c(0x04)
	struct UAnimSequenceBase* ; // 0x830(0x08)
	struct UBlendSpace* ; // 0x838(0x08)
	float ; // 0x840(0x04)
	float ; // 0x844(0x04)
	struct UBlendSpace* ; // 0x848(0x08)
	float ; // 0x850(0x04)
	float ; // 0x854(0x04)
	char ; // 0x858(0x01)
	char pad_859[0x7]; // 0x859(0x07)
	struct UBlendSpace* ; // 0x860(0x08)
	float ; // 0x868(0x04)
	float ; // 0x86c(0x04)
};

