// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C
// Size: 0x1b98 (Inherited: 0x6b0)
struct UFortnite_M_Avg_Player_Sprint_AnimBP_C : UFortSprintAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6b0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6b8(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x748(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x750(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x758(0x20)
	struct FAnimNode_TransitionResult ; // 0x778(0x28)
	struct FAnimNode_TransitionResult ; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x7f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x818(0x28)
	struct FAnimNode_TransitionResult ; // 0x840(0x28)
	struct FAnimNode_TransitionResult ; // 0x868(0x28)
	struct FAnimNode_TransitionResult ; // 0x890(0x28)
	struct FAnimNode_TransitionResult ; // 0x8b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x8e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x908(0x28)
	struct FAnimNode_SequencePlayer ; // 0x930(0x40)
	struct FAnimNode_StateResult ; // 0x970(0x20)
	struct FAnimNode_SequencePlayer ; // 0x990(0x40)
	struct FAnimNode_BlendListByBool ; // 0x9d0(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa18(0x40)
	struct FAnimNode_StateResult ; // 0xa58(0x20)
	struct FAnimNode_BlendListByBool ; // 0xa78(0x48)
	struct FAnimNode_SequencePlayer ; // 0xac0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb00(0x40)
	struct FAnimNode_StateResult ; // 0xb40(0x20)
	struct FAnimNode_StateMachine ; // 0xb60(0xc8)
	struct FAnimNode_StateResult ; // 0xc28(0x20)
	struct FAnimNode_SequencePlayer ; // 0xc48(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc88(0x40)
	struct FAnimNode_BlendListByBool ; // 0xcc8(0x48)
	struct FAnimNode_StateResult ; // 0xd10(0x20)
	struct FAnimNode_SequencePlayer ; // 0xd30(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd70(0x40)
	struct FAnimNode_BlendListByBool ; // 0xdb0(0x48)
	struct FAnimNode_StateResult ; // 0xdf8(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe18(0x28)
	struct FAnimNode_StateMachine ; // 0xe40(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xf08(0xa8)
	struct FAnimNode_BlendSpacePlayer ; // 0xfb0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1018(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x10e0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x11a8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x11e8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1230(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1270(0x40)
	struct FAnimNode_SequencePlayer ; // 0x12b0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x12f0(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x1338(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1400(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14c8(0x40)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1508(0xc8)
	struct FAnimNode_Slot ; // 0x15d0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1618(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x1640(0xe0)
	struct FAnimNode_BlendSpacePlayer ; // 0x1720(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1788(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17f0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1838(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1860(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1888(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18d0(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19b0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x19d0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1a98(0x100)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP(int32_t EntryPoint); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

