// ScriptStruct Fortnite_M_Avg_Player_Goop_AnimBlueprint.Fortnite_M_Avg_Player_Goop_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x1f8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct FName ; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<float> ; // 0x38(0x10)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct TArray<float> ; // 0x58(0x10)
	struct TArray<int32_t> ; // 0x68(0x10)
	struct FName ; // 0x78(0x04)
	struct FName ; // 0x7c(0x04)
	struct FName ; // 0x80(0x04)
	struct FName ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	struct FName ; // 0x8c(0x04)
	struct FName ; // 0x90(0x04)
	struct FName ; // 0x94(0x04)
	struct FName ; // 0x98(0x04)
	struct FName ; // 0x9c(0x04)
	struct FName ; // 0xa0(0x04)
	struct FName ; // 0xa4(0x04)
	struct FName ; // 0xa8(0x04)
	struct FName ; // 0xac(0x04)
	struct FInputScaleBiasClampConstants ; // 0xb0(0x2c)
	float ; // 0xdc(0x04)
	struct UAnimSequenceBase* ; // 0xe0(0x08)
	struct UBlendProfile* ; // 0xe8(0x08)
	struct UCurveFloat* ; // 0xf0(0x08)
	enum class EAlphaBlendOption ; // 0xf8(0x01)
	enum class EBlendListTransitionType ; // 0xf9(0x01)
	char pad_FA[0x6]; // 0xfa(0x06)
	struct TArray<float> ; // 0x100(0x10)
	struct UBlendSpace* ; // 0x110(0x08)
	bool ; // 0x118(0x01)
	char pad_119[0x3]; // 0x119(0x03)
	struct FName ; // 0x11c(0x04)
	int32_t ; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UBlendSpace* ; // 0x128(0x08)
	float ; // 0x130(0x04)
	float ; // 0x134(0x04)
	bool ; // 0x138(0x01)
	enum class EAnimSyncMethod ; // 0x139(0x01)
	enum class EAnimGroupRole ; // 0x13a(0x01)
	char pad_13B[0x1]; // 0x13b(0x01)
	struct FName ; // 0x13c(0x04)
	struct FName ; // 0x140(0x04)
	int32_t ; // 0x144(0x04)
	struct FAnimNodeFunctionRef ; // 0x148(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x160(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1e0(0x18)
};

// ScriptStruct Fortnite_M_Avg_Player_Goop_AnimBlueprint.Fortnite_M_Avg_Player_Goop_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// Size: 0x6c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<float> ; // 0x08(0x10)
	bool ; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	char ; // 0x28(0x01)
	bool ; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct TArray<float> ; // 0x30(0x10)
	bool ; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	char ; // 0x50(0x01)
	bool ; // 0x51(0x01)
	char pad_52[0x2]; // 0x52(0x02)
	float ; // 0x54(0x04)
	float ; // 0x58(0x04)
	float ; // 0x5c(0x04)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
	float ; // 0x68(0x04)
};

