// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// Size: 0x10f99 (Inherited: 0x1d40)
struct UFortnite_M_Avg_Player_AnimBlueprint_C : UFortPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1d40(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1d48(0x578)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x22c0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x22c8(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x22d0(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x2378(0x08)
	struct FAnimNode_Root ; // 0x2380(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x23a0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2460(0xc0)
	struct FAnimNode_Root ; // 0x2520(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2540(0xc0)
	struct FAnimNode_Root ; // 0x2600(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2620(0xc0)
	struct FAnimNode_Root ; // 0x26e0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2700(0xc0)
	struct FAnimNode_Root ; // 0x27c0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x27e0(0xc0)
	struct FAnimNode_Root ; // 0x28a0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x28c0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2980(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2a40(0xc0)
	struct FAnimNode_Root ; // 0x2b00(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2b20(0xc0)
	struct FAnimNode_Root ; // 0x2be0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2c00(0xc0)
	struct FAnimNode_Root ; // 0x2cc0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2ce0(0xc0)
	struct FAnimNode_Root ; // 0x2da0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2dc0(0xc0)
	struct FAnimNode_Root ; // 0x2e80(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2ea0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2f60(0xc0)
	struct FAnimNode_Root ; // 0x3020(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3040(0xc0)
	struct FAnimNode_Root ; // 0x3100(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3120(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3160(0x48)
	struct FAnimNode_RefPose ; // 0x31a8(0x10)
	struct FAnimNode_Root ; // 0x31b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x31d8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3218(0x48)
	struct FAnimNode_RefPose ; // 0x3260(0x10)
	struct FAnimNode_Root ; // 0x3270(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3290(0x40)
	struct FAnimNode_BlendListByBool ; // 0x32d0(0x48)
	struct FAnimNode_RefPose ; // 0x3318(0x10)
	struct FAnimNode_Root ; // 0x3328(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3348(0x40)
	struct FAnimNode_Root ; // 0x3388(0x20)
	struct FAnimNode_SequencePlayer ; // 0x33a8(0x40)
	struct FAnimNode_Root ; // 0x33e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3408(0xc0)
	struct FAnimNode_Root ; // 0x34c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x34e8(0xc0)
	struct FAnimNode_Root ; // 0x35a8(0x20)
	struct FAnimNode_BlendListByBool ; // 0x35c8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3610(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3650(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3690(0x40)
	struct FAnimNode_BlendListByBool ; // 0x36d0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3718(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3758(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3798(0x48)
	struct FAnimNode_RefPose ; // 0x37e0(0x10)
	struct FAnimNode_BlendListByBool ; // 0x37f0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3838(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3878(0x48)
	struct FAnimNode_Root ; // 0x38c0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x38e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3928(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3968(0x40)
	struct FAnimNode_SequencePlayer ; // 0x39a8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x39e8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3a30(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3a70(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3ab0(0x48)
	struct FAnimNode_RefPose ; // 0x3af8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3b08(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3b50(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3b90(0x48)
	struct FAnimNode_Root ; // 0x3bd8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3bf8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3c38(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3c80(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3cc0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3d00(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3d48(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3d88(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3dd0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3e10(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3e58(0x40)
	struct FAnimNode_RefPose ; // 0x3e98(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3ea8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3ef0(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3f30(0x48)
	struct FAnimNode_Root ; // 0x3f78(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3f98(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3fe0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4020(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4060(0x40)
	struct FAnimNode_BlendListByBool ; // 0x40a0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x40e8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4128(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4168(0x40)
	struct FAnimNode_BlendListByBool ; // 0x41a8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x41f0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4238(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4280(0x48)
	struct FAnimNode_SequencePlayer ; // 0x42c8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4308(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4350(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4390(0x48)
	struct FAnimNode_SequencePlayer ; // 0x43d8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x4418(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4460(0x40)
	struct FAnimNode_BlendListByBool ; // 0x44a0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x44e8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4528(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4570(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x45b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0x45f8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4640(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4680(0x40)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x46c0(0x100)
	struct FAnimNode_BlendListByEnum ; // 0x47c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4808(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4848(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4890(0x40)
	struct FAnimNode_SequencePlayer ; // 0x48d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4910(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4950(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4998(0x40)
	struct FAnimNode_BlendListByBool ; // 0x49d8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4a20(0x40)
	struct FAnimNode_Root ; // 0x4a60(0x20)
	struct FAnimNode_Root ; // 0x4a80(0x20)
	struct FAnimNode_Root ; // 0x4aa0(0x20)
	struct FAnimNode_Root ; // 0x4ac0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4ae0(0xc0)
	struct FAnimNode_Root ; // 0x4ba0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4bc0(0xc0)
	struct FAnimNode_Root ; // 0x4c80(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4ca0(0xc0)
	struct FAnimNode_Root ; // 0x4d60(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4d80(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x4e40(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x4f00(0xc0)
	struct FAnimNode_Root ; // 0x4fc0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4fe0(0xc0)
	struct FAnimNode_Root ; // 0x50a0(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x50c0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5180(0xc0)
	struct FAnimNode_Root ; // 0x5240(0x20)
	struct FAnimNode_LayeredBoneBlend ; // 0x5260(0xe0)
	struct FAnimNode_RefPose ; // 0x5340(0x10)
	struct FAnimNode_SaveCachedPose ; // 0x5350(0x100)
	struct FAnimNode_BlendSpacePlayer ; // 0x5450(0x68)
	struct FAnimNode_SaveCachedPose ; // 0x54b8(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x55b8(0xc0)
	struct FAnimNode_ApplyAdditive ; // 0x5678(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x5740(0xe0)
	struct FAnimNode_RefPose ; // 0x5820(0x10)
	struct FAnimNode_BlendListByBool ; // 0x5830(0x48)
	struct FAnimNode_UseCachedPose ; // 0x5878(0x28)
	struct FAnimNode_UseCachedPose ; // 0x58a0(0x28)
	struct FAnimNode_Slot ; // 0x58c8(0x48)
	struct FAnimNode_Slot ; // 0x5910(0x48)
	struct FAnimNode_BlendListByBool ; // 0x5958(0x48)
	struct FAnimNode_Slot ; // 0x59a0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x59e8(0x20)
	struct FAnimNode_Slot ; // 0x5a08(0x48)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x5a50(0x110)
	struct FAnimNode_Slot ; // 0x5b60(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x5ba8(0x20)
	struct FAnimNode_StateResult ; // 0x5bc8(0x20)
	struct FAnimNode_StateMachine ; // 0x5be8(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x5cb0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x5cf0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x5d38(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x5d78(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x5e58(0x40)
	struct FAnimNode_StateResult ; // 0x5e98(0x20)
	struct FAnimNode_StateMachine ; // 0x5eb8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x5f80(0x28)
	struct FAnimNode_TransitionResult ; // 0x5fa8(0x28)
	struct FAnimNode_TransitionResult ; // 0x5fd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x5ff8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6020(0x28)
	struct FAnimNode_TransitionResult ; // 0x6048(0x28)
	struct FAnimNode_TransitionResult ; // 0x6070(0x28)
	struct FAnimNode_TransitionResult ; // 0x6098(0x28)
	struct FAnimNode_TransitionResult ; // 0x60c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x60e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6110(0x28)
	struct FAnimNode_TransitionResult ; // 0x6138(0x28)
	struct FAnimNode_TransitionResult ; // 0x6160(0x28)
	struct FAnimNode_TransitionResult ; // 0x6188(0x28)
	struct FAnimNode_TransitionResult ; // 0x61b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x61d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6200(0x28)
	struct FAnimNode_TransitionResult ; // 0x6228(0x28)
	struct FAnimNode_TransitionResult ; // 0x6250(0x28)
	struct FAnimNode_TransitionResult ; // 0x6278(0x28)
	struct FAnimNode_TransitionResult ; // 0x62a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x62c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x62f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6318(0x28)
	struct FAnimNode_TransitionResult ; // 0x6340(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x6368(0xc8)
	struct FAnimNode_StateResult ; // 0x6430(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6450(0xc8)
	struct FAnimNode_StateResult ; // 0x6518(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6538(0xc8)
	struct FAnimNode_StateResult ; // 0x6600(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x6620(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x66e8(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x6728(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x6808(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6848(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6888(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x68c8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x6910(0x40)
	struct FAnimNode_TwoWayBlend ; // 0x6950(0xc0)
	struct FAnimNode_RefPose ; // 0x6a10(0x10)
	struct FAnimNode_BlendListByBool ; // 0x6a20(0x48)
	struct FAnimNode_StateResult ; // 0x6a68(0x20)
	struct FAnimNode_StateMachine ; // 0x6a88(0xc8)
	struct FAnimNode_StateResult ; // 0x6b50(0x20)
	struct FAnimNode_TransitionResult ; // 0x6b70(0x28)
	struct FAnimNode_TransitionResult ; // 0x6b98(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x6bc0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x6c08(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6c48(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6c88(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6cc8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x6d08(0x48)
	struct FAnimNode_BlendListByBool ; // 0x6d50(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x6d98(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x6e00(0xc8)
	struct FAnimNode_StateResult ; // 0x6ec8(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x6ee8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x6f30(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6f70(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6fb0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6ff0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x7030(0x48)
	struct FAnimNode_BlendListByBool ; // 0x7078(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x70c0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x7128(0xc8)
	struct FAnimNode_StateResult ; // 0x71f0(0x20)
	struct FAnimNode_StateMachine ; // 0x7210(0xc8)
	struct FAnimNode_StateResult ; // 0x72d8(0x20)
	struct FAnimNode_RefPose ; // 0x72f8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x7308(0x48)
	struct FAnimNode_TransitionResult ; // 0x7350(0x28)
	struct FAnimNode_TransitionResult ; // 0x7378(0x28)
	struct FAnimNode_TransitionResult ; // 0x73a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x73c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x73f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7418(0x28)
	struct FAnimNode_TransitionResult ; // 0x7440(0x28)
	struct FAnimNode_RefPose ; // 0x7468(0x10)
	struct FAnimNode_StateResult ; // 0x7478(0x20)
	struct FAnimNode_TransitionResult ; // 0x7498(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x74c0(0xc8)
	struct FAnimNode_StateResult ; // 0x7588(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x75a8(0xc8)
	struct FAnimNode_StateResult ; // 0x7670(0x20)
	struct FAnimNode_StateMachine ; // 0x7690(0xc8)
	struct FAnimNode_StateResult ; // 0x7758(0x20)
	struct FAnimNode_TransitionResult ; // 0x7778(0x28)
	struct FAnimNode_TransitionResult ; // 0x77a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x77c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x77f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7818(0x28)
	struct FAnimNode_TransitionResult ; // 0x7840(0x28)
	struct FAnimNode_TransitionResult ; // 0x7868(0x28)
	struct FAnimNode_TransitionResult ; // 0x7890(0x28)
	struct FAnimNode_TransitionResult ; // 0x78b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x78e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7908(0x28)
	struct FAnimNode_TransitionResult ; // 0x7930(0x28)
	struct FAnimNode_RefPose ; // 0x7958(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x7968(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x7a28(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x7af0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x7bd0(0x40)
	struct FAnimNode_UseCachedPose ; // 0x7c10(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x7c38(0xc8)
	struct FAnimNode_StateResult ; // 0x7d00(0x20)
	struct FAnimNode_RefPose ; // 0x7d20(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x7d30(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x7df0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x7eb8(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x7ef8(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x7fd8(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x8000(0xc8)
	struct FAnimNode_StateResult ; // 0x80c8(0x20)
	struct FAnimNode_RefPose ; // 0x80e8(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x80f8(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x81b8(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x8280(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x8360(0x40)
	struct FAnimNode_UseCachedPose ; // 0x83a0(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x83c8(0xc8)
	struct FAnimNode_StateResult ; // 0x8490(0x20)
	struct FAnimNode_StateMachine ; // 0x84b0(0xc8)
	struct FAnimNode_StateResult ; // 0x8578(0x20)
	struct FAnimNode_TransitionResult ; // 0x8598(0x28)
	struct FAnimNode_StateMachine ; // 0x85c0(0xc8)
	struct FAnimNode_StateResult ; // 0x8688(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x86a8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8710(0x68)
	struct FAnimNode_BlendListByBool ; // 0x8778(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x87c0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8828(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x8890(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x88d8(0x68)
	struct FAnimNode_SequencePlayer ; // 0x8940(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x8980(0xc8)
	struct FAnimNode_StateResult ; // 0x8a48(0x20)
	struct FAnimNode_RefPose ; // 0x8a68(0x10)
	struct FAnimNode_StateResult ; // 0x8a78(0x20)
	struct FAnimNode_StateMachine ; // 0x8a98(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0x8b60(0xb8)
	struct FAnimNode_BlendListByBool ; // 0x8c18(0x48)
	struct FAnimNode_Root ; // 0x8c60(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x8c80(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x8d40(0x100)
	struct FAnimNode_UseCachedPose ; // 0x8e40(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x8e68(0x100)
	struct FAnimNode_LinkedAnimGraph ; // 0x8f68(0xb8)
	struct FAnimNode_UseCachedPose ; // 0x9020(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x9048(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x9110(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0x91d8(0xb8)
	struct FAnimNode_UseCachedPose ; // 0x9290(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x92b8(0xc8)
	struct FAnimNode_LinkedInputPose ; // 0x9380(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x9440(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9540(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9568(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x9590(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9690(0x28)
	struct FAnimNode_UseCachedPose ; // 0x96b8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x96e0(0x28)
	struct FAnimNode_Slot ; // 0x9708(0x48)
	struct FAnimNode_BlendListByBool ; // 0x9750(0x48)
	struct FAnimNode_UseCachedPose ; // 0x9798(0x28)
	struct FAnimNode_UseCachedPose ; // 0x97c0(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x97e8(0x100)
	struct FAnimNode_Root ; // 0x98e8(0x20)
	struct FAnimNode_TransitionResult ; // 0x9908(0x28)
	struct FAnimNode_TransitionResult ; // 0x9930(0x28)
	struct FAnimNode_TransitionResult ; // 0x9958(0x28)
	struct FAnimNode_TransitionResult ; // 0x9980(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x99a8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x9a10(0x68)
	struct FAnimNode_BlendListByBool ; // 0x9a78(0x48)
	struct FAnimNode_BlendListByBool ; // 0x9ac0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9b08(0x68)
	struct FAnimNode_StateResult ; // 0x9b70(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x9b90(0x68)
	struct FAnimNode_BlendListByBool ; // 0x9bf8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9c40(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x9ca8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x9d10(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9d58(0x68)
	struct FAnimNode_BlendListByBool ; // 0x9dc0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9e08(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x9e70(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x9eb8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x9f20(0x68)
	struct FAnimNode_BlendListByBool ; // 0x9f88(0x48)
	struct FAnimNode_StateResult ; // 0x9fd0(0x20)
	struct FAnimNode_TransitionResult ; // 0x9ff0(0x28)
	struct FAnimNode_StateMachine ; // 0xa018(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0xa0e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xa148(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa1b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0xa1f8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa240(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa2a8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa2f0(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa358(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa3a0(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa408(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa450(0x68)
	struct FAnimNode_BlendListByEnum ; // 0xa4b8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xa500(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xa568(0x68)
	struct FAnimNode_BlendListByBool ; // 0xa5d0(0x48)
	struct FAnimNode_StateResult ; // 0xa618(0x20)
	struct FAnimNode_StateMachine ; // 0xa638(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xa700(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0xa800(0xc8)
	struct FAnimNode_RefPose ; // 0xa8c8(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xa8d8(0xe0)
	struct FAnimNode_RefPose ; // 0xa9b8(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xa9c8(0xe0)
	struct FAnimNode_RefPose ; // 0xaaa8(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0xaab8(0xe0)
	struct FAnimNode_TransitionResult ; // 0xab98(0x28)
	struct FAnimNode_TransitionResult ; // 0xabc0(0x28)
	struct FAnimNode_TransitionResult ; // 0xabe8(0x28)
	struct FAnimNode_TransitionResult ; // 0xac10(0x28)
	struct FAnimNode_TransitionResult ; // 0xac38(0x28)
	struct FAnimNode_TransitionResult ; // 0xac60(0x28)
	struct FAnimNode_TransitionResult ; // 0xac88(0x28)
	struct FAnimNode_TransitionResult ; // 0xacb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xacd8(0x28)
	struct FAnimNode_TransitionResult ; // 0xad00(0x28)
	struct FAnimNode_TransitionResult ; // 0xad28(0x28)
	struct FAnimNode_TransitionResult ; // 0xad50(0x28)
	struct FAnimNode_TransitionResult ; // 0xad78(0x28)
	struct FAnimNode_TransitionResult ; // 0xada0(0x28)
	struct FAnimNode_TransitionResult ; // 0xadc8(0x28)
	struct FAnimNode_TransitionResult ; // 0xadf0(0x28)
	struct FAnimNode_TransitionResult ; // 0xae18(0x28)
	struct FAnimNode_TransitionResult ; // 0xae40(0x28)
	struct FAnimNode_TransitionResult ; // 0xae68(0x28)
	struct FAnimNode_SequencePlayer ; // 0xae90(0x40)
	struct FAnimNode_SequencePlayer ; // 0xaed0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xaf10(0x40)
	struct FAnimNode_SequencePlayer ; // 0xaf50(0x40)
	struct FAnimNode_SequencePlayer ; // 0xaf90(0x40)
	struct FAnimNode_SequencePlayer ; // 0xafd0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb010(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xb050(0x48)
	struct FAnimNode_SequencePlayer ; // 0xb098(0x40)
	struct FAnimNode_StateResult ; // 0xb0d8(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb0f8(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xb120(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xb168(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xb248(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb288(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb2c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb308(0x40)
	struct FAnimNode_StateResult ; // 0xb348(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb368(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xb390(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xb3d8(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xb4b8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb4f8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb538(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb578(0x40)
	struct FAnimNode_StateResult ; // 0xb5b8(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb5d8(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xb600(0x48)
	struct FAnimNode_SequencePlayer ; // 0xb648(0x40)
	struct FAnimNode_BlendListByBool ; // 0xb688(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xb6d0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xb7b0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb7f0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb830(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb870(0x40)
	struct FAnimNode_StateResult ; // 0xb8b0(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb8d0(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xb8f8(0x48)
	struct FAnimNode_TwoWayBlend ; // 0xb940(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xba00(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0xba40(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xbb20(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbb60(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbba0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbbe0(0x40)
	struct FAnimNode_StateResult ; // 0xbc20(0x20)
	struct FAnimNode_TwoWayBlend ; // 0xbc40(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xbd00(0x40)
	struct FAnimNode_SequencePlayer ; // 0xbd40(0x40)
	struct FAnimNode_StateResult ; // 0xbd80(0x20)
	struct FAnimNode_StateMachine ; // 0xbda0(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xbe68(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xbf28(0x10)
	struct FAnimNode_SequencePlayer ; // 0xbf38(0x40)
	struct FAnimNode_BlendListByBool ; // 0xbf78(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0xbfc0(0xc8)
	struct FAnimNode_StateResult ; // 0xc088(0x20)
	struct FAnimNode_UseCachedPose ; // 0xc0a8(0x28)
	struct FAnimNode_StateResult ; // 0xc0d0(0x20)
	struct FAnimNode_StateMachine ; // 0xc0f0(0xc8)
	struct FAnimNode_StateResult ; // 0xc1b8(0x20)
	struct FAnimNode_StateMachine ; // 0xc1d8(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xc2a0(0x100)
	struct FAnimNode_Root ; // 0xc3a0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xc3c0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0xc480(0xc0)
	struct FAnimNode_RotateRootBone ; // 0xc540(0xa8)
	struct FAnimNode_BlendListByBool ; // 0xc5e8(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xc630(0x100)
	struct FAnimNode_UseCachedPose ; // 0xc730(0x28)
	struct FAnimNode_UseCachedPose ; // 0xc758(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0xc780(0xe0)
	struct FAnimNode_Root ; // 0xc860(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xc880(0xc0)
	struct FAnimNode_Slot ; // 0xc940(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xc988(0x100)
	struct FAnimNode_Slot ; // 0xca88(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xcad0(0x100)
	struct FAnimNode_UseCachedPose ; // 0xcbd0(0x28)
	struct FAnimNode_BlendListByBool ; // 0xcbf8(0x48)
	struct FAnimNode_UseCachedPose ; // 0xcc40(0x28)
	struct FAnimNode_Slot ; // 0xcc68(0x48)
	struct FAnimNode_UseCachedPose ; // 0xccb0(0x28)
	struct FAnimNode_UseCachedPose ; // 0xccd8(0x28)
	struct FAnimNode_UseCachedPose ; // 0xcd00(0x28)
	struct FAnimNode_UseCachedPose ; // 0xcd28(0x28)
	struct FAnimNode_SequencePlayer ; // 0xcd50(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcd90(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcdd0(0x40)
	struct FAnimNode_BlendListByBool ; // 0xce10(0x48)
	struct FAnimNode_BlendListByBool ; // 0xce58(0x48)
	struct FAnimNode_SequencePlayer ; // 0xcea0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcee0(0x40)
	struct FAnimNode_BlendListByBool ; // 0xcf20(0x48)
	struct FAnimNode_ApplyAdditive ; // 0xcf68(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0xd030(0xc8)
	struct FAnimNode_Slot ; // 0xd0f8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0xd140(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xd188(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xd268(0x40)
	struct FAnimNode_ApplyAdditive ; // 0xd2a8(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0xd370(0xe0)
	struct FAnimNode_StateResult ; // 0xd450(0x20)
	struct FAnimNode_StateMachine ; // 0xd470(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xd538(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xd560(0x100)
	struct FAnimNode_Root ; // 0xd660(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xd680(0x110)
	struct FAnimNode_BlendListByBool ; // 0xd790(0x48)
	struct FAnimNode_BlendListByBool ; // 0xd7d8(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xd820(0x110)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xd930(0x110)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xda40(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xdb00(0x100)
	struct FAnimNode_UseCachedPose ; // 0xdc00(0x28)
	struct FAnimNode_UseCachedPose ; // 0xdc28(0x28)
	struct FAnimNode_UseCachedPose ; // 0xdc50(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xdc78(0x20)
	struct FAnimNode_Slot ; // 0xdc98(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xdce0(0x100)
	struct FAnimNode_TransitionResult ; // 0xdde0(0x28)
	struct FAnimNode_TransitionResult ; // 0xde08(0x28)
	struct FAnimNode_TransitionResult ; // 0xde30(0x28)
	struct FAnimNode_TransitionResult ; // 0xde58(0x28)
	struct FAnimNode_TransitionResult ; // 0xde80(0x28)
	struct FAnimNode_TransitionResult ; // 0xdea8(0x28)
	struct FAnimNode_TransitionResult ; // 0xded0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdef8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf20(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf48(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf70(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf98(0x28)
	struct FAnimNode_TransitionResult ; // 0xdfc0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdfe8(0x28)
	struct FAnimNode_TransitionResult ; // 0xe010(0x28)
	struct FAnimNode_TransitionResult ; // 0xe038(0x28)
	struct FAnimNode_TransitionResult ; // 0xe060(0x28)
	struct FAnimNode_TransitionResult ; // 0xe088(0x28)
	struct FAnimNode_TransitionResult ; // 0xe0b0(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xe0d8(0xb8)
	struct FAnimNode_BlendListByBool ; // 0xe190(0x48)
	struct FAnimNode_UseCachedPose ; // 0xe1d8(0x28)
	struct FAnimNode_UseCachedPose ; // 0xe200(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xe228(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xe2f0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0xe3b8(0xc8)
	struct FAnimNode_StateResult ; // 0xe480(0x20)
	struct FAnimNode_UseCachedPose ; // 0xe4a0(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xe4c8(0xb8)
	struct FAnimNode_StateResult ; // 0xe580(0x20)
	struct FAnimNode_TransitionResult ; // 0xe5a0(0x28)
	struct FAnimNode_StateMachine ; // 0xe5c8(0xc8)
	struct FAnimNode_StateResult ; // 0xe690(0x20)
	struct FAnimNode_TransitionResult ; // 0xe6b0(0x28)
	struct FAnimNode_SequencePlayer ; // 0xe6d8(0x40)
	struct FAnimNode_StateResult ; // 0xe718(0x20)
	struct FAnimNode_SequencePlayer ; // 0xe738(0x40)
	struct FAnimNode_StateResult ; // 0xe778(0x20)
	struct FAnimNode_StateMachine ; // 0xe798(0xc8)
	struct FAnimNode_StateResult ; // 0xe860(0x20)
	struct FAnimNode_TransitionResult ; // 0xe880(0x28)
	struct FAnimNode_SequencePlayer ; // 0xe8a8(0x40)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xe8e8(0x48)
	struct FAnimNode_SequencePlayer ; // 0xe930(0x40)
	struct FAnimNode_StateResult ; // 0xe970(0x20)
	struct FAnimNode_SequencePlayer ; // 0xe990(0x40)
	struct FAnimNode_StateResult ; // 0xe9d0(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xe9f0(0xb8)
	struct FAnimNode_StateResult ; // 0xeaa8(0x20)
	struct FAnimNode_SequencePlayer ; // 0xeac8(0x40)
	struct FAnimNode_StateResult ; // 0xeb08(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xeb28(0xb8)
	struct FAnimNode_StateResult ; // 0xebe0(0x20)
	struct FAnimNode_StateMachine ; // 0xec00(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xecc8(0xa8)
	struct FAnimNode_UseCachedPose ; // 0xed70(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xed98(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0xee98(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xef60(0x28)
	struct FAnimNode_UseCachedPose ; // 0xef88(0x28)
	struct FAnimNode_Slot ; // 0xefb0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xeff8(0x100)
	struct FAnimNode_TransitionResult ; // 0xf0f8(0x28)
	struct FAnimNode_TransitionResult ; // 0xf120(0x28)
	struct FAnimNode_TransitionResult ; // 0xf148(0x28)
	struct FAnimNode_TransitionResult ; // 0xf170(0x28)
	struct FAnimNode_TransitionResult ; // 0xf198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xf1c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xf1e8(0x40)
	struct FAnimNode_StateResult ; // 0xf228(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xf248(0xc8)
	struct FAnimNode_RefPose ; // 0xf310(0x10)
	struct FAnimNode_StateResult ; // 0xf320(0x20)
	struct FAnimNode_UseCachedPose ; // 0xf340(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf368(0x28)
	struct FAnimNode_BlendListByBool ; // 0xf390(0x48)
	struct FAnimNode_Slot ; // 0xf3d8(0x48)
	struct FAnimNode_StateResult ; // 0xf420(0x20)
	struct FAnimNode_StateMachine ; // 0xf440(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xf508(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0xf5d0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xf698(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xf6c0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xf788(0x100)
	struct FAnimNode_SaveCachedPose ; // 0xf888(0x100)
	struct FAnimNode_UseCachedPose ; // 0xf988(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf9b0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xf9d8(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xfa20(0xe0)
	struct FAnimNode_UseCachedPose ; // 0xfb00(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xfb28(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xfbf0(0x100)
	struct FAnimNode_LinkedAnimGraph ; // 0xfcf0(0xb8)
	struct FAnimNode_UseCachedPose ; // 0xfda8(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xfdd0(0xb8)
	struct FAnimNode_BlendListByBool ; // 0xfe88(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xfed0(0x100)
	struct FFortAnimNode_ScaleCharacterBones FortAnimGraphNode_ScaleCharacterBones; // 0xffd0(0xd8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x100a8(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x101a8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x101c8(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x101e8(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x102b0(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10378(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10440(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10508(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x105d0(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0x10618(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0x106e0(0xb8)
	struct FAnimNode_BlendListByBool ; // 0x10798(0x48)
	struct FAnimNode_UseCachedPose ; // 0x107e0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10808(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10830(0x28)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x10858(0x10)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x10868(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x10930(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10958(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10980(0x28)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x109a8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x109f0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10a10(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10ad8(0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x10b20(0xc8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x10be8(0xb8)
	bool __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0x10ca0(0x01)
	char pad_10CA1[0x3]; // 0x10ca1(0x03)
	struct FName __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0x10ca4(0x04)
	struct FVector __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x10ca8(0x18)
	struct FVector __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x10cc0(0x18)
	bool __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0x10cd8(0x01)
	char pad_10CD9[0x3]; // 0x10cd9(0x03)
	struct FFortAnimInput_AdjustedAim __CustomProperty_InputParam_72CED7AF4FEDEFE487025CB4B92A64EE; // 0x10cdc(0x23c)
	struct FMulticastInlineDelegate MenuScreenDispatcher; // 0x10f18(0x10)
	double StartAnimBlendTime; // 0x10f28(0x08)
	double PivotAnimBlendTime; // 0x10f30(0x08)
	double CrouchPlayRate; // 0x10f38(0x08)
	bool IsSnowman; // 0x10f40(0x01)
	bool ShouldTrigerGrappleMontage; // 0x10f41(0x01)
	char pad_10F42[0x6]; // 0x10f42(0x06)
	struct FMulticastInlineDelegate Indigo_Boost; // 0x10f48(0x10)
	bool ParaGlide_UseAltGliderCam; // 0x10f58(0x01)
	char pad_10F59[0x7]; // 0x10f59(0x07)
	struct FVector LeftHandOverride; // 0x10f60(0x18)
	struct FVector RightHandOverride; // 0x10f78(0x18)
	bool ParaGlide_TriggerAnim; // 0x10f90(0x01)
	char pad_10F91[0x3]; // 0x10f91(0x03)
	struct FName EmoteAnimOffsetCurveName; // 0x10f94(0x04)
	bool ExitLandingState; // 0x10f98(0x01)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink& MovementMode_FullBodyOverride); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
