// AnimBlueprintGeneratedClass Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C
// Size: 0x1e11 (Inherited: 0x700)
struct UFortnite_Base_Head_Export_Skeleton_AnimBP_C : UHeadPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x700(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x708(0x06)
	char pad_70E[0x2]; // 0x70e(0x02)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x710(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x718(0x08)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x720(0xb0)
	struct FAnimNode_BlendListByBool ; // 0x7d0(0x48)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x818(0x20)
	struct FAnimNode_SequencePlayer ; // 0x838(0x40)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x878(0x1d0)
	struct FAnimNode_LayeredBoneBlend ; // 0xa48(0xe0)
	struct FAnimNode_UseCachedPose ; // 0xb28(0x28)
	struct FAnimNode_UseCachedPose ; // 0xb50(0x28)
	struct FAnimNode_TwoWayBlend ; // 0xb78(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xc38(0x100)
	struct FAnimNode_UseCachedPose ; // 0xd38(0x28)
	struct FAnimNode_UseCachedPose ; // 0xd60(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xd88(0x100)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xe88(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xed0(0xe0)
	struct FAnimNode_SaveCachedPose ; // 0xfb0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x10b0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10d8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1100(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1228(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1248(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x1268(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1368(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1390(0x48)
	struct FAnimNode_UseCachedPose ; // 0x13d8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x1400(0x100)
	struct FAnimNode_RemapCurvesFromMesh AnimGraphNode_RemapCurvesFromMesh; // 0x1500(0x1a0)
	struct FAnimNode_BlendListByEnum ; // 0x16a0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x16e8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1710(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x1738(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1838(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1860(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x1940(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1968(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1990(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x19b8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1a00(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1a28(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1ae8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1b30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1b58(0x28)
	struct FAnimNode_LiveLinkPose ; // 0x1b80(0x48)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose; // 0x1bc8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1c10(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1d10(0x40)
	struct UBlendSpace* __CustomProperty_CharacterLocomotion_Facial_BS_82C1B25943AE256B9AE75BAA733D251A; // 0x1d50(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_SkyGlide_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d58(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_SkyDiveIdle_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d60(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_SkyDive_Intro_82C1B25943AE256B9AE75BAA733D251A; // 0x1d68(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_TacSprint_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d70(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_Slopes_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d78(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_NonTargeting_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d80(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_TargetingToNonTargeting_Add_82C1B25943AE256B9AE75BAA733D251A; // 0x1d88(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_TargetingToNonTargeting_82C1B25943AE256B9AE75BAA733D251A; // 0x1d90(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_TargetingFire_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1d98(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_Targeting_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1da0(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_NonTargetingToTargeting_82C1B25943AE256B9AE75BAA733D251A; // 0x1da8(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_DBNO_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1db0(0x08)
	struct UAnimSequenceBase* __CustomProperty_DefaultFaceIdle_82C1B25943AE256B9AE75BAA733D251A; // 0x1db8(0x08)
	struct UAnimSequenceBase* __CustomProperty_L_SkyActiveDive_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1dc0(0x08)
	struct UAnimSequenceBase* __CustomProperty_W_NonTargetingFire_Loop_82C1B25943AE256B9AE75BAA733D251A; // 0x1dc8(0x08)
	struct USkeletalMeshComponent* MeshToCopy; // 0x1dd0(0x08)
	bool GetPlayerListUsesCustomCharacterParts; // 0x1dd8(0x01)
	bool bIsMoving; // 0x1dd9(0x01)
	bool ; // 0x1dda(0x01)
	bool ; // 0x1ddb(0x01)
	bool bIsFallingLocal; // 0x1ddc(0x01)
	bool bIsJumpingLocal; // 0x1ddd(0x01)
	bool ; // 0x1dde(0x01)
	bool bIsCrouchWalking; // 0x1ddf(0x01)
	bool ; // 0x1de0(0x01)
	bool ; // 0x1de1(0x01)
	bool ; // 0x1de2(0x01)
	bool ; // 0x1de3(0x01)
	bool ; // 0x1de4(0x01)
	bool bIsDancing; // 0x1de5(0x01)
	bool ; // 0x1de6(0x01)
	bool ; // 0x1de7(0x01)
	bool ; // 0x1de8(0x01)
	char pad_1DE9[0x7]; // 0x1de9(0x07)
	double LastFireTime; // 0x1df0(0x08)
	bool IsSkydiving0; // 0x1df8(0x01)
	bool IsDive0; // 0x1df9(0x01)
	char pad_1DFA[0x6]; // 0x1dfa(0x06)
	double LookYaw; // 0x1e00(0x08)
	double LookPitch; // 0x1e08(0x08)
	bool is_3L_anim; // 0x1e10(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void BlueprintInitializeAnimation(); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP_AnimGraphNode_RemapCurvesFromMesh_FA2D152640A8B7905F9C52941913CB38(); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP_AnimGraphNode_RemapCurvesFromMesh_FA2D152640A8B7905F9C52941913CB38 // (BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP(int32_t EntryPoint); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xd67374
};

