// AnimBlueprintGeneratedClass Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C
// Size: 0x935a (Inherited: 0x840)
struct UFortnite_SkyDiveAndGlide_AnimBlueprint_C : UFortSkydivingAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x840(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x848(0x870)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x10b8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x10c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x10c8(0x20)
	struct FAnimNode_RefPose ; // 0x10e8(0x10)
	struct FAnimNode_SequencePlayer ; // 0x10f8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x1138(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1200(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x12c8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1330(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1398(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1460(0x40)
	struct FAnimNode_SequencePlayer ; // 0x14a0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x14e0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x15a8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x15e8(0x40)
	struct FAnimNode_BlendListByInt ; // 0x1628(0x48)
	struct FAnimNode_StateResult ; // 0x1670(0x20)
	struct FAnimNode_StateMachine ; // 0x1690(0xc8)
	struct FAnimNode_RefPose ; // 0x1758(0x10)
	struct FAnimNode_BlendListByEnum ; // 0x1768(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x17b0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1818(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1880(0xc8)
	struct FAnimNode_BlendListByEnum ; // 0x1948(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x1990(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x19f8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1ac0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1b28(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1bf0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1c58(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1cc0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1d28(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1d90(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1df8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x1e60(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1ec8(0xc8)
	struct FAnimNode_BlendListByInt ; // 0x1f90(0x48)
	struct FAnimNode_StateResult ; // 0x1fd8(0x20)
	struct FAnimNode_StateMachine ; // 0x1ff8(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x20c0(0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x21c0(0x100)
	struct FAnimNode_TransitionResult ; // 0x22c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x22e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2310(0x28)
	struct FAnimNode_TransitionResult ; // 0x2338(0x28)
	struct FAnimNode_TransitionResult ; // 0x2360(0x28)
	struct FAnimNode_TransitionResult ; // 0x2388(0x28)
	struct FAnimNode_TwoWayBlend ; // 0x23b0(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x2470(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x24d8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2540(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x2608(0xc8)
	struct FAnimNode_TwoWayBlend ; // 0x26d0(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x2790(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x27f8(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2860(0x48)
	struct FAnimNode_BlendListByInt ; // 0x28a8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x28f0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2958(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x29c0(0x68)
	struct FAnimNode_BlendListByInt ; // 0x2a28(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2a70(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2ab0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2af0(0x40)
	struct FAnimNode_StateResult ; // 0x2b30(0x20)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2b50(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2b98(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2bd8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2c18(0x40)
	struct FAnimNode_StateResult ; // 0x2c58(0x20)
	struct FAnimNode_TransitionResult ; // 0x2c78(0x28)
	struct FAnimNode_TransitionResult ; // 0x2ca0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cf0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d18(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d40(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d68(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d90(0x28)
	struct FAnimNode_TransitionResult ; // 0x2db8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2de0(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x2e08(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2e70(0x68)
	struct FAnimNode_TwoWayBlend ; // 0x2ed8(0xc0)
	struct FAnimNode_ApplyAdditive ; // 0x2f98(0xc8)
	struct FAnimNode_TwoWayBlend ; // 0x3060(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x3120(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3188(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x31f0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x32b8(0x68)
	struct FAnimNode_StateResult ; // 0x3320(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3340(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x33a8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x33f0(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x3458(0x48)
	struct FAnimNode_TwoWayBlend ; // 0x34a0(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x3560(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x35c8(0x68)
	struct FAnimNode_TwoWayBlend ; // 0x3630(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x36f0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3758(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x37c0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3888(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x3950(0x68)
	struct FAnimNode_StateResult ; // 0x39b8(0x20)
	struct FAnimNode_RefPose ; // 0x39d8(0x10)
	struct FAnimNode_StateResult ; // 0x39e8(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x3a08(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x3ad0(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x3af8(0x68)
	struct FAnimNode_StateResult ; // 0x3b60(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x3b80(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x3c48(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x3c70(0x68)
	struct FAnimNode_StateResult ; // 0x3cd8(0x20)
	struct FAnimNode_StateMachine ; // 0x3cf8(0xc8)
	struct FAnimNode_StateResult ; // 0x3dc0(0x20)
	struct FAnimNode_TransitionResult ; // 0x3de0(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x3e08(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3e70(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3ed8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3f40(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3fa8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4010(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4078(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x40e0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4128(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4170(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x41b8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4220(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4288(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x42f0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x43b8(0xc8)
	struct FAnimNode_BlendListByEnum ; // 0x4480(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x44c8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4510(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4558(0x68)
	struct FAnimNode_StateResult ; // 0x45c0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x45e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4648(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x46b0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4718(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4780(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x47e8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4850(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x48b8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x4920(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4968(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x49b0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x49f8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x4a60(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4b28(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x4b90(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4bd8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x4c20(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4ce8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x4d50(0x48)
	struct FAnimNode_StateResult ; // 0x4d98(0x20)
	struct FAnimNode_StateMachine ; // 0x4db8(0xc8)
	struct FAnimNode_BlendListByEnum ; // 0x4e80(0x48)
	struct FAnimNode_TransitionResult ; // 0x4ec8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4ef0(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f18(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f40(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f68(0x28)
	struct FAnimNode_TransitionResult ; // 0x4f90(0x28)
	struct FAnimNode_TransitionResult ; // 0x4fb8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4fe0(0x28)
	struct FAnimNode_TransitionResult ; // 0x5008(0x28)
	struct FAnimNode_TransitionResult ; // 0x5030(0x28)
	struct FAnimNode_TransitionResult ; // 0x5058(0x28)
	struct FAnimNode_TransitionResult ; // 0x5080(0x28)
	struct FAnimNode_TransitionResult ; // 0x50a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x50d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x50f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x5120(0x28)
	struct FAnimNode_TransitionResult ; // 0x5148(0x28)
	struct FAnimNode_TransitionResult ; // 0x5170(0x28)
	struct FAnimNode_TransitionResult ; // 0x5198(0x28)
	struct FAnimNode_TransitionResult ; // 0x51c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x51e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x5210(0x28)
	struct FAnimNode_SequencePlayer ; // 0x5238(0x40)
	struct FAnimNode_StateResult ; // 0x5278(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5298(0x40)
	struct FAnimNode_StateResult ; // 0x52d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x52f8(0x40)
	struct FAnimNode_StateResult ; // 0x5338(0x20)
	struct FAnimNode_SequencePlayer ; // 0x5358(0x40)
	struct FAnimNode_StateResult ; // 0x5398(0x20)
	struct FAnimNode_RefPose ; // 0x53b8(0x10)
	struct FAnimNode_StateResult ; // 0x53c8(0x20)
	struct FAnimNode_StateMachine ; // 0x53e8(0xc8)
	struct FAnimNode_StateResult ; // 0x54b0(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x54d0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x5518(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5558(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5598(0x40)
	struct FAnimNode_SequencePlayer ; // 0x55d8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x5618(0x40)
	struct FAnimNode_StateResult ; // 0x5658(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x5678(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x56e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5748(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x57b0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5818(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x5880(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x58c8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5910(0x48)
	struct FAnimNode_StateResult ; // 0x5958(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5978(0x10)
	struct FAnimNode_StateResult ; // 0x5988(0x20)
	struct FAnimNode_StateMachine ; // 0x59a8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x5a70(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x5a98(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x5b60(0x68)
	struct FAnimNode_StateResult ; // 0x5bc8(0x20)
	struct FAnimNode_StateMachine ; // 0x5be8(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x5cb0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x5d78(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x5de0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x5ea8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5f10(0x68)
	struct FAnimNode_StateResult ; // 0x5f78(0x20)
	struct FAnimNode_BlendListByEnum ; // 0x5f98(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5fe0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6048(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x60b0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x6178(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x6240(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x62a8(0x68)
	struct FAnimNode_StateResult ; // 0x6310(0x20)
	struct FAnimNode_StateMachine ; // 0x6330(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x63f8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x64c0(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x64e8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x65b0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x6618(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x66e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6748(0x68)
	struct FAnimNode_StateResult ; // 0x67b0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x67d0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x6838(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x6900(0x68)
	struct FAnimNode_StateResult ; // 0x6968(0x20)
	struct FAnimNode_StateMachine ; // 0x6988(0xc8)
	struct FAnimNode_TransitionResult ; // 0x6a50(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x6a78(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6ae0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6b48(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6bb0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6c18(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6c80(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6ce8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6d50(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6db8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6e20(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6e88(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6ef0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6f58(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x6fc0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x7028(0x68)
	struct FAnimNode_TwoWayBlend ; // 0x7090(0xc0)
	struct FAnimNode_BlendListByEnum ; // 0x7150(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7198(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x71e0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7228(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7270(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x72b8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x7300(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x73c8(0xc8)
	struct FAnimNode_BlendListByEnum ; // 0x7490(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x74d8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7520(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x7568(0x68)
	struct FAnimNode_StateResult ; // 0x75d0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x75f0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x7658(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x76c0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x7728(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x7790(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x77f8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x7860(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x78c8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x7930(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7978(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x79c0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x7a08(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x7a70(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x7b38(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x7ba0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x7be8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x7c30(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x7cf8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x7d60(0x48)
	struct FAnimNode_StateResult ; // 0x7da8(0x20)
	struct FAnimNode_StateMachine ; // 0x7dc8(0xc8)
	struct FAnimNode_StateResult ; // 0x7e90(0x20)
	struct FAnimNode_TransitionResult ; // 0x7eb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7ed8(0x28)
	struct FAnimNode_TransitionResult ; // 0x7f00(0x28)
	struct FAnimNode_TransitionResult ; // 0x7f28(0x28)
	struct FAnimNode_TransitionResult ; // 0x7f50(0x28)
	struct FAnimNode_TransitionResult ; // 0x7f78(0x28)
	struct FAnimNode_TransitionResult ; // 0x7fa0(0x28)
	struct FAnimNode_TransitionResult ; // 0x7fc8(0x28)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x7ff0(0x10)
	struct FAnimNode_StateResult ; // 0x8000(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x8020(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8088(0x68)
	struct FAnimNode_TwoWayBlend ; // 0x80f0(0xc0)
	struct FAnimNode_ApplyAdditive ; // 0x81b0(0xc8)
	struct FAnimNode_TwoWayBlend ; // 0x8278(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x8338(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x83a0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x8408(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x84d0(0x68)
	struct FAnimNode_StateResult ; // 0x8538(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x8558(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x85c0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x8608(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x8670(0x48)
	struct FAnimNode_TwoWayBlend ; // 0x86b8(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x8778(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x87e0(0x68)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8848(0xc0)
	struct FAnimNode_BlendSpacePlayer ; // 0x8908(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8970(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x89d8(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x8aa0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x8b68(0x68)
	struct FAnimNode_StateResult ; // 0x8bd0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8bf0(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x8c30(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x8c98(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x8d00(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8dc8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x8e10(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x8ed8(0x28)
	struct FAnimNode_StateResult ; // 0x8f00(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8f20(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8fe8(0x68)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9050(0x28)
	struct FAnimNode_StateResult ; // 0x9078(0x20)
	struct FAnimNode_StateMachine ; // 0x9098(0xc8)
	struct FAnimNode_StateResult ; // 0x9160(0x20)
	struct FAnimNode_StateMachine ; // 0x9180(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9248(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9268(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9290(0xc8)
	bool ParaGlide_TriggerAnim; // 0x9358(0x01)
	bool BlockAnimRule; // 0x9359(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void BlueprintInitializeAnimation(); // Function Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Fortnite_SkyDiveAndGlide_AnimBlueprint(int32_t EntryPoint); // Function Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.ExecuteUbergraph_Fortnite_SkyDiveAndGlide_AnimBlueprint // (Final|UbergraphFunction) // @ game+0xd67374
};

