// ScriptStruct Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x320 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	struct FName ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	struct FName ; // 0x2c(0x04)
	struct FName ; // 0x30(0x04)
	struct FName ; // 0x34(0x04)
	struct FName ; // 0x38(0x04)
	struct FName ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	struct FName ; // 0x44(0x04)
	struct FName ; // 0x48(0x04)
	struct FName ; // 0x4c(0x04)
	struct FName ; // 0x50(0x04)
	struct FName ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<float> ; // 0x68(0x10)
	struct TArray<float> ; // 0x78(0x10)
	struct TArray<float> ; // 0x88(0x10)
	struct FName ; // 0x98(0x04)
	struct FName ; // 0x9c(0x04)
	int32_t ; // 0xa0(0x04)
	enum class EAnimGroupRole ; // 0xa4(0x01)
	char pad_A5[0x3]; // 0xa5(0x03)
	struct FName ; // 0xa8(0x04)
	int32_t ; // 0xac(0x04)
	enum class EAnimGroupRole ; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	struct FName ; // 0xb4(0x04)
	struct FName ; // 0xb8(0x04)
	int32_t ; // 0xbc(0x04)
	struct TArray<float> ; // 0xc0(0x10)
	struct TArray<int32_t> ; // 0xd0(0x10)
	struct FName ; // 0xe0(0x04)
	struct FName ; // 0xe4(0x04)
	int32_t ; // 0xe8(0x04)
	struct FInputScaleBiasClampConstants ; // 0xec(0x2c)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	struct FInputScaleBiasClampConstants ; // 0x120(0x2c)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UAnimSequenceBase* ; // 0x150(0x08)
	struct FInputScaleBiasClampConstants ; // 0x158(0x2c)
	char pad_184[0x4]; // 0x184(0x04)
	struct UAnimSequenceBase* ; // 0x188(0x08)
	struct FName ; // 0x190(0x04)
	struct FName ; // 0x194(0x04)
	int32_t ; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct UAnimSequenceBase* ; // 0x1a0(0x08)
	struct FInputScaleBiasClampConstants ; // 0x1a8(0x2c)
	float ; // 0x1d4(0x04)
	struct UAnimSequenceBase* ; // 0x1d8(0x08)
	enum class EAnimSyncMethod ; // 0x1e0(0x01)
	enum class EAnimGroupRole ; // 0x1e1(0x01)
	char pad_1E2[0x2]; // 0x1e2(0x02)
	struct FName ; // 0x1e4(0x04)
	int32_t ; // 0x1e8(0x04)
	struct FName ; // 0x1ec(0x04)
	int32_t ; // 0x1f0(0x04)
	bool ; // 0x1f4(0x01)
	char pad_1F5[0x3]; // 0x1f5(0x03)
	float ; // 0x1f8(0x04)
	enum class EAnimSyncMethod ; // 0x1fc(0x01)
	enum class EAnimGroupRole ; // 0x1fd(0x01)
	char pad_1FE[0x2]; // 0x1fe(0x02)
	struct FName ; // 0x200(0x04)
	enum class EAlphaBlendOption ; // 0x204(0x01)
	char pad_205[0x3]; // 0x205(0x03)
	struct TArray<float> ; // 0x208(0x10)
	struct TArray<float> ; // 0x218(0x10)
	struct TArray<int32_t> ; // 0x228(0x10)
	struct UBlendProfile* ; // 0x238(0x08)
	struct UCurveFloat* ; // 0x240(0x08)
	bool ; // 0x248(0x01)
	enum class EAlphaBlendOption ; // 0x249(0x01)
	enum class EBlendListTransitionType ; // 0x24a(0x01)
	char pad_24B[0x5]; // 0x24b(0x05)
	struct TArray<float> ; // 0x250(0x10)
	struct FName ; // 0x260(0x04)
	struct FName ; // 0x264(0x04)
	int32_t ; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct FAnimNodeFunctionRef ; // 0x270(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x288(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x308(0x18)
};

// ScriptStruct Fortnite_Player_LowerBodyJog_AnimBP.Fortnite_Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x24b (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UBlendSpace* __BlendSpace; // 0x08(0x08)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	bool ; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UBlendSpace* ; // 0x28(0x08)
	float ; // 0x30(0x04)
	float ; // 0x34(0x04)
	float ; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UBlendSpace* ; // 0x40(0x08)
	float ; // 0x48(0x04)
	float ; // 0x4c(0x04)
	float ; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct UBlendSpace* ; // 0x58(0x08)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
	float ; // 0x68(0x04)
	float ; // 0x6c(0x04)
	bool ; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UBlendSpace* ; // 0x78(0x08)
	float ; // 0x80(0x04)
	float ; // 0x84(0x04)
	float ; // 0x88(0x04)
	float ; // 0x8c(0x04)
	struct UBlendSpace* ; // 0x90(0x08)
	float ; // 0x98(0x04)
	float ; // 0x9c(0x04)
	float ; // 0xa0(0x04)
	float ; // 0xa4(0x04)
	bool ; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
	struct UBlendSpace* ; // 0xb0(0x08)
	float ; // 0xb8(0x04)
	float ; // 0xbc(0x04)
	float ; // 0xc0(0x04)
	float ; // 0xc4(0x04)
	bool ; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct TArray<float> ; // 0xd0(0x10)
	char ; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float ; // 0xe4(0x04)
	float ; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct UAnimSequenceBase* ; // 0xf0(0x08)
	float ; // 0xf8(0x04)
	float ; // 0xfc(0x04)
	struct UAnimSequenceBase* ; // 0x100(0x08)
	float ; // 0x108(0x04)
	float ; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	float ; // 0x118(0x04)
	float ; // 0x11c(0x04)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	struct TArray<float> ; // 0x128(0x10)
	char ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	float ; // 0x13c(0x04)
	struct UAnimSequenceBase* ; // 0x140(0x08)
	float ; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UAnimSequenceBase* ; // 0x150(0x08)
	float ; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)
	struct UAnimSequenceBase* ; // 0x160(0x08)
	float ; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct UAnimSequenceBase* ; // 0x170(0x08)
	struct TArray<float> ; // 0x178(0x10)
	char ; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	float ; // 0x18c(0x04)
	struct UAnimSequenceBase* ; // 0x190(0x08)
	float ; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct UAnimSequenceBase* ; // 0x1a0(0x08)
	float ; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	float ; // 0x1b8(0x04)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct UAnimSequenceBase* ; // 0x1c0(0x08)
	char ; // 0x1c8(0x01)
	char ; // 0x1c9(0x01)
	char pad_1CA[0x6]; // 0x1ca(0x06)
	struct UAnimSequenceBase* ; // 0x1d0(0x08)
	struct UAnimSequenceBase* ; // 0x1d8(0x08)
	struct UAnimSequenceBase* ; // 0x1e0(0x08)
	struct UAnimSequenceBase* ; // 0x1e8(0x08)
	struct UAnimSequenceBase* ; // 0x1f0(0x08)
	struct UAnimSequenceBase* ; // 0x1f8(0x08)
	struct UAnimSequenceBase* ; // 0x200(0x08)
	struct UAnimSequenceBase* ; // 0x208(0x08)
	float ; // 0x210(0x04)
	bool ; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	float ; // 0x218(0x04)
	float ; // 0x21c(0x04)
	bool ; // 0x220(0x01)
	bool ; // 0x221(0x01)
	char pad_222[0x6]; // 0x222(0x06)
	struct UBlendSpace* ; // 0x228(0x08)
	float ; // 0x230(0x04)
	float ; // 0x234(0x04)
	struct UBlendSpace* ; // 0x238(0x08)
	float ; // 0x240(0x04)
	float ; // 0x244(0x04)
	bool ; // 0x248(0x01)
	char ; // 0x249(0x01)
	bool ; // 0x24a(0x01)
};

