// Class FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
// Size: 0x580 (Inherited: 0x30)
struct UFortniteUserInterfaceSettings : UDeveloperSettings {
	struct FRuntimeFloatCurve WidthScaleCurve; // 0x30(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve; // 0xb8(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_iOS_InGame; // 0x140(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_iOS_InGame; // 0x1c8(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_iOS_FrontEnd; // 0x250(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_iOS_FrontEnd; // 0x2d8(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_Android_InGame; // 0x360(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_Android_InGame; // 0x3e8(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_Android_FrontEnd; // 0x470(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_Android_FrontEnd; // 0x4f8(0x88)
};

