// AnimBlueprintGeneratedClass Grandma_AnimBP.Grandma_AnimBP_C
// Size: 0x4d40 (Inherited: 0x7a0)
struct UGrandma_AnimBP_C : UFortAIFaunaAnimInstance_Grandma {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7a0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x7a8(0x74)
	char pad_81C[0x4]; // 0x81c(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x820(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x828(0x08)
	struct FAnimNode_Root ; // 0x830(0x20)
	struct FAnimNode_TransitionResult ; // 0x850(0x28)
	struct FAnimNode_TransitionResult ; // 0x878(0x28)
	struct FAnimNode_TransitionResult ; // 0x8a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x8c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x8f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x918(0x28)
	struct FAnimNode_TransitionResult ; // 0x940(0x28)
	struct FAnimNode_SequencePlayer ; // 0x968(0x40)
	struct FAnimNode_StateResult ; // 0x9a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x9c8(0x40)
	struct FAnimNode_StateResult ; // 0xa08(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa28(0x40)
	struct FAnimNode_StateResult ; // 0xa68(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa88(0x40)
	struct FAnimNode_StateResult ; // 0xac8(0x20)
	struct FAnimNode_StateMachine ; // 0xae8(0xc8)
	struct FAnimNode_Root ; // 0xbb0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xbd0(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xc90(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcd0(0x40)
	struct FAnimNode_BlendListByBool ; // 0xd10(0x48)
	struct FAnimNode_Root ; // 0xd58(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xd78(0xc0)
	struct FAnimNode_SequencePlayer ; // 0xe38(0x40)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xe78(0x20)
	struct FAnimNode_TransitionResult ; // 0xe98(0x28)
	struct FAnimNode_TransitionResult ; // 0xec0(0x28)
	struct FAnimNode_TransitionResult ; // 0xee8(0x28)
	struct FAnimNode_TransitionResult ; // 0xf10(0x28)
	struct FAnimNode_TransitionResult ; // 0xf38(0x28)
	struct FAnimNode_TransitionResult ; // 0xf60(0x28)
	struct FAnimNode_TransitionResult ; // 0xf88(0x28)
	struct FAnimNode_TransitionResult ; // 0xfb0(0x28)
	struct FAnimNode_TransitionResult ; // 0xfd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1000(0x28)
	struct FAnimNode_TransitionResult ; // 0x1028(0x28)
	struct FAnimNode_TransitionResult ; // 0x1050(0x28)
	struct FAnimNode_TransitionResult ; // 0x1078(0x28)
	struct FAnimNode_TransitionResult ; // 0x10a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x10c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x10f0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1118(0x40)
	struct FAnimNode_StateResult ; // 0x1158(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1178(0x40)
	struct FAnimNode_StateResult ; // 0x11b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x11d8(0x40)
	struct FAnimNode_StateResult ; // 0x1218(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x1238(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1300(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1368(0x48)
	struct FAnimNode_SequencePlayer ; // 0x13b0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x13f0(0x40)
	struct FAnimNode_StateResult ; // 0x1430(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x1450(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x1518(0x68)
	struct FAnimNode_TransitionResult ; // 0x1580(0x28)
	struct FAnimNode_TransitionResult ; // 0x15a8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x15d0(0x40)
	struct FAnimNode_StateResult ; // 0x1610(0x20)
	struct FAnimNode_RefPose ; // 0x1630(0x10)
	struct FAnimNode_StateResult ; // 0x1640(0x20)
	struct FAnimNode_StateMachine ; // 0x1660(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1728(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x17f0(0x68)
	struct FAnimNode_StateResult ; // 0x1858(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x1878(0x68)
	struct FAnimNode_SequencePlayer ; // 0x18e0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1920(0x40)
	struct FAnimNode_UseCachedPose ; // 0x1960(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1988(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x19d0(0xe0)
	struct FAnimNode_ApplyAdditive ; // 0x1ab0(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x1b78(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1bc0(0x28)
	struct FAnimNode_StateResult ; // 0x1be8(0x20)
	struct FAnimNode_StateMachine ; // 0x1c08(0xc8)
	struct FAnimNode_Slot ; // 0x1cd0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1d18(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1d38(0x20)
	struct FAnimNode_Slot ; // 0x1d58(0x48)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1da0(0xf8)
	struct FAnimNode_Slot ; // 0x1e98(0x48)
	struct FAnimNode_Slot ; // 0x1ee0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x1f28(0x100)
	struct FAnimNode_UseCachedPose ; // 0x2028(0x28)
	struct FAnimNode_UseCachedPose ; // 0x2050(0x28)
	struct FAnimNode_BlendListByBool ; // 0x2078(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x20c0(0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x21a0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x21c8(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x2210(0xc8)
	struct FAnimNode_TransitionResult ; // 0x22d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2300(0x28)
	struct FAnimNode_TransitionResult ; // 0x2328(0x28)
	struct FAnimNode_TransitionResult ; // 0x2350(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2378(0x40)
	struct FAnimNode_StateResult ; // 0x23b8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x23d8(0x40)
	struct FAnimNode_StateResult ; // 0x2418(0x20)
	struct FAnimNode_RefPose ; // 0x2438(0x10)
	struct FAnimNode_StateResult ; // 0x2448(0x20)
	struct FAnimNode_StateMachine ; // 0x2468(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2530(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2570(0xe0)
	struct FFortAnimNode_QuadrupedSlopeWarping FortAnimGraphNode_QuadrupedSlopeWarping; // 0x2650(0x5c0)
	struct FFortAnimNode_WeightedLookAt FortAnimGraphNode_WeightedLookAt; // 0x2c10(0x250)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x2e60(0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2f60(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3028(0x100)
	struct FAnimNode_SequencePlayer ; // 0x3128(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3168(0x48)
	struct FAnimNode_TransitionResult ; // 0x31b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x31d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3200(0x28)
	struct FAnimNode_TransitionResult ; // 0x3228(0x28)
	struct FAnimNode_TransitionResult ; // 0x3250(0x28)
	struct FAnimNode_TransitionResult ; // 0x3278(0x28)
	struct FAnimNode_TransitionResult ; // 0x32a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x32c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x32f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3318(0x28)
	struct FAnimNode_TransitionResult ; // 0x3340(0x28)
	struct FAnimNode_TransitionResult ; // 0x3368(0x28)
	struct FAnimNode_TransitionResult ; // 0x3390(0x28)
	struct FAnimNode_TransitionResult ; // 0x33b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x33e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3408(0x28)
	struct FAnimNode_TransitionResult ; // 0x3430(0x28)
	struct FAnimNode_TransitionResult ; // 0x3458(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3480(0x40)
	struct FAnimNode_SequencePlayer ; // 0x34c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3500(0x48)
	struct FAnimNode_StateResult ; // 0x3548(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3568(0x40)
	struct FAnimNode_SequencePlayer ; // 0x35a8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x35e8(0x48)
	struct FAnimNode_StateResult ; // 0x3630(0x20)
	struct FAnimNode_TransitionResult ; // 0x3650(0x28)
	struct FAnimNode_TransitionResult ; // 0x3678(0x28)
	struct FAnimNode_TransitionResult ; // 0x36a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x36c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x36f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3718(0x28)
	struct FAnimNode_TransitionResult ; // 0x3740(0x28)
	struct FAnimNode_TransitionResult ; // 0x3768(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3790(0x40)
	struct FAnimNode_StateResult ; // 0x37d0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x37f0(0x40)
	struct FAnimNode_StateResult ; // 0x3830(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3850(0x40)
	struct FAnimNode_StateResult ; // 0x3890(0x20)
	struct FAnimNode_SequencePlayer ; // 0x38b0(0x40)
	struct FAnimNode_StateResult ; // 0x38f0(0x20)
	struct FAnimNode_TransitionResult ; // 0x3910(0x28)
	struct FAnimNode_StateMachine ; // 0x3938(0xc8)
	struct FAnimNode_StateResult ; // 0x3a00(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3a20(0x40)
	struct FAnimNode_StateResult ; // 0x3a60(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3a80(0x40)
	struct FAnimNode_StateResult ; // 0x3ac0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3ae0(0x40)
	struct FAnimNode_StateResult ; // 0x3b20(0x20)
	struct FAnimNode_TransitionResult ; // 0x3b40(0x28)
	struct FAnimNode_StateMachine ; // 0x3b68(0xc8)
	struct FAnimNode_StateResult ; // 0x3c30(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3c50(0x40)
	struct FAnimNode_StateResult ; // 0x3c90(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3cb0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x3cf0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x3db8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x3e20(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3e68(0x40)
	struct FAnimNode_StateResult ; // 0x3ea8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3ec8(0x40)
	struct FAnimNode_StateResult ; // 0x3f08(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3f28(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3f68(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x3fb0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4078(0x68)
	struct FAnimNode_BlendListByBool ; // 0x40e0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4128(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4168(0x40)
	struct FAnimNode_StateResult ; // 0x41a8(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x41c8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4290(0x68)
	struct FAnimNode_SequencePlayer ; // 0x42f8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4338(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4380(0x40)
	struct FAnimNode_BlendListByBool ; // 0x43c0(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x4408(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x44d0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x4538(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4600(0x68)
	struct FAnimNode_TransitionResult ; // 0x4668(0x28)
	struct FAnimNode_TransitionResult ; // 0x4690(0x28)
	struct FAnimNode_SequencePlayer ; // 0x46b8(0x40)
	struct FAnimNode_StateResult ; // 0x46f8(0x20)
	struct FAnimNode_RefPose ; // 0x4718(0x10)
	struct FAnimNode_StateResult ; // 0x4728(0x20)
	struct FAnimNode_StateMachine ; // 0x4748(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x4810(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x48d8(0x68)
	struct FAnimNode_StateResult ; // 0x4940(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4960(0x40)
	struct FAnimNode_StateResult ; // 0x49a0(0x20)
	struct FAnimNode_StateMachine ; // 0x49c0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4a88(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4ad0(0xc8)
	struct FAnimNode_TransitionResult ; // 0x4b98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4bc0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4be8(0x40)
	struct FAnimNode_StateResult ; // 0x4c28(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4c48(0x10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4c58(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4c78(0xc8)

	void Fauna Jump(struct FPoseLink& Fauna Jump); // Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna Jump // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void Fauna IdleTurn(struct FPoseLink InPose IdleTurn, struct FPoseLink& Fauna IdleTurn); // Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna IdleTurn // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void Fauna Idle(struct FPoseLink InPose Idle, struct FPoseLink& Fauna Idle); // Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna Idle // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function Grandma_AnimBP.Grandma_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_FallExit(); // Function Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_FallExit // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LandAddExit(); // Function Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandAddExit // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LandEnter(); // Function Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandEnter // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Grandma_AnimBP(int32_t EntryPoint); // Function Grandma_AnimBP.Grandma_AnimBP_C.ExecuteUbergraph_Grandma_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

