// ScriptStruct Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x3a8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct FName ; // 0x30(0x04)
	struct FName ; // 0x34(0x04)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct FName ; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct TArray<float> ; // 0x58(0x10)
	struct TArray<float> ; // 0x68(0x10)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct FName ; // 0x90(0x04)
	struct FName ; // 0x94(0x04)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	float ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct TArray<float> ; // 0xb0(0x10)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	struct FName ; // 0xd0(0x04)
	int32_t ; // 0xd4(0x04)
	struct UAnimSequenceBase* ; // 0xd8(0x08)
	struct UAnimSequenceBase* ; // 0xe0(0x08)
	struct FName ; // 0xe8(0x04)
	int32_t ; // 0xec(0x04)
	struct UAnimSequenceBase* ; // 0xf0(0x08)
	struct FName ; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UAnimSequenceBase* ; // 0x100(0x08)
	struct FName ; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	struct FName ; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	struct FName ; // 0x128(0x04)
	struct FName ; // 0x12c(0x04)
	struct UAnimSequenceBase* ; // 0x130(0x08)
	struct FName ; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct UAnimSequenceBase* ; // 0x140(0x08)
	struct FName ; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UAnimSequenceBase* ; // 0x150(0x08)
	struct FName ; // 0x158(0x04)
	struct FName ; // 0x15c(0x04)
	int32_t ; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct UAnimSequenceBase* ; // 0x168(0x08)
	struct FName ; // 0x170(0x04)
	int32_t ; // 0x174(0x04)
	struct UAnimSequenceBase* ; // 0x178(0x08)
	struct UBlendSpace* ; // 0x180(0x08)
	float ; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct UAnimSequenceBase* ; // 0x190(0x08)
	struct FName ; // 0x198(0x04)
	int32_t ; // 0x19c(0x04)
	struct UAnimSequenceBase* ; // 0x1a0(0x08)
	struct FName ; // 0x1a8(0x04)
	int32_t ; // 0x1ac(0x04)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	enum class EBlendListTransitionType ; // 0x1b8(0x01)
	char pad_1B9[0x7]; // 0x1b9(0x07)
	struct TArray<float> ; // 0x1c0(0x10)
	struct TArray<float> ; // 0x1d0(0x10)
	struct UAnimSequenceBase* ; // 0x1e0(0x08)
	struct UAnimSequenceBase* ; // 0x1e8(0x08)
	struct FName ; // 0x1f0(0x04)
	int32_t ; // 0x1f4(0x04)
	struct UBlendSpace* ; // 0x1f8(0x08)
	struct UAnimSequenceBase* ; // 0x200(0x08)
	struct TArray<float> ; // 0x208(0x10)
	struct UAnimSequenceBase* ; // 0x218(0x08)
	struct TArray<float> ; // 0x220(0x10)
	struct UBlendSpace* ; // 0x230(0x08)
	struct UBlendSpace* ; // 0x238(0x08)
	struct FName ; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct UBlendSpace* ; // 0x248(0x08)
	enum class EAnimSyncMethod ; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName ; // 0x254(0x04)
	struct FName ; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct UAnimSequenceBase* ; // 0x260(0x08)
	struct FName ; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UBlendProfile* ; // 0x270(0x08)
	struct UCurveFloat* ; // 0x278(0x08)
	enum class EAlphaBlendOption ; // 0x280(0x01)
	enum class EBlendListTransitionType ; // 0x281(0x01)
	char pad_282[0x6]; // 0x282(0x06)
	struct TArray<float> ; // 0x288(0x10)
	bool ; // 0x298(0x01)
	char pad_299[0x3]; // 0x299(0x03)
	float ; // 0x29c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x2a0(0x2c)
	float ; // 0x2cc(0x04)
	struct UAnimSequenceBase* ; // 0x2d0(0x08)
	bool ; // 0x2d8(0x01)
	enum class EAnimSyncMethod ; // 0x2d9(0x01)
	enum class EAnimGroupRole ; // 0x2da(0x01)
	char pad_2DB[0x1]; // 0x2db(0x01)
	struct FName ; // 0x2dc(0x04)
	int32_t ; // 0x2e0(0x04)
	enum class ERefPoseType ; // 0x2e4(0x01)
	char pad_2E5[0x3]; // 0x2e5(0x03)
	struct FName ; // 0x2e8(0x04)
	struct FName ; // 0x2ec(0x04)
	int32_t ; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct FAnimNodeFunctionRef ; // 0x2f8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x310(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x390(0x18)
};

// ScriptStruct Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x71 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float ; // 0x04(0x04)
	bool ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	bool ; // 0x20(0x01)
	bool ; // 0x21(0x01)
	bool ; // 0x22(0x01)
	bool ; // 0x23(0x01)
	bool ; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	bool ; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float ; // 0x34(0x04)
	float ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
	bool ; // 0x3d(0x01)
	char pad_3E[0x2]; // 0x3e(0x02)
	float ; // 0x40(0x04)
	bool ; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float ; // 0x48(0x04)
	float ; // 0x4c(0x04)
	bool ; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float ; // 0x54(0x04)
	bool ; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float ; // 0x5c(0x04)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
	float ; // 0x68(0x04)
	float ; // 0x6c(0x04)
	bool ; // 0x70(0x01)
};

