// UserDefinedStruct GravityOverrideParamsStruct.GravityOverrideParamsStruct
// Size: 0x750 (Inherited: 0x00)
struct FGravityOverrideParamsStruct {
	struct FGravityOverrideSettingStruct Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x00(0x68)
	struct FGravityOverrideSettingStruct Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x68(0x68)
	struct FGravityOverrideSettingStruct Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xd0(0x68)
	struct FGravityOverrideSettingStruct Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x138(0x68)
	struct FGravityOverrideSettingStruct OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x1a0(0x68)
	struct FGravityOverrideSettingStruct OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x208(0x68)
	struct FGravityOverrideSettingStruct EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572; // 0x270(0x68)
	struct FGravityOverrideSettingStruct Swimming_35_33CE87CE4D4F712B1384E29115845962; // 0x2d8(0x68)
	struct FGravityOverrideSettingStruct Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490; // 0x340(0x68)
	struct FGravityOverrideSettingStruct DBNO_40_83703B55467F014D644D02B56709A2E6; // 0x3a8(0x68)
	struct FGravityOverrideSettingStruct DBNO_Carried_41_2C3D52AF4B7EB85DBA7C108948E58B3A; // 0x410(0x68)
	struct FGravityOverrideSettingStruct OnGround_Falling_45_DC16623B41084152717ACBAF5DCE8A91; // 0x478(0x68)
	struct FGravityOverrideSettingStruct Ziplining_46_0F05199D45821770F22E0B957551FEB7; // 0x4e0(0x68)
	struct FGravityOverrideSettingStruct Skydive_Surfing_49_5869AA5846BEE7C351769C951D56A34F; // 0x548(0x68)
	struct FGravityOverrideSettingStruct Riding_Standing_54_C62E341C48CF5BA85ACB799EE3C7653E; // 0x5b0(0x68)
	struct FGravityOverrideSettingStruct Riding_Moving_55_86CD46C94E5B465A175A6B939DB193BD; // 0x618(0x68)
	struct FGravityOverrideSettingStruct Riding_Moving_Targeting_58_38650D3547535FB293E61CBCF1B753BF; // 0x680(0x68)
	struct FGravityOverrideSettingStruct Tactical_Sprint_57_7B4700A94AF4B34179554C8EC4EB52E0; // 0x6e8(0x68)
};

