// ScriptStruct HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x02 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
};

// ScriptStruct HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xe8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UBlendProfile* ; // 0x10(0x08)
	struct UCurveFloat* ; // 0x18(0x08)
	bool ; // 0x20(0x01)
	enum class EAlphaBlendOption ; // 0x21(0x01)
	enum class EBlendListTransitionType ; // 0x22(0x01)
	char pad_23[0x5]; // 0x23(0x05)
	struct TArray<float> ; // 0x28(0x10)
	struct FAnimNodeFunctionRef ; // 0x38(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x50(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xd0(0x18)
};

