// WidgetBlueprintGeneratedClass LoginCredentialSelect.LoginCredentialSelect_C
// Size: 0x4b8 (Inherited: 0x450)
struct ULoginCredentialSelect_C : UFortLoginCredentialSelect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x450(0x08)
	struct UCommonWidgetSwitcherLegacy* ; // 0x458(0x08)
	struct UCommonTextBlock* Erebus_Title; // 0x460(0x08)
	struct UCommonTextBlock* ErebusType; // 0x468(0x08)
	struct UImage* ; // 0x470(0x08)
	struct UImage* ; // 0x478(0x08)
	struct UImage* ; // 0x480(0x08)
	struct UImage* ; // 0x488(0x08)
	struct UImage* ; // 0x490(0x08)
	struct UImage* ; // 0x498(0x08)
	struct UImage* ; // 0x4a0(0x08)
	struct USafeZone* ; // 0x4a8(0x08)
	struct UBorder* TrademarksBorder; // 0x4b0(0x08)

	void Construct(); // Function LoginCredentialSelect.LoginCredentialSelect_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_LoginCredentialSelect(int32_t EntryPoint); // Function LoginCredentialSelect.LoginCredentialSelect_C.ExecuteUbergraph_LoginCredentialSelect // (Final|UbergraphFunction) // @ game+0xd67374
};

