// ScriptStruct MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x158 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct UBlendProfile* ; // 0x10(0x08)
	struct UCurveFloat* ; // 0x18(0x08)
	enum class EAlphaBlendOption ; // 0x20(0x01)
	enum class EBlendListTransitionType ; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct TArray<float> ; // 0x28(0x10)
	struct FName ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	enum class EAnimSyncMethod ; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	struct FName ; // 0x4c(0x04)
	struct FName ; // 0x50(0x04)
	int32_t ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	int32_t ; // 0x5c(0x04)
	bool ; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float ; // 0x64(0x04)
	struct FInputScaleBiasClampConstants ; // 0x68(0x2c)
	float ; // 0x94(0x04)
	bool ; // 0x98(0x01)
	enum class EAnimSyncMethod ; // 0x99(0x01)
	enum class EAnimGroupRole ; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
	struct FAnimNodeFunctionRef ; // 0xa0(0x18)
	struct FName ; // 0xb8(0x04)
	struct FName ; // 0xbc(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xc0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x140(0x18)
};

// ScriptStruct MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x48 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct UBlendSpace* ; // 0x08(0x08)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	struct UBlendSpace* ; // 0x18(0x08)
	float ; // 0x20(0x04)
	float ; // 0x24(0x04)
	struct UBlendSpace* ; // 0x28(0x08)
	float ; // 0x30(0x04)
	float ; // 0x34(0x04)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct UAnimSequenceBase* ; // 0x40(0x08)
};

