// AnimBlueprintGeneratedClass MenuScreen_Athena.MenuScreen_Athena_C
// Size: 0x6536 (Inherited: 0x8f0)
struct UMenuScreen_Athena_C : UFrontendAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x8f0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x8f8(0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xd50(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xd58(0x08)
	struct FAnimNode_LegIK ; // 0xd60(0xf8)
	struct FAnimNode_CopyBone ; // 0xe58(0xe8)
	struct FAnimNode_CopyBone ; // 0xf40(0xe8)
	struct FAnimNode_CopyBone ; // 0x1028(0xe8)
	struct FAnimNode_Slot ; // 0x1110(0x48)
	struct FAnimNode_CopyBone ; // 0x1158(0xe8)
	struct FAnimNode_ModifyBone ; // 0x1240(0x128)
	struct FAnimNode_LegIK ; // 0x1368(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1460(0xf8)
	struct FAnimNode_CopyBone ; // 0x1558(0xe8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1640(0xe8)
	struct FAnimNode_ModifyBone ; // 0x1728(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1850(0x20)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x1870(0x100)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1970(0x20)
	struct FAnimNode_ModifyBone ; // 0x1990(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1ab8(0x128)
	struct FAnimNode_SequencePlayer ; // 0x1be0(0x40)
	struct FAnimNode_BlendListByInt ; // 0x1c20(0x48)
	struct FAnimNode_BlendListByInt ; // 0x1c68(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1cb0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1cf0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1d30(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1d70(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1db0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x1df8(0x48)
	struct FAnimNode_BlendListByInt ; // 0x1e40(0x48)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1e88(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1ed0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1f10(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1f50(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1f90(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1fd0(0x48)
	struct FAnimNode_StateResult ; // 0x2018(0x20)
	struct FAnimNode_StateMachine ; // 0x2038(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2100(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2148(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2188(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x21c8(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2290(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x22d8(0x100)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x23d8(0x100)
	struct FAnimNode_TransitionResult ; // 0x24d8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x2500(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2568(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x25d0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2638(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x26a0(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x2708(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2750(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2798(0x48)
	struct FAnimNode_StateResult ; // 0x27e0(0x20)
	struct FAnimNode_StateMachine ; // 0x2800(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x28c8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2930(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2998(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2a00(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2a68(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2ad0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2b38(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2ba0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2c08(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x2c70(0x68)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2cd8(0xc0)
	struct FAnimNode_BlendListByEnum ; // 0x2d98(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2de0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2e28(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2e70(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2eb8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x2f00(0x48)
	struct FAnimNode_StateResult ; // 0x2f48(0x20)
	struct FAnimNode_StateMachine ; // 0x2f68(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3030(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x30f8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x31c0(0x68)
	struct FAnimNode_StateResult ; // 0x3228(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3248(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x32b0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3318(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3380(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x33e8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x3430(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x3478(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x34c0(0x68)
	struct FAnimNode_StateResult ; // 0x3528(0x20)
	struct FAnimNode_StateMachine ; // 0x3548(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x3610(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3678(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x36e0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3748(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x37b0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x37f8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x3840(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x38a8(0x48)
	struct FAnimNode_StateResult ; // 0x38f0(0x20)
	struct FAnimNode_StateMachine ; // 0x3910(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x39d8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x3aa0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x3b08(0xc8)
	struct FAnimNode_StateResult ; // 0x3bd0(0x20)
	struct FAnimNode_StateMachine ; // 0x3bf0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3cb8(0xc8)
	struct FAnimNode_TransitionResult ; // 0x3d80(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x3da8(0x68)
	struct FAnimNode_StateResult ; // 0x3e10(0x20)
	struct FAnimNode_StateMachine ; // 0x3e30(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3ef8(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x3fc0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x4088(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x40c8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4190(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x41f8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x42c0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4328(0x68)
	struct FAnimNode_StateResult ; // 0x4390(0x20)
	struct FAnimNode_ApplyAdditive ; // 0x43b0(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4478(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x44e0(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x4548(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x4590(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4658(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x46c0(0x68)
	struct FAnimNode_StateResult ; // 0x4728(0x20)
	struct FAnimNode_StateMachine ; // 0x4748(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x4810(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4850(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4890(0x40)
	struct FAnimNode_SequencePlayer ; // 0x48d0(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4910(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x4950(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4998(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x49e0(0x48)
	struct FAnimNode_StateResult ; // 0x4a28(0x20)
	struct FAnimNode_StateMachine ; // 0x4a48(0xc8)
	struct FAnimNode_BlendListByEnum ; // 0x4b10(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4b58(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x4b80(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4be8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4c50(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4cb8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4d20(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x4d88(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4dd0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4e18(0x48)
	struct FAnimNode_StateResult ; // 0x4e60(0x20)
	struct FAnimNode_StateMachine ; // 0x4e80(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4f48(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x4fb0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5018(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5080(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x50e8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x5150(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5198(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x51e0(0x48)
	struct FAnimNode_StateResult ; // 0x5228(0x20)
	struct FAnimNode_StateMachine ; // 0x5248(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x5310(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x53d8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x54a0(0x68)
	struct FAnimNode_StateResult ; // 0x5508(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x5528(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5590(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x55f8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5660(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x56c8(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5710(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5758(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x57c0(0x48)
	struct FAnimNode_StateResult ; // 0x5808(0x20)
	struct FAnimNode_StateMachine ; // 0x5828(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x58f0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5958(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x59c0(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5a28(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x5a90(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5ad8(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5b20(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5b68(0x68)
	struct FAnimNode_StateResult ; // 0x5bd0(0x20)
	struct FAnimNode_StateMachine ; // 0x5bf0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x5cb8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5d80(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5de8(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5eb0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5ed0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x5f98(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x6098(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6198(0x28)
	struct FAnimNode_UseCachedPose ; // 0x61c0(0x28)
	struct FAnimNode_Slot ; // 0x61e8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x6230(0x28)
	struct FAnimNode_Slot ; // 0x6258(0x48)
	struct FAnimNode_UseCachedPose ; // 0x62a0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x62c8(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6310(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6330(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6378(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x63a0(0x100)
	struct FMulticastInlineDelegate MenuScreenDispatcher; // 0x64a0(0x10)
	bool IsSkydiveDiving_Potato; // 0x64b0(0x01)
	bool HasBeenSelected; // 0x64b1(0x01)
	char pad_64B2[0x2]; // 0x64b2(0x02)
	int32_t PoseInt; // 0x64b4(0x04)
	struct FVector OffsetTranslate; // 0x64b8(0x18)
	struct FRotator OffsetRotate; // 0x64d0(0x18)
	struct APlayerPawn_Athena_C* PawnOwner; // 0x64e8(0x08)
	double StartTime; // 0x64f0(0x08)
	double PlayRate; // 0x64f8(0x08)
	double HidePropTimeRemaining; // 0x6500(0x08)
	bool HidePropBones; // 0x6508(0x01)
	bool HasWeaponEquipped; // 0x6509(0x01)
	char pad_650A[0x6]; // 0x650a(0x06)
	struct AFortWeapon* Equipped Weapon; // 0x6510(0x08)
	struct UAnimMontage* Current Idle Montage; // 0x6518(0x08)
	double Skydive Aim Yaw; // 0x6520(0x08)
	double Skydive Aim Pitch; // 0x6528(0x08)
	int32_t WeaponHandPose; // 0x6530(0x04)
	bool OneHandedWeapon; // 0x6534(0x01)
	bool Dual; // 0x6535(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function MenuScreen_Athena.MenuScreen_Athena_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void CalculateMontagePlayTiming(); // Function MenuScreen_Athena.MenuScreen_Athena_C.CalculateMontagePlayTiming // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void HidePropsForBlend(struct UAnimMontage* NewMontage); // Function MenuScreen_Athena.MenuScreen_Athena_C.HidePropsForBlend // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_BlendListByBool_846B1F144FCC62C0860150BBCD95C2E8(); // Function MenuScreen_Athena.MenuScreen_Athena_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_BlendListByBool_846B1F144FCC62C0860150BBCD95C2E8 // (BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_TransitionResult_2E3328A94B338669440FEBAFF4C036E7(); // Function MenuScreen_Athena.MenuScreen_Athena_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_TransitionResult_2E3328A94B338669440FEBAFF4C036E7 // (BlueprintEvent) // @ game+0xd67374
	void AnimNotify_playFacialAnim(); // Function MenuScreen_Athena.MenuScreen_Athena_C.AnimNotify_playFacialAnim // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void UserFocus(); // Function MenuScreen_Athena.MenuScreen_Athena_C.UserFocus // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LeftB(); // Function MenuScreen_Athena.MenuScreen_Athena_C.AnimNotify_LeftB // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function MenuScreen_Athena.MenuScreen_Athena_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void BlueprintInitializeAnimation(); // Function MenuScreen_Athena.MenuScreen_Athena_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LobbySkydive_Diving(); // Function MenuScreen_Athena.MenuScreen_Athena_C.AnimNotify_LobbySkydive_Diving // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_LobbySkydive_Gliding(); // Function MenuScreen_Athena.MenuScreen_Athena_C.AnimNotify_LobbySkydive_Gliding // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void OnMontageStarted_Event_HideProps(struct UAnimMontage* Montage); // Function MenuScreen_Athena.MenuScreen_Athena_C.OnMontageStarted_Event_HideProps // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void OnMontageBlendingOut_Event_HideProps(struct UAnimMontage* Montage, bool bInterrupted); // Function MenuScreen_Athena.MenuScreen_Athena_C.OnMontageBlendingOut_Event_HideProps // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void OnFocusedItemChanged(struct UFortItemDefinition* FocusedItem, struct AFortWeapon* EquippedWeapon, struct AFortPlayerParachute* CurrentParachute); // Function MenuScreen_Athena.MenuScreen_Athena_C.OnFocusedItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_MenuScreen_Athena(int32_t EntryPoint); // Function MenuScreen_Athena.MenuScreen_Athena_C.ExecuteUbergraph_MenuScreen_Athena // (Final|UbergraphFunction) // @ game+0xd67374
	void MenuScreenDispatcher__DelegateSignature(); // Function MenuScreen_Athena.MenuScreen_Athena_C.MenuScreenDispatcher__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
};

