// ScriptStruct MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedMutableData
// Size: 0x455 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	int32_t ; // 0x0c(0x04)
	int32_t ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	float ; // 0x20(0x04)
	float ; // 0x24(0x04)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	float ; // 0x30(0x04)
	char ; // 0x34(0x01)
	char ; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	int32_t ; // 0x38(0x04)
	int32_t ; // 0x3c(0x04)
	float ; // 0x40(0x04)
	float ; // 0x44(0x04)
	float ; // 0x48(0x04)
	float ; // 0x4c(0x04)
	float ; // 0x50(0x04)
	float ; // 0x54(0x04)
	float ; // 0x58(0x04)
	float ; // 0x5c(0x04)
	char ; // 0x60(0x01)
	bool ; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	bool ; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UBlendSpace* ; // 0x80(0x08)
	float ; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct UBlendSpace* ; // 0x90(0x08)
	float ; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UBlendSpace* ; // 0xa0(0x08)
	float ; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct UBlendSpace* ; // 0xb0(0x08)
	float ; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct UBlendSpace* ; // 0xc0(0x08)
	float ; // 0xc8(0x04)
	char ; // 0xcc(0x01)
	char ; // 0xcd(0x01)
	char ; // 0xce(0x01)
	char pad_CF[0x1]; // 0xcf(0x01)
	struct UBlendSpace* ; // 0xd0(0x08)
	float ; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct UBlendSpace* ; // 0xe0(0x08)
	float ; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct UBlendSpace* ; // 0xf0(0x08)
	float ; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UBlendSpace* ; // 0x100(0x08)
	float ; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UBlendSpace* ; // 0x110(0x08)
	float ; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UBlendSpace* ; // 0x120(0x08)
	float ; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
	struct UBlendSpace* ; // 0x130(0x08)
	float ; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct UBlendSpace* ; // 0x140(0x08)
	float ; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UBlendSpace* ; // 0x150(0x08)
	float ; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)
	struct UBlendSpace* ; // 0x160(0x08)
	float ; // 0x168(0x04)
	char ; // 0x16c(0x01)
	char ; // 0x16d(0x01)
	char ; // 0x16e(0x01)
	char ; // 0x16f(0x01)
	char ; // 0x170(0x01)
	char ; // 0x171(0x01)
	char pad_172[0x6]; // 0x172(0x06)
	struct UBlendSpace* ; // 0x178(0x08)
	float ; // 0x180(0x04)
	float ; // 0x184(0x04)
	struct UBlendSpace* ; // 0x188(0x08)
	float ; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)
	struct UBlendSpace* ; // 0x198(0x08)
	float ; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct UBlendSpace* ; // 0x1a8(0x08)
	float ; // 0x1b0(0x04)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct UBlendSpace* ; // 0x1b8(0x08)
	float ; // 0x1c0(0x04)
	char ; // 0x1c4(0x01)
	char ; // 0x1c5(0x01)
	char ; // 0x1c6(0x01)
	char pad_1C7[0x1]; // 0x1c7(0x01)
	struct UBlendSpace* ; // 0x1c8(0x08)
	float ; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct UBlendSpace* ; // 0x1d8(0x08)
	float ; // 0x1e0(0x04)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	struct UBlendSpace* ; // 0x1e8(0x08)
	float ; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct UBlendSpace* ; // 0x1f8(0x08)
	float ; // 0x200(0x04)
	char pad_204[0x4]; // 0x204(0x04)
	struct UBlendSpace* ; // 0x208(0x08)
	float ; // 0x210(0x04)
	char ; // 0x214(0x01)
	char ; // 0x215(0x01)
	char pad_216[0x2]; // 0x216(0x02)
	struct UBlendSpace* ; // 0x218(0x08)
	float ; // 0x220(0x04)
	char ; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct UBlendSpace* ; // 0x228(0x08)
	float ; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct UBlendSpace* ; // 0x238(0x08)
	float ; // 0x240(0x04)
	float ; // 0x244(0x04)
	struct UBlendSpace* ; // 0x248(0x08)
	float ; // 0x250(0x04)
	float ; // 0x254(0x04)
	struct UBlendSpace* ; // 0x258(0x08)
	float ; // 0x260(0x04)
	float ; // 0x264(0x04)
	struct UBlendSpace* ; // 0x268(0x08)
	float ; // 0x270(0x04)
	float ; // 0x274(0x04)
	struct UBlendSpace* ; // 0x278(0x08)
	float ; // 0x280(0x04)
	float ; // 0x284(0x04)
	struct UBlendSpace* ; // 0x288(0x08)
	float ; // 0x290(0x04)
	float ; // 0x294(0x04)
	char ; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct UBlendSpace* ; // 0x2a0(0x08)
	float ; // 0x2a8(0x04)
	float ; // 0x2ac(0x04)
	struct UBlendSpace* ; // 0x2b0(0x08)
	float ; // 0x2b8(0x04)
	float ; // 0x2bc(0x04)
	struct UAnimSequenceBase* ; // 0x2c0(0x08)
	struct UAnimSequenceBase* ; // 0x2c8(0x08)
	struct UAnimSequenceBase* ; // 0x2d0(0x08)
	struct UAnimSequenceBase* ; // 0x2d8(0x08)
	struct UAnimSequenceBase* ; // 0x2e0(0x08)
	char ; // 0x2e8(0x01)
	char ; // 0x2e9(0x01)
	char ; // 0x2ea(0x01)
	char ; // 0x2eb(0x01)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct UBlendSpace* ; // 0x2f0(0x08)
	float ; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct UBlendSpace* ; // 0x300(0x08)
	float ; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct UBlendSpace* ; // 0x310(0x08)
	float ; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct UBlendSpace* ; // 0x320(0x08)
	float ; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct UBlendSpace* ; // 0x330(0x08)
	float ; // 0x338(0x04)
	char ; // 0x33c(0x01)
	char ; // 0x33d(0x01)
	char ; // 0x33e(0x01)
	char pad_33F[0x1]; // 0x33f(0x01)
	struct UBlendSpace* ; // 0x340(0x08)
	float ; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct UBlendSpace* ; // 0x350(0x08)
	float ; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
	struct UBlendSpace* ; // 0x360(0x08)
	float ; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct UBlendSpace* ; // 0x370(0x08)
	float ; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UBlendSpace* ; // 0x380(0x08)
	float ; // 0x388(0x04)
	char ; // 0x38c(0x01)
	char ; // 0x38d(0x01)
	char ; // 0x38e(0x01)
	char pad_38F[0x1]; // 0x38f(0x01)
	struct UBlendSpace* ; // 0x390(0x08)
	float ; // 0x398(0x04)
	float ; // 0x39c(0x04)
	struct UBlendSpace* ; // 0x3a0(0x08)
	float ; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct UBlendSpace* ; // 0x3b0(0x08)
	float ; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct UBlendSpace* ; // 0x3c0(0x08)
	float ; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UBlendSpace* ; // 0x3d0(0x08)
	float ; // 0x3d8(0x04)
	char ; // 0x3dc(0x01)
	char ; // 0x3dd(0x01)
	char pad_3DE[0x2]; // 0x3de(0x02)
	struct UBlendSpace* ; // 0x3e0(0x08)
	float ; // 0x3e8(0x04)
	char ; // 0x3ec(0x01)
	char pad_3ED[0x3]; // 0x3ed(0x03)
	struct UBlendSpace* ; // 0x3f0(0x08)
	float ; // 0x3f8(0x04)
	float ; // 0x3fc(0x04)
	struct UBlendSpace* ; // 0x400(0x08)
	float ; // 0x408(0x04)
	float ; // 0x40c(0x04)
	struct UBlendSpace* ; // 0x410(0x08)
	float ; // 0x418(0x04)
	float ; // 0x41c(0x04)
	struct UBlendSpace* ; // 0x420(0x08)
	float ; // 0x428(0x04)
	float ; // 0x42c(0x04)
	char ; // 0x430(0x01)
	char ; // 0x431(0x01)
	char ; // 0x432(0x01)
	char pad_433[0x5]; // 0x433(0x05)
	struct UBlendSpace* ; // 0x438(0x08)
	float ; // 0x440(0x04)
	float ; // 0x444(0x04)
	struct UBlendSpace* ; // 0x448(0x08)
	float ; // 0x450(0x04)
	bool ; // 0x454(0x01)
};

// ScriptStruct MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedConstantData
// Size: 0x220 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct FName ; // 0x50(0x04)
	struct FName ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	enum class EAnimGroupRole ; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FName ; // 0x6c(0x04)
	enum class EAnimSyncMethod ; // 0x70(0x01)
	enum class EAnimGroupRole ; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FName ; // 0x74(0x04)
	struct FInputScaleBiasClampConstants ; // 0x78(0x2c)
	struct FName ; // 0xa4(0x04)
	struct TArray<float> ; // 0xa8(0x10)
	struct TArray<int32_t> ; // 0xb8(0x10)
	struct FName ; // 0xc8(0x04)
	struct FName ; // 0xcc(0x04)
	struct FName ; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<float> ; // 0xd8(0x10)
	struct TArray<float> ; // 0xe8(0x10)
	struct TArray<int32_t> ; // 0xf8(0x10)
	enum class EBlendListTransitionType ; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<int32_t> ; // 0x110(0x10)
	struct FName ; // 0x120(0x04)
	int32_t ; // 0x124(0x04)
	bool ; // 0x128(0x01)
	char pad_129[0x3]; // 0x129(0x03)
	float ; // 0x12c(0x04)
	float ; // 0x130(0x04)
	enum class EAnimSyncMethod ; // 0x134(0x01)
	enum class EAnimGroupRole ; // 0x135(0x01)
	char pad_136[0x2]; // 0x136(0x02)
	struct FName ; // 0x138(0x04)
	struct FName ; // 0x13c(0x04)
	int32_t ; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct UBlendProfile* ; // 0x148(0x08)
	struct UCurveFloat* ; // 0x150(0x08)
	bool ; // 0x158(0x01)
	enum class EAlphaBlendOption ; // 0x159(0x01)
	enum class EBlendListTransitionType ; // 0x15a(0x01)
	char pad_15B[0x5]; // 0x15b(0x05)
	struct TArray<float> ; // 0x160(0x10)
	struct FAnimNodeFunctionRef ; // 0x170(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x188(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x208(0x18)
};

