// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
// Size: 0x3970 (Inherited: 0x31d0)
struct ANPC_Pawn_Parent_C : AFortAIPawn {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x31d0(0x08)
	struct UFortPawnComponent_CustomDepth* FortPawnComponent_CustomDepth; // 0x31d8(0x08)
	struct UCapsuleComponent* WeaponCapsuleCollision; // 0x31e0(0x08)
	struct UFortTaggedNavFiltersComponent* FortTaggedNavFilters; // 0x31e8(0x08)
	struct UFortActorComponent_Affiliation* FortActorComponent_Affiliation; // 0x31f0(0x08)
	struct USoundLibraryComponent* SoundLibrary_Component; // 0x31f8(0x08)
	struct UAudioComponent* MovementAudioComponent; // 0x3200(0x08)
	struct UNPC_VoiceComponent_C* NPC_VoiceComponent; // 0x3208(0x08)
	struct UAudioComponent* VOAudioComponent; // 0x3210(0x08)
	struct UFortWidgetComponent* NPCStatusWidget; // 0x3218(0x08)
	float Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3220(0x04)
	enum class ETimelineDirection Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3224(0x01)
	char pad_3225[0x3]; // 0x3225(0x03)
	struct UTimelineComponent* Timeline_ScaleMeshInOrOut; // 0x3228(0x08)
	struct UGameplayEffect* GE_NPC_RecentlyDamaged; // 0x3230(0x08)
	enum class Enum_NPC_AlertLevel NPC_AlertLevel; // 0x3238(0x01)
	enum class Enum_NPC_AlertLevel NPC_AlertLevelPrevious; // 0x3239(0x01)
	char pad_323A[0x6]; // 0x323a(0x06)
	struct TMap<enum class Enum_NPC_AlertLevel, struct FGameplayTag> NPC AlertLevelToTagMap; // 0x3240(0x50)
	bool NPC StatusWidgetHealthBarDisabled; // 0x3290(0x01)
	char pad_3291[0x3]; // 0x3291(0x03)
	struct FGameplayTag GameplayCue_PickupGrabbed; // 0x3294(0x04)
	enum class EFortRarity NPC BestLootRarityInInventory; // 0x3298(0x01)
	bool NPC DebugPawn; // 0x3299(0x01)
	bool NPC ShowInventoryRarityVisuals; // 0x329a(0x01)
	char pad_329B[0x5]; // 0x329b(0x05)
	double InventoryGlowDelay; // 0x32a0(0x08)
	struct FScalableFloat NPC NumberOfInventoryItemsToDeliverHF; // 0x32a8(0x28)
	bool NPC SpawnInvisible; // 0x32d0(0x01)
	bool NPC ScaleMeshInOnSpawn; // 0x32d1(0x01)
	char pad_32D2[0x6]; // 0x32d2(0x06)
	struct FGameplayTagContainer TC_NPC SpawnAbilityTag; // 0x32d8(0x20)
	struct FGameplayTagContainer TC_NPC AlternateSpawnAbilityTag; // 0x32f8(0x20)
	bool NPC IsSpawning; // 0x3318(0x01)
	char pad_3319[0x7]; // 0x3319(0x07)
	double NPC OriginalGravityScale; // 0x3320(0x08)
	struct FRotator NPC OriginalRotationRate; // 0x3328(0x18)
	bool NPC HasPawnGoal; // 0x3340(0x01)
	char pad_3341[0x7]; // 0x3341(0x07)
	struct AActor* NPC PawnGoalActor; // 0x3348(0x08)
	struct FScalableFloat NPC NumberOfInventoryItemsToConsumeBeforeFullHF; // 0x3350(0x28)
	bool NPC PawnIsDestroyingBuildingForNavigation; // 0x3378(0x01)
	char pad_3379[0x7]; // 0x3379(0x07)
	struct FScalableFloat MaxIdleVODelay; // 0x3380(0x28)
	struct FScalableFloat MinIdleVODelay; // 0x33a8(0x28)
	struct FScalableFloat NPC DeathDropLootDelay; // 0x33d0(0x28)
	struct FName NPC DeathDropLootTierGroupName; // 0x33f8(0x04)
	char pad_33FC[0x4]; // 0x33fc(0x04)
	struct FGameplayTagContainer NPC DeathDropLootRequiredDamageTags; // 0x3400(0x20)
	struct FGameplayTagContainer NPC DeathDropLootForbiddenDamageTags; // 0x3420(0x20)
	struct FGameplayTagContainer GrantStartingItemsAbilityTC; // 0x3440(0x20)
	bool NPC HasItemInInventory; // 0x3460(0x01)
	char pad_3461[0x3]; // 0x3461(0x03)
	struct FGameplayTag VoiceTag_FullAlertIdle; // 0x3464(0x04)
	struct FGameplayTag VoiceTag_Idle; // 0x3468(0x04)
	struct FGameplayTag VoiceTag_ReturnToIdle; // 0x346c(0x04)
	struct FGameplayTag VoiceTag_LostTarget; // 0x3470(0x04)
	struct FGameplayTag VoiceTag_Suspicious; // 0x3474(0x04)
	struct FGameplayTag VoiceTag_FullAlert; // 0x3478(0x04)
	char pad_347C[0x4]; // 0x347c(0x04)
	struct TArray<struct FStruct_NPC_TargetSlots> NPC TargetSlotsHF; // 0x3480(0x10)
	bool NPC DamageCanCancelIntroPhase; // 0x3490(0x01)
	char pad_3491[0x7]; // 0x3491(0x07)
	struct FGameplayTagQuery TQ_NPC DamageTagsThatCanCancelIntroPhase; // 0x3498(0x48)
	struct UGameplayEffect* GE_NPC_IntroPhaseBehaviorCooldown; // 0x34e0(0x08)
	struct FGameplayTagContainer TC_IntroBehaviorActive; // 0x34e8(0x20)
	bool Debug_NPC_AlertLevelForced; // 0x3508(0x01)
	bool NPC PawnCanInteractInternal; // 0x3509(0x01)
	char pad_350A[0x6]; // 0x350a(0x06)
	struct FScalableFloat NPC PrimtiveDataFloatSetRandomlyInRange; // 0x3510(0x28)
	struct FScalableFloat NPC PrimtiveDataFloatIndexHF; // 0x3538(0x28)
	struct FScalableFloat NPC PrimtiveDataFloatMinRangeHF; // 0x3560(0x28)
	struct FScalableFloat NPC PrimtiveDataFloatMaxRangeHF; // 0x3588(0x28)
	struct AActor* NPC Leader; // 0x35b0(0x08)
	struct FGameplayTag GameplayCue_LeaderSet; // 0x35b8(0x04)
	char pad_35BC[0x4]; // 0x35bc(0x04)
	double NPC Skeletal Mesh Index; // 0x35c0(0x08)
	struct USoundBase* TamedSound; // 0x35c8(0x08)
	struct UAudioComponent* StateChangeSound; // 0x35d0(0x08)
	struct FScalableFloat NPC ShouldDespawnFromStormHF; // 0x35d8(0x28)
	struct FScalableFloat NPC DespawnTimerHF; // 0x3600(0x28)
	struct FGameplayTag NPC DespawnGameplayTag; // 0x3628(0x04)
	char pad_362C[0x4]; // 0x362c(0x04)
	struct FTimerHandle NPC TestIsInSafeZoneTimer; // 0x3630(0x08)
	struct FTimerHandle NPC DespawnFromStormTimer; // 0x3638(0x08)
	bool NPC isTryingToDespawn; // 0x3640(0x01)
	char pad_3641[0x3]; // 0x3641(0x03)
	struct FGameplayTag NPC ResetIntroGameplayTags; // 0x3644(0x04)
	double SelectedPrimitiveDataFloat; // 0x3648(0x08)
	struct FGameplayTag GameplayCue_Death; // 0x3650(0x04)
	char pad_3654[0x4]; // 0x3654(0x04)
	struct TArray<struct UMaterialInterface*> OG Materials; // 0x3658(0x10)
	bool NPC Apply GE for Swimming; // 0x3668(0x01)
	char pad_3669[0x7]; // 0x3669(0x07)
	struct UGameplayEffect* NPC GE_ClassToApplyForSwimming; // 0x3670(0x08)
	bool Exit Burst GC; // 0x3678(0x01)
	char pad_3679[0x3]; // 0x3679(0x03)
	struct FActiveGameplayEffectHandle NPC GE_AppliedForSwimming; // 0x367c(0x08)
	struct FName GoalActorBBKey; // 0x3684(0x04)
	struct FGameplayTag GameplayCueLureInterest; // 0x3688(0x04)
	char pad_368C[0x4]; // 0x368c(0x04)
	struct UObject* NPC PreviousLureGoal; // 0x3690(0x08)
	struct FGameplayTag Exit Water; // 0x3698(0x04)
	struct FGameplayTag Enter Water; // 0x369c(0x04)
	struct FScalableFloat NPC MaxDistanceFromDamagedNPCToDrawHeallthBarHF; // 0x36a0(0x28)
	struct FScalableFloat NPC HealthBarHideTimeAfterDeathHF; // 0x36c8(0x28)
	struct FScalableFloat NPC PlayEffectWhenLuredHF; // 0x36f0(0x28)
	struct FScalableFloat NPC PawnCanInteractHF; // 0x3718(0x28)
	struct FScalableFloat NPC AllowInteractOnlyWhenUnawareHF; // 0x3740(0x28)
	struct FScalableFloat NPC AllowInteractWhenHasLeaderHF; // 0x3768(0x28)
	struct FScalableFloat NPC AllowDrownInShallowWaterHF; // 0x3790(0x28)
	bool NPC_IsInventoryInitialized; // 0x37b8(0x01)
	char pad_37B9[0x3]; // 0x37b9(0x03)
	float LeaderClearedCueDelay; // 0x37bc(0x04)
	struct FGameplayTag GameplayCue_LeaderCleared; // 0x37c0(0x04)
	bool isGCForLeaderSetLooping; // 0x37c4(0x01)
	char pad_37C5[0x3]; // 0x37c5(0x03)
	struct FGameplayTag NPC DeathByStormTag; // 0x37c8(0x04)
	bool NPC TryDespawnAbility; // 0x37cc(0x01)
	char pad_37CD[0x3]; // 0x37cd(0x03)
	struct FActiveGameplayEffectHandle GeOutsideSafeZoneDamageHandle; // 0x37d0(0x08)
	bool IsGEStormDamageInit; // 0x37d8(0x01)
	bool NPC MeshScalingInProgress; // 0x37d9(0x01)
	bool NPC DisableCapsuleOverlapsWhenScalingOut; // 0x37da(0x01)
	char pad_37DB[0x5]; // 0x37db(0x05)
	struct FVector NPC OriginalMeshScale; // 0x37e0(0x18)
	struct FMulticastInlineDelegate NPCScaleMeshInCompleted; // 0x37f8(0x10)
	struct FMulticastInlineDelegate NPCScaleMeshOutCompleted; // 0x3808(0x10)
	bool NPC_CanDropLoot; // 0x3818(0x01)
	char pad_3819[0x7]; // 0x3819(0x07)
	struct FScalableFloat NPC StaleDespawnTestDistance HF; // 0x3820(0x28)
	struct FScalableFloat NPC StaleDespawnTimeThreshold HF; // 0x3848(0x28)
	double NPC LastNonStaleCheckTime; // 0x3870(0x08)
	bool bCanBeDamagedByNullInstigator; // 0x3878(0x01)
	bool IsEnteringWater; // 0x3879(0x01)
	char pad_387A[0x6]; // 0x387a(0x06)
	struct FMulticastInlineDelegate NPCPawnInteractWithDispatcher; // 0x3880(0x10)
	bool NPCDynamicBlockConversionOnInteract; // 0x3890(0x01)
	bool NPC TempInteractOverride; // 0x3891(0x01)
	char pad_3892[0x6]; // 0x3892(0x06)
	struct USoundBase* HeadShot_Sound; // 0x3898(0x08)
	struct FName Headshot FX Socket; // 0x38a0(0x04)
	bool UseHeadShotFX; // 0x38a4(0x01)
	char pad_38A5[0x3]; // 0x38a5(0x03)
	struct FGameplayTagContainer TC_WeaponTypesAllowedForHeadshotFX; // 0x38a8(0x20)
	bool AllowHeadshot; // 0x38c8(0x01)
	char pad_38C9[0x7]; // 0x38c9(0x07)
	double AdditiveHitReactRetriggerDelay; // 0x38d0(0x08)
	struct UAnimMontage* Additive Hit React Montage; // 0x38d8(0x08)
	struct USoundBase* Death Normal Sound; // 0x38e0(0x08)
	struct UParticleSystem* HeadshotFXEmitterTemplate; // 0x38e8(0x08)
	struct TArray<struct USoundLibrary*> SoundLibs_Default; // 0x38f0(0x10)
	struct TArray<struct USoundLibrary*> SoundLibs_Alert; // 0x3900(0x10)
	struct USoundLibrary* CurrentSoundLib; // 0x3910(0x08)
	struct TArray<struct USoundLibrary*> SoundLibs_Aggressive; // 0x3918(0x10)
	struct TArray<struct USoundLibrary*> SoundLibs_Foley; // 0x3928(0x10)
	struct TArray<struct USoundLibrary*> SoundLibs_Foley_Water; // 0x3938(0x10)
	struct USoundLibrary* CurrentFoleyLib; // 0x3948(0x08)
	double Custom Depth Update Rate; // 0x3950(0x08)
	struct USoundLibraryContext* Class; // 0x3958(0x08)
	struct UGameplayEffect* GE_Converted; // 0x3960(0x08)
	struct FActiveGameplayEffectHandle GE_Converted_Handle; // 0x3968(0x08)

	void Orphaned(bool& IsOrphaned, struct AFortPawn*& AttachedPawn); // Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.Orphaned // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void PlayStateChangeAudio(enum class Enum_NPC_AlertLevel Index); // Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.PlayStateChangeAudio // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void IsConverted(bool& IsConverted); // Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.IsConverted // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
	void NPC GhostCollisionSettings(bool NoCollisionForRanged, bool NoCollisionForMelee, bool NoCollisionForProjectiles, bool OnlyOverlapCollisionForPawns); // Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC GhostCollisionSettings // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
