// AnimBlueprintGeneratedClass Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C
// Size: 0x41f0 (Inherited: 0x1610)
struct UPlayer_FullBodyAimOffsets_AnimBP_C : UFortPlayerPrototypeAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1610(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1618(0x1c)
	char pad_1634[0x4]; // 0x1634(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1638(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1640(0x08)
	struct FAnimNode_Root ; // 0x1648(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1668(0xc0)
	struct FAnimNode_Root ; // 0x1728(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1748(0xc0)
	struct FAnimNode_Root ; // 0x1808(0x20)
	struct FAnimNode_Root ; // 0x1828(0x20)
	struct FAnimNode_Root ; // 0x1848(0x20)
	struct FAnimNode_Root ; // 0x1868(0x20)
	struct FAnimNode_Root ; // 0x1888(0x20)
	struct FAnimNode_Root ; // 0x18a8(0x20)
	struct FAnimNode_Root ; // 0x18c8(0x20)
	struct FAnimNode_Root ; // 0x18e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1908(0xc0)
	struct FAnimNode_Root ; // 0x19c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x19e8(0xc0)
	struct FAnimNode_Root ; // 0x1aa8(0x20)
	struct FAnimNode_Root ; // 0x1ac8(0x20)
	struct FAnimNode_Root ; // 0x1ae8(0x20)
	struct FAnimNode_Root ; // 0x1b08(0x20)
	struct FAnimNode_Root ; // 0x1b28(0x20)
	struct FAnimNode_Root ; // 0x1b48(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1b68(0xc0)
	struct FAnimNode_Root ; // 0x1c28(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1c48(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1d08(0xc0)
	struct FAnimNode_Root ; // 0x1dc8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1de8(0xc0)
	struct FAnimNode_Root ; // 0x1ea8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1ec8(0xc0)
	struct FAnimNode_Root ; // 0x1f88(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1fa8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2068(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2128(0xc0)
	struct FAnimNode_Root ; // 0x21e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2208(0xc0)
	struct FAnimNode_Root ; // 0x22c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x22e8(0xc0)
	struct FAnimNode_Root ; // 0x23a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x23c8(0xc0)
	struct FAnimNode_Root ; // 0x2488(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x24a8(0xc0)
	struct FAnimNode_Root ; // 0x2568(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2588(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2648(0xc0)
	struct FAnimNode_Root ; // 0x2708(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2728(0xc0)
	struct FAnimNode_Root ; // 0x27e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2808(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x28c8(0xc0)
	struct FAnimNode_Root ; // 0x2988(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x29a8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2a68(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2b28(0xc0)
	struct FAnimNode_Root ; // 0x2be8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2c08(0xc0)
	struct FAnimNode_Root ; // 0x2cc8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2ce8(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x2d30(0x110)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x2e40(0x110)
	struct FAnimNode_UseCachedPose ; // 0x2f50(0x28)
	struct FAnimNode_LinkedInputPose ; // 0x2f78(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x3038(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x30f8(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x31f8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x32f8(0x28)
	struct FAnimNode_Root ; // 0x3320(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3340(0x110)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3450(0x110)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3560(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x3620(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x3720(0xc0)
	struct FAnimNode_UseCachedPose ; // 0x37e0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3808(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3830(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3850(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x3878(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0x3978(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x3a40(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x3b08(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3b30(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x3b58(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x3c20(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3c48(0x28)
	struct FAnimNode_ResetRoot AnimGraphNode_ResetRoot; // 0x3c70(0xd8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3d48(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3d68(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x3d88(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3e88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3eb0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3ed8(0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3fd8(0xc0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4098(0xc8)
	struct FFortAnimInput_TurnInPlace __CustomProperty_TurnInPlace_E972EE0A46EDC236B6BA2482472CB2C0; // 0x4160(0x78)
	double __CustomProperty_Pitch_61C65E4944F5DB18DC8B6496B9622A88; // 0x41d8(0x08)
	double __CustomProperty_Yaw_61C65E4944F5DB18DC8B6496B9622A88; // 0x41e0(0x08)
	double __CustomProperty_AimOffsetAlpha_61C65E4944F5DB18DC8B6496B9622A88; // 0x41e8(0x08)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_LowerBodyOverride(struct FPoseLink InLowerBodyPose, struct FPoseLink InSourcePose, struct FPoseLink InSourcePosePreUpperBodySlot, struct FPoseLink& MovementMode_LowerBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_LowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_LocomotionAdditives(struct FPoseLink InLocomotionAdditivesPose, struct FPoseLink& MovementMode_LocomotionAdditives); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_LocomotionAdditives // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_SourcePose(struct FPoseLink InSourcePoseBase, struct FPoseLink& MovementMode_SourcePose); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_SourcePose // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink& MovementMode_FullBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleAimingOffsetsLayer(struct FPoseLink InPoseVehicleAimOffsets, struct FPoseLink InPoseVehicleAimOffsetsNoRoot, struct FPoseLink& VehicleAimingOffsetsLayer); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleAimingOffsetsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void FullBodyAimingOffsetsLayer(struct FPoseLink InFullBodyAimOffsetsBasePose, struct FPoseLink& FullBodyAimingOffsetsLayer); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.FullBodyAimingOffsetsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Player_FullBodyAimOffsets_AnimBP(int32_t EntryPoint); // Function Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ExecuteUbergraph_Player_FullBodyAimOffsets_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

