// ScriptStruct Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x238 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UAnimSequenceBase* ; // 0x08(0x08)
	struct UAnimSequenceBase* ; // 0x10(0x08)
	struct UAnimSequenceBase* ; // 0x18(0x08)
	struct FName ; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct UBlendSpace* ; // 0x28(0x08)
	struct UBlendSpace* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct FName ; // 0x40(0x04)
	int32_t ; // 0x44(0x04)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UBlendSpace* ; // 0x50(0x08)
	float ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	int32_t ; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UAnimSequenceBase* ; // 0x68(0x08)
	struct TArray<float> ; // 0x70(0x10)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct FName ; // 0x88(0x04)
	int32_t ; // 0x8c(0x04)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct TArray<float> ; // 0xa0(0x10)
	struct TArray<float> ; // 0xb0(0x10)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct UAnimSequenceBase* ; // 0xc8(0x08)
	enum class EAnimSyncMethod ; // 0xd0(0x01)
	enum class EAnimGroupRole ; // 0xd1(0x01)
	char pad_D2[0x2]; // 0xd2(0x02)
	struct FName ; // 0xd4(0x04)
	struct FName ; // 0xd8(0x04)
	float ; // 0xdc(0x04)
	struct UAnimSequenceBase* ; // 0xe0(0x08)
	struct FInputScaleBiasClampConstants ; // 0xe8(0x2c)
	float ; // 0x114(0x04)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	struct FName ; // 0x120(0x04)
	struct FName ; // 0x124(0x04)
	int32_t ; // 0x128(0x04)
	float ; // 0x12c(0x04)
	enum class ESequenceEvalReinit ; // 0x130(0x01)
	bool ; // 0x131(0x01)
	char pad_132[0x6]; // 0x132(0x06)
	struct UAnimSequenceBase* ; // 0x138(0x08)
	enum class EAnimSyncMethod ; // 0x140(0x01)
	enum class EAnimGroupRole ; // 0x141(0x01)
	char pad_142[0x2]; // 0x142(0x02)
	struct FName ; // 0x144(0x04)
	struct FName ; // 0x148(0x04)
	int32_t ; // 0x14c(0x04)
	struct TArray<float> ; // 0x150(0x10)
	struct UBlendProfile* ; // 0x160(0x08)
	struct UCurveFloat* ; // 0x168(0x08)
	bool ; // 0x170(0x01)
	enum class EAlphaBlendOption ; // 0x171(0x01)
	enum class EBlendListTransitionType ; // 0x172(0x01)
	char pad_173[0x5]; // 0x173(0x05)
	struct TArray<float> ; // 0x178(0x10)
	struct FAnimNodeFunctionRef ; // 0x188(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1a0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x220(0x18)
};

// ScriptStruct Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x4a (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	float ; // 0x0c(0x04)
	bool ; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	bool ; // 0x1c(0x01)
	bool ; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	float ; // 0x20(0x04)
	bool ; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float ; // 0x28(0x04)
	bool ; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	float ; // 0x30(0x04)
	bool ; // 0x34(0x01)
	bool ; // 0x35(0x01)
	bool ; // 0x36(0x01)
	char pad_37[0x1]; // 0x37(0x01)
	float ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
	bool ; // 0x3d(0x01)
	bool ; // 0x3e(0x01)
	char pad_3F[0x1]; // 0x3f(0x01)
	float ; // 0x40(0x04)
	float ; // 0x44(0x04)
	bool ; // 0x48(0x01)
	bool ; // 0x49(0x01)
};

