// AnimBlueprintGeneratedClass Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C
// Size: 0x1a20 (Inherited: 0x1610)
struct UPlayer_SourcePose_AnimBP_C : UFortPlayerPrototypeAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1610(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1618(0x68)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1680(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1688(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1690(0x20)
	struct FAnimNode_BlendListByBool ; // 0x16b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0x16f8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x1740(0x48)
	struct FAnimNode_SequenceEvaluator ; // 0x1788(0x40)
	struct FAnimNode_SequenceEvaluator ; // 0x17c8(0x40)
	struct FAnimNode_SequenceEvaluator ; // 0x1808(0x40)
	struct FAnimNode_SequenceEvaluator ; // 0x1848(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1888(0x48)
	struct FAnimNode_SequenceEvaluator ; // 0x18d0(0x40)
	struct FAnimNode_SequenceEvaluator ; // 0x1910(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1950(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1998(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x19e0(0x40)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Player_SourcePose_AnimBP(int32_t EntryPoint); // Function Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.ExecuteUbergraph_Player_SourcePose_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

