// ScriptStruct Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x110 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct TArray<float> ; // 0x08(0x10)
	struct TArray<float> ; // 0x18(0x10)
	struct UBlendProfile* ; // 0x28(0x08)
	struct UCurveFloat* ; // 0x30(0x08)
	enum class EAlphaBlendOption ; // 0x38(0x01)
	enum class EBlendListTransitionType ; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<float> ; // 0x40(0x10)
	struct FAnimNodeFunctionRef ; // 0x50(0x18)
	enum class ESequenceEvalReinit ; // 0x68(0x01)
	bool ; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	float ; // 0x6c(0x04)
	bool ; // 0x70(0x01)
	enum class EAnimSyncMethod ; // 0x71(0x01)
	enum class EAnimGroupRole ; // 0x72(0x01)
	char pad_73[0x1]; // 0x73(0x01)
	struct FName ; // 0x74(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x78(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xf8(0x18)
};

// ScriptStruct Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x68 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<float> __ArrayProperty; // 0x08(0x10)
	bool ; // 0x18(0x01)
	bool ; // 0x19(0x01)
	bool ; // 0x1a(0x01)
	char pad_1B[0x5]; // 0x1b(0x05)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	bool ; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	bool ; // 0x58(0x01)
	bool ; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct UAnimSequenceBase* ; // 0x60(0x08)
};

