// ScriptStruct Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1a8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	struct FName ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	struct FName ; // 0x2c(0x04)
	struct FName ; // 0x30(0x04)
	struct FName ; // 0x34(0x04)
	struct FName ; // 0x38(0x04)
	struct FName ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	struct FName ; // 0x44(0x04)
	struct FName ; // 0x48(0x04)
	struct FName ; // 0x4c(0x04)
	struct FName ; // 0x50(0x04)
	struct FName ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	struct FName ; // 0x64(0x04)
	struct FName ; // 0x68(0x04)
	struct FName ; // 0x6c(0x04)
	struct TArray<float> ; // 0x70(0x10)
	struct FName ; // 0x80(0x04)
	struct FName ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct TArray<float> ; // 0x90(0x10)
	struct FName ; // 0xa0(0x04)
	struct FName ; // 0xa4(0x04)
	struct FName ; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct TArray<int32_t> ; // 0xb0(0x10)
	struct TArray<float> ; // 0xc0(0x10)
	struct UBlendProfile* ; // 0xd0(0x08)
	struct UCurveFloat* ; // 0xd8(0x08)
	bool ; // 0xe0(0x01)
	enum class EAlphaBlendOption ; // 0xe1(0x01)
	enum class EBlendListTransitionType ; // 0xe2(0x01)
	char pad_E3[0x5]; // 0xe3(0x05)
	struct TArray<float> ; // 0xe8(0x10)
	struct FAnimNodeFunctionRef ; // 0xf8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x110(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x190(0x18)
};

// ScriptStruct Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x0b (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool ; // 0x02(0x01)
	bool ; // 0x03(0x01)
	bool ; // 0x04(0x01)
	bool ; // 0x05(0x01)
	bool ; // 0x06(0x01)
	bool ; // 0x07(0x01)
	char ; // 0x08(0x01)
	bool ; // 0x09(0x01)
	bool ; // 0x0a(0x01)
};

