// ScriptStruct Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1a8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	struct FName ; // 0x14(0x04)
	struct FName ; // 0x18(0x04)
	struct FName ; // 0x1c(0x04)
	struct FName ; // 0x20(0x04)
	struct FName ; // 0x24(0x04)
	struct FName ; // 0x28(0x04)
	struct FName ; // 0x2c(0x04)
	struct FName ; // 0x30(0x04)
	struct FName ; // 0x34(0x04)
	struct FName ; // 0x38(0x04)
	struct FName ; // 0x3c(0x04)
	struct FName ; // 0x40(0x04)
	struct FName ; // 0x44(0x04)
	struct FName ; // 0x48(0x04)
	struct FName ; // 0x4c(0x04)
	struct FName ; // 0x50(0x04)
	struct FName ; // 0x54(0x04)
	struct FName ; // 0x58(0x04)
	struct FName ; // 0x5c(0x04)
	struct FName ; // 0x60(0x04)
	struct FName ; // 0x64(0x04)
	struct FName ; // 0x68(0x04)
	struct FName ; // 0x6c(0x04)
	struct FName ; // 0x70(0x04)
	struct FName ; // 0x74(0x04)
	struct FName ; // 0x78(0x04)
	struct FName ; // 0x7c(0x04)
	struct FName ; // 0x80(0x04)
	struct FName ; // 0x84(0x04)
	struct FName ; // 0x88(0x04)
	struct FName ; // 0x8c(0x04)
	struct UBlendProfile* ; // 0x90(0x08)
	struct UCurveFloat* ; // 0x98(0x08)
	enum class EAlphaBlendOption ; // 0xa0(0x01)
	enum class EBlendListTransitionType ; // 0xa1(0x01)
	char pad_A2[0x6]; // 0xa2(0x06)
	struct TArray<float> ; // 0xa8(0x10)
	struct UBlendSpace* ; // 0xb8(0x08)
	struct UBlendSpace* ; // 0xc0(0x08)
	struct FName ; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct UBlendSpace* ; // 0xd0(0x08)
	struct UBlendSpace* ; // 0xd8(0x08)
	float ; // 0xe0(0x04)
	bool ; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	float ; // 0xe8(0x04)
	bool ; // 0xec(0x01)
	enum class EAnimSyncMethod ; // 0xed(0x01)
	enum class EAnimGroupRole ; // 0xee(0x01)
	char pad_EF[0x1]; // 0xef(0x01)
	struct FName ; // 0xf0(0x04)
	struct FName ; // 0xf4(0x04)
	struct FAnimNodeFunctionRef ; // 0xf8(0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x110(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x190(0x18)
};

// ScriptStruct Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x1c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float ; // 0x04(0x04)
	float ; // 0x08(0x04)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
};

