// AnimBlueprintGeneratedClass Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C
// Size: 0x79a4 (Inherited: 0xe30)
struct UPlayer_ProceduralAdjustments_AnimBP_C : UFortPlayerProceduralAdjustmentsAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xe30(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xe38(0x0b)
	char pad_E43[0x5]; // 0xe43(0x05)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xe48(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xe50(0x08)
	struct FAnimNode_Root ; // 0xe58(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xe78(0xc0)
	struct FAnimNode_Root ; // 0xf38(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xf58(0xc0)
	struct FAnimNode_Root ; // 0x1018(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1038(0xc0)
	struct FAnimNode_Root ; // 0x10f8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1118(0xc0)
	struct FAnimNode_Root ; // 0x11d8(0x20)
	struct FAnimNode_Root ; // 0x11f8(0x20)
	struct FAnimNode_Root ; // 0x1218(0x20)
	struct FAnimNode_Root ; // 0x1238(0x20)
	struct FAnimNode_Root ; // 0x1258(0x20)
	struct FAnimNode_Root ; // 0x1278(0x20)
	struct FAnimNode_Root ; // 0x1298(0x20)
	struct FAnimNode_Root ; // 0x12b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x12d8(0xc0)
	struct FAnimNode_Root ; // 0x1398(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x13b8(0xc0)
	struct FAnimNode_Root ; // 0x1478(0x20)
	struct FAnimNode_Root ; // 0x1498(0x20)
	struct FAnimNode_Root ; // 0x14b8(0x20)
	struct FAnimNode_Root ; // 0x14d8(0x20)
	struct FAnimNode_Root ; // 0x14f8(0x20)
	struct FAnimNode_Root ; // 0x1518(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1538(0xc0)
	struct FAnimNode_Root ; // 0x15f8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1618(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x16d8(0xc0)
	struct FAnimNode_Root ; // 0x1798(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x17b8(0xc0)
	struct FAnimNode_Root ; // 0x1878(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1898(0xc0)
	struct FAnimNode_Root ; // 0x1958(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x1978(0x20)
	struct FAnimNode_ModifyBone ; // 0x1998(0x128)
	struct FAnimNode_ModifyBone ; // 0x1ac0(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x1be8(0x20)
	struct FAnimNode_ModifyBone ; // 0x1c08(0x128)
	struct FAnimNode_ModifyBone ; // 0x1d30(0x128)
	struct FAnimNode_ModifyBone ; // 0x1e58(0x128)
	struct FAnimNode_ModifyBone ; // 0x1f80(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x20a8(0xc0)
	struct FAnimNode_Root ; // 0x2168(0x20)
	struct FAnimNode_ModifyBone ; // 0x2188(0x128)
	struct FFortAnimNode_SlopeWarping FortAnimGraphNode_SlopeWarping; // 0x22b0(0x2e0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2590(0x20)
	struct FAnimNode_BlendListByBool ; // 0x25b0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x25f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2618(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2638(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2658(0xa8)
	struct FAnimNode_UseCachedPose ; // 0x2700(0x28)
	struct FAnimNode_ModifyBone ; // 0x2728(0x128)
	struct FAnimNode_ModifyBone ; // 0x2850(0x128)
	struct FAnimNode_UseCachedPose ; // 0x2978(0x28)
	struct FAnimNode_ModifyBone ; // 0x29a0(0x128)
	struct FAnimNode_ModifyBone ; // 0x2ac8(0x128)
	struct FAnimNode_SaveCachedPose ; // 0x2bf0(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x2cf0(0xc0)
	struct FAnimNode_Root ; // 0x2db0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2dd0(0xc0)
	struct FAnimNode_ModifyBone ; // 0x2e90(0x128)
	struct FAnimNode_BlendListByBool ; // 0x2fb8(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3000(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3020(0x48)
	struct FAnimNode_ModifyBone ; // 0x3068(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3190(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x31b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x31d0(0x20)
	struct FAnimNode_ModifyBone ; // 0x31f0(0x128)
	struct FAnimNode_ModifyBone ; // 0x3318(0x128)
	struct FAnimNode_ModifyBone ; // 0x3440(0x128)
	struct FAnimNode_ModifyBone ; // 0x3568(0x128)
	struct FAnimNode_BlendListByBool ; // 0x3690(0x48)
	struct FAnimNode_ModifyBone ; // 0x36d8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3800(0x20)
	struct FAnimNode_ModifyBone ; // 0x3820(0x128)
	struct FAnimNode_ModifyBone ; // 0x3948(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3a70(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x3a90(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3b90(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3bb8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3be0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3c08(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3c30(0x48)
	struct FAnimNode_UseCachedPose ; // 0x3c78(0x28)
	struct FAnimNode_Root ; // 0x3ca0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3cc0(0x20)
	struct FAnimNode_ModifyBone ; // 0x3ce0(0x128)
	struct FAnimNode_ModifyBone ; // 0x3e08(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x3f30(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3ff0(0x20)
	struct FAnimNode_Root ; // 0x4010(0x20)
	struct FAnimNode_ModifyBone ; // 0x4030(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4158(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4178(0x20)
	struct FAnimNode_ModifyBone ; // 0x4198(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x42c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x42e0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x4300(0x28)
	struct FAnimNode_ModifyBone ; // 0x4328(0x128)
	struct FAnimNode_ModifyBone ; // 0x4450(0x128)
	struct FAnimNode_UseCachedPose ; // 0x4578(0x28)
	struct FAnimNode_BlendListByBool ; // 0x45a0(0x48)
	struct FAnimNode_LinkedInputPose ; // 0x45e8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x46a8(0x100)
	struct FAnimNode_Root ; // 0x47a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x47c8(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4888(0x20)
	struct FAnimNode_ModifyBone ; // 0x48a8(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x49d0(0x20)
	struct FAnimNode_ModifyBone ; // 0x49f0(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4b18(0x20)
	struct FAnimNode_BlendListByBool ; // 0x4b38(0x48)
	struct FAnimNode_ModifyBone ; // 0x4b80(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4ca8(0x20)
	struct FAnimNode_UseCachedPose ; // 0x4cc8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x4cf0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x4df0(0x28)
	struct FAnimNode_Root ; // 0x4e18(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4e38(0xc0)
	struct FAnimNode_CopyBone ; // 0x4ef8(0xe8)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4fe0(0x20)
	struct FAnimNode_CopyBone ; // 0x5000(0xe8)
	struct FAnimNode_LegIK ; // 0x50e8(0xf8)
	struct FAnimNode_LegIK ; // 0x51e0(0xf8)
	struct FAnimNode_CopyBone ; // 0x52d8(0xe8)
	struct FAnimNode_CopyBone ; // 0x53c0(0xe8)
	struct FAnimNode_CopyBone ; // 0x54a8(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x5590(0x20)
	struct FAnimNode_CopyBone ; // 0x55b0(0xe8)
	struct FAnimNode_CopyBone ; // 0x5698(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5780(0x128)
	struct FAnimNode_CopyBone ; // 0x58a8(0xe8)
	struct FAnimNode_CopyBone ; // 0x5990(0xe8)
	struct FAnimNode_CopyBone ; // 0x5a78(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5b60(0x128)
	struct FAnimNode_CopyBone ; // 0x5c88(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5d70(0x128)
	struct FAnimNode_ModifyBone ; // 0x5e98(0x128)
	struct FAnimNode_ModifyBone ; // 0x5fc0(0x128)
	struct FAnimNode_CopyBone ; // 0x60e8(0xe8)
	struct FAnimNode_CopyBone ; // 0x61d0(0xe8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x62b8(0xe8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x63a0(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x63c0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6408(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x64e8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x6510(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x6610(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6710(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6738(0x48)
	struct FAnimNode_BlendListByBool ; // 0x6780(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x67c8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x68c8(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x68f0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x69b8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6ab8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x6ae0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x6b08(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x6bd0(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6c98(0x128)
	struct FAnimNode_UseCachedPose ; // 0x6dc0(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x6de8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6e08(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x6e50(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x6e70(0x100)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x6f70(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7030(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x70f0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x71f0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x7218(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x72e0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x73a8(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x73d0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x7498(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x74c0(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x7588(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x7650(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7678(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x7698(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7760(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7788(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x77a8(0xc8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x7870(0xf8)
	bool IsHidingInProp; // 0x7968(0x01)
	char pad_7969[0x7]; // 0x7969(0x07)
	struct FVector RightHandOverride; // 0x7970(0x18)
	struct FVector LeftHandOverride; // 0x7988(0x18)
	struct FName EmoteAnimOffsetCurveName; // 0x79a0(0x04)

	void FullBodyOverride(struct FPoseLink PassThroughFullBodyPose, struct FPoseLink& FullBodyOverride); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void CharacterSkeletalControlPostLegIK(struct FPoseLink InPosePostLegIK, struct FPoseLink& CharacterSkeletalControlPostLegIK); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.CharacterSkeletalControlPostLegIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void PostIKAdjustmentsLayer(struct FPoseLink InPosePostIkAdjustments, struct FPoseLink& PostIKAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PostIKAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void PreIKAdjustmentsLayer(struct FPoseLink InPosePreIKAdjustments, struct FPoseLink& PreIKAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PreIKAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void PlevisAndFeetAdjustmentsLayer(struct FPoseLink InPosePelvisAndFeetAdjustments, struct FPoseLink& PlevisAndFeetAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PlevisAndFeetAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void PushCannonAdjustmentsLayer(struct FPoseLink InPosePushCannonAdjustments, struct FPoseLink& PushCannonAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PushCannonAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ParaGliderAdjustmentsLayer(struct FPoseLink InPoseParaGliderAdjustments, struct FPoseLink& ParaGliderAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ParaGliderAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void HoverboardAdjustmentsLayer(struct FPoseLink InPoseHoverboardAdjustments, struct FPoseLink& HoverboardAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HoverboardAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void HandIKFixUpLayer(struct FPoseLink InPoseHandIk, struct FPoseLink& HandIKFixUpLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HandIKFixUpLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimGraph(struct FPoseLink InPosePostTurnInPlace, struct FPoseLink& AnimGraph); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP(int32_t EntryPoint); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

