// WidgetBlueprintGeneratedClass PlayedBeforeSelect.PlayedBeforeSelect_C
// Size: 0x470 (Inherited: 0x428)
struct UPlayedBeforeSelect_C : UFortPlayedBeforeSelect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x428(0x08)
	struct UWidgetAnimation* Intro; // 0x430(0x08)
	struct UCommonTextBlock* ; // 0x438(0x08)
	struct UCommonTextBlock* ; // 0x440(0x08)
	struct UCommonWidgetSwitcherLegacy* CommonWidgetSwitcher_InviteOnly; // 0x448(0x08)
	struct UInviteEventTitle_C* InviteEventTitle; // 0x450(0x08)
	struct UWidgetSwitcher* LoginType_Switcher; // 0x458(0x08)
	struct USafeZone* ; // 0x460(0x08)
	struct USignInWidget_C* SignInWidget; // 0x468(0x08)

	void (); // Function PlayedBeforeSelect.PlayedBeforeSelect_C. // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_PlayedBeforeSelect(int32_t EntryPoint); // Function PlayedBeforeSelect.PlayedBeforeSelect_C.ExecuteUbergraph_PlayedBeforeSelect // (Final|UbergraphFunction) // @ game+0xd67374
};

