// AnimBlueprintGeneratedClass Player_Jump_AnimBP.Player_Jump_AnimBP_C
// Size: 0x4328 (Inherited: 0x1610)
struct UPlayer_Jump_AnimBP_C : UFortPlayerPrototypeAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1610(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1618(0xa0)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x16b8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x16c0(0x08)
	struct FAnimNode_Root ; // 0x16c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x16e8(0xc0)
	struct FAnimNode_Root ; // 0x17a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x17c8(0xc0)
	struct FAnimNode_Root ; // 0x1888(0x20)
	struct FAnimNode_BlendListByBool ; // 0x18a8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x18f0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1930(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1970(0x40)
	struct FAnimNode_BlendListByBool ; // 0x19b0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x19f8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1a38(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1a78(0x48)
	struct FAnimNode_RefPose ; // 0x1ac0(0x10)
	struct FAnimNode_BlendListByBool ; // 0x1ad0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1b18(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1b58(0x48)
	struct FAnimNode_Root ; // 0x1ba0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1bc0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1c08(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1c48(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1c88(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1cc8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1d10(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1d50(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1d90(0x48)
	struct FAnimNode_RefPose ; // 0x1dd8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x1de8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1e30(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1e70(0x48)
	struct FAnimNode_Root ; // 0x1eb8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1ed8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1f18(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1f60(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1fa0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1fe0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2028(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2068(0x48)
	struct FAnimNode_SequencePlayer ; // 0x20b0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x20f0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2138(0x40)
	struct FAnimNode_RefPose ; // 0x2178(0x10)
	struct FAnimNode_BlendListByBool ; // 0x2188(0x48)
	struct FAnimNode_SequencePlayer ; // 0x21d0(0x40)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2210(0x48)
	struct FAnimNode_Root ; // 0x2258(0x20)
	struct FAnimNode_Root ; // 0x2278(0x20)
	struct FAnimNode_Root ; // 0x2298(0x20)
	struct FAnimNode_Root ; // 0x22b8(0x20)
	struct FAnimNode_Root ; // 0x22d8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x22f8(0xc0)
	struct FAnimNode_Root ; // 0x23b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x23d8(0xc0)
	struct FAnimNode_Root ; // 0x2498(0x20)
	struct FAnimNode_Root ; // 0x24b8(0x20)
	struct FAnimNode_Root ; // 0x24d8(0x20)
	struct FAnimNode_Root ; // 0x24f8(0x20)
	struct FAnimNode_Root ; // 0x2518(0x20)
	struct FAnimNode_Root ; // 0x2538(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2558(0xc0)
	struct FAnimNode_Root ; // 0x2618(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2638(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x26f8(0xc0)
	struct FAnimNode_Root ; // 0x27b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x27d8(0xc0)
	struct FAnimNode_Root ; // 0x2898(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x28b8(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2978(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2998(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2a58(0x100)
	struct FAnimNode_LayeredBoneBlend ; // 0x2b58(0xe0)
	struct FAnimNode_TransitionResult ; // 0x2c38(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c60(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c88(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d00(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d28(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d50(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d78(0x28)
	struct FAnimNode_TransitionResult ; // 0x2da0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2dc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2df0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2e18(0x40)
	struct FAnimNode_StateResult ; // 0x2e58(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2e78(0x40)
	struct FAnimNode_StateResult ; // 0x2eb8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ed8(0x40)
	struct FAnimNode_StateResult ; // 0x2f18(0x20)
	struct FAnimNode_StateMachine ; // 0x2f38(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3000(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x3028(0xc8)
	struct FAnimNode_TransitionResult ; // 0x30f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3118(0x28)
	struct FAnimNode_TransitionResult ; // 0x3140(0x28)
	struct FAnimNode_TransitionResult ; // 0x3168(0x28)
	struct FAnimNode_TransitionResult ; // 0x3190(0x28)
	struct FAnimNode_TransitionResult ; // 0x31b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x31e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3208(0x28)
	struct FAnimNode_TransitionResult ; // 0x3230(0x28)
	struct FAnimNode_TransitionResult ; // 0x3258(0x28)
	struct FAnimNode_TransitionResult ; // 0x3280(0x28)
	struct FAnimNode_TransitionResult ; // 0x32a8(0x28)
	struct FAnimNode_RefPose ; // 0x32d0(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x32e0(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0x33a0(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x3468(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x3548(0x40)
	struct FAnimNode_StateResult ; // 0x3588(0x20)
	struct FAnimNode_RefPose ; // 0x35a8(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x35b8(0xc0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3678(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x3740(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x3780(0xe0)
	struct FAnimNode_StateResult ; // 0x3860(0x20)
	struct FAnimNode_RefPose ; // 0x3880(0x10)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3890(0xc0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x3950(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x3a18(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x3af8(0x40)
	struct FAnimNode_StateResult ; // 0x3b38(0x20)
	struct FAnimNode_StateMachine ; // 0x3b58(0xc8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3c20(0x100)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3d20(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3d88(0xc8)
	struct FAnimNode_RefPose ; // 0x3e50(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x3e60(0xe0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3f40(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3f88(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3fb0(0x40)
	struct FAnimNode_StateResult ; // 0x3ff0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4010(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4050(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4070(0xc8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4138(0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4238(0xe0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4318(0x10)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink SourcePose, struct FPoseLink& AnimGraph); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_Player_Jump_AnimBP(int32_t EntryPoint); // Function Player_Jump_AnimBP.Player_Jump_AnimBP_C.ExecuteUbergraph_Player_Jump_AnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

