// ScriptStruct Player_LocomotionPrototype_AnimBP.Player_LocomotionPrototype_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xc8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FAnimNodeFunctionRef ; // 0x10(0x18)
	enum class ERefPoseType ; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x30(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xb0(0x18)
};

