// AnimBlueprintGeneratedClass RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C
// Size: 0x22d1 (Inherited: 0x880)
struct URidingPlayerLayerAnimBP_C : UFortValetPassengerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x880(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x888(0x1c)
	char pad_8A4[0x4]; // 0x8a4(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x8a8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x8b0(0x08)
	struct FAnimNode_Root ; // 0x8b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x8d8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x998(0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xa98(0xe0)
	struct FAnimNode_UseCachedPose ; // 0xb78(0x28)
	struct FAnimNode_ModifyBone ; // 0xba0(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xcc8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xce8(0x20)
	struct FAnimNode_SaveCachedPose ; // 0xd08(0x100)
	struct FAnimNode_UseCachedPose ; // 0xe08(0x28)
	struct FAnimNode_BlendListByBool ; // 0xe30(0x48)
	struct FAnimNode_UseCachedPose ; // 0xe78(0x28)
	struct FAnimNode_RotateRootBone ; // 0xea0(0xa8)
	struct FAnimNode_Slot ; // 0xf48(0x48)
	struct FAnimNode_SequencePlayer ; // 0xf90(0x40)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xfd0(0x110)
	struct FAnimNode_BlendSpacePlayer ; // 0x10e0(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1148(0xc8)
	struct FAnimNode_ModifyBone ; // 0x1210(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x1338(0xc0)
	struct FAnimNode_Root ; // 0x13f8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1418(0x48)
	struct FAnimNode_BlendListByBool ; // 0x1460(0x48)
	struct FAnimNode_SequencePlayer ; // 0x14a8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x14e8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1530(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1630(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1658(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1680(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x16c8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x1730(0x48)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1778(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x1820(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1860(0x48)
	struct FAnimNode_UseCachedPose ; // 0x18a8(0x28)
	struct FAnimNode_BlendListByBool ; // 0x18d0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1918(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1958(0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x19a0(0x110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1ab0(0x28)
	struct FAnimNode_ModifyBone ; // 0x1ad8(0x128)
	struct FAnimNode_ModifyBone ; // 0x1c00(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1d28(0x128)
	struct FAnimNode_Root ; // 0x1e50(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1e70(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1f30(0xc0)
	struct FAnimNode_Root ; // 0x1ff0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2010(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x20d0(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2190(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2250(0x20)
	struct FRotator MatchRootYaw; // 0x2270(0x18)
	bool Is Targeting; // 0x2288(0x01)
	char pad_2289[0x7]; // 0x2289(0x07)
	struct AFortPlayerPawn* FortPlayer; // 0x2290(0x08)
	double Timer; // 0x2298(0x08)
	bool ShouldTransitionToRiding; // 0x22a0(0x01)
	char pad_22A1[0x7]; // 0x22a1(0x07)
	double LowerBodyYaw; // 0x22a8(0x08)
	bool IsRideMode; // 0x22b0(0x01)
	bool IsSprinting; // 0x22b1(0x01)
	bool IsStandingStill; // 0x22b2(0x01)
	bool IsInCombat; // 0x22b3(0x01)
	char pad_22B4[0x4]; // 0x22b4(0x04)
	struct ANPC_Pawn_Wildlife_Parent_C* WildlifePawn; // 0x22b8(0x08)
	bool IsSmackie; // 0x22c0(0x01)
	char pad_22C1[0x7]; // 0x22c1(0x07)
	double Velocity; // 0x22c8(0x08)
	bool IsNug; // 0x22d0(0x01)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D1B22730415169A7290CBFAD6C915976(); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D1B22730415169A7290CBFAD6C915976 // (BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_RotateRootBone_D73766CE4BF0C956278D7FA8259A40CA(); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_RotateRootBone_D73766CE4BF0C956278D7FA8259A40CA // (BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_RidingPlayerLayerAnimBP(int32_t EntryPoint); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.ExecuteUbergraph_RidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xd67374
};

