// Class SentryRuntime.CreativeSentryAnimInstance
// Size: 0x5b0 (Inherited: 0x590)
struct UCreativeSentryAnimInstance : UFortDefenderAnimInstance {
	float RotateAimAnimationPitch; // 0x590(0x04)
	float CounterRotateAimAnimationPitch; // 0x594(0x04)
	bool bIsRelaxedLevel1OrNotTargeting; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	float RightHandIKAlpha; // 0x59c(0x04)
	float OneMinusLeftHandFK; // 0x5a0(0x04)
	float LeftHandIKAlpha; // 0x5a4(0x04)
	float RetargetHandIKBonesToFKPositionWeight; // 0x5a8(0x04)
	char pad_5AC[0x4]; // 0x5ac(0x04)
};

