// WidgetBlueprintGeneratedClass SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C
// Size: 0x438 (Inherited: 0x3f8)
struct USidebarWhatAreTagsEditTagsTooltip_C : UCommonActivatableWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f8(0x08)
	struct UWidgetAnimation* Outro; // 0x400(0x08)
	struct UWidgetAnimation* Pulse; // 0x408(0x08)
	struct UCommonRichTextBlock* ; // 0x410(0x08)
	struct UCommonRichTextBlock* ; // 0x418(0x08)
	struct UOnboardingTextInputActionButton_C* Dismiss_Button; // 0x420(0x08)
	struct UImage* Image_Arrow; // 0x428(0x08)
	struct UImage* ImageBurst; // 0x430(0x08)

	void Finished_403D1C044D946ADE029116801BEB88EB(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.Finished_403D1C044D946ADE029116801BEB88EB // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void Finished_5D07487B49685BD47F6772925D8F43EB(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.Finished_5D07487B49685BD47F6772925D8F43EB // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void BP_OnActivated(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BP_OnActivated // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void BP_OnDeactivated(); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BP_OnDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void BndEvt__SidebarWhatAreTagsEditTagsTooltip_Dismiss_Button_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(struct UCommonButtonLegacy* Button); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.BndEvt__SidebarWhatAreTagsEditTagsTooltip_Dismiss_Button_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_SidebarWhatAreTagsEditTagsTooltip(int32_t EntryPoint); // Function SidebarWhatAreTagsEditTagsTooltip.SidebarWhatAreTagsEditTagsTooltip_C.ExecuteUbergraph_SidebarWhatAreTagsEditTagsTooltip // (Final|UbergraphFunction) // @ game+0xd67374
};

