// Class Slate.ButtonWidgetStyle
// Size: 0x3e0 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x3b0)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0xa40 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0xa10)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x630 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x600)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x5d0 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x5a0)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0xb00 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0xad0)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x2f0 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x2c0)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x290 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x260)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x710 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x6e0)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x340 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x310)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x5c0 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x590)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x340 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x310)
};

// Class Slate.ToolMenuBase
// Size: 0x28 (Inherited: 0x28)
struct UToolMenuBase : UObject {
};

