// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1d8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct FName ; // 0x08(0x04)
	struct FName ; // 0x0c(0x04)
	struct FName ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UBlendSpace* ; // 0x18(0x08)
	enum class ERefPoseType ; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UBlendSpace* ; // 0x28(0x08)
	struct FName ; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<float> ; // 0x38(0x10)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct FName ; // 0x58(0x04)
	int32_t ; // 0x5c(0x04)
	struct UBlendSpace* ; // 0x60(0x08)
	struct FName ; // 0x68(0x04)
	int32_t ; // 0x6c(0x04)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct UBlendSpace* ; // 0x78(0x08)
	struct FName ; // 0x80(0x04)
	int32_t ; // 0x84(0x04)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct UBlendSpace* ; // 0x90(0x08)
	bool ; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	struct FName ; // 0x9c(0x04)
	int32_t ; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UBlendProfile* ; // 0xa8(0x08)
	struct UCurveFloat* ; // 0xb0(0x08)
	enum class EAlphaBlendOption ; // 0xb8(0x01)
	enum class EBlendListTransitionType ; // 0xb9(0x01)
	char pad_BA[0x6]; // 0xba(0x06)
	struct TArray<float> ; // 0xc0(0x10)
	struct FName ; // 0xd0(0x04)
	struct FName ; // 0xd4(0x04)
	float ; // 0xd8(0x04)
	struct FInputScaleBiasClampConstants ; // 0xdc(0x2c)
	float ; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* ; // 0x110(0x08)
	bool ; // 0x118(0x01)
	enum class EAnimSyncMethod ; // 0x119(0x01)
	enum class EAnimGroupRole ; // 0x11a(0x01)
	char pad_11B[0x5]; // 0x11b(0x05)
	struct FAnimNodeFunctionRef ; // 0x120(0x18)
	struct FName ; // 0x138(0x04)
	struct FName ; // 0x13c(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x140(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1c0(0x18)
};

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x3d (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	bool ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	bool ; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float ; // 0x14(0x04)
	float ; // 0x18(0x04)
	float ; // 0x1c(0x04)
	float ; // 0x20(0x04)
	float ; // 0x24(0x04)
	float ; // 0x28(0x04)
	float ; // 0x2c(0x04)
	float ; // 0x30(0x04)
	float ; // 0x34(0x04)
	float ; // 0x38(0x04)
	bool ; // 0x3c(0x01)
};

