// UserDefinedStruct Struc_NiagaraParameters.Struc_NiagaraParameters
// Size: 0x44 (Inherited: 0x00)
struct FStruc_NiagaraParameters {
	enum class ENUM_NiagaraParameterSetup ParameterSelection_14_A6D4854946F722970AD7D0AEC96E4705; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName FloatParameterName_17_6AFBA48F43B44BD1ED9841983BEFA202; // 0x04(0x04)
	float FloatParameterValue_28_AC98B6464E1CD803B50B47AEC91741EC; // 0x08(0x04)
	struct FName VectorParameterName_20_71917CFB490B3D5D3E0864A3EE90C666; // 0x0c(0x04)
	struct FVector VectorParameterValue_27_248856604659F589FF5D4FA5FF52E013; // 0x10(0x18)
	struct FName LinearColorparameterName_22_69C61F8D45C74F98203920856CAD5ADE; // 0x28(0x04)
	struct FLinearColor LinearColorParameterValue_29_861B08ED408F0F612BF509A2A94F377F; // 0x2c(0x10)
	struct FName IntegerParameterName_24_98306BA7452D90289F6EE9954C4F2B1D; // 0x3c(0x04)
	int32_t IntegerParameterValue_25_BB84ADEA4515AABD3B9AC6A04453D826; // 0x40(0x04)
};

