// UserDefinedStruct Struct_SurvivorScriptedAbilities.Struct_SurvivorScriptedAbilities
// Size: 0x24 (Inherited: 0x00)
struct FStruct_SurvivorScriptedAbilities {
	float SurvivorHelpReminderDuration_14_F54DDCC9447A56E42EEA23B2F26A82BF; // 0x00(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_CowerIndefiniteTrue_6_F917B44A44D629C4351341967FEDCE08; // 0x04(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_CowerIndefiniteFalse_7_E6F8C1C646C79DEF76809E829DCA289D; // 0x08(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_RescueTrue_9_6F9D8205427713C6B3C45D889DF83BE4; // 0x0c(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_RescueFalse_11_B549D5AB4CBCBCA2155C3FAA098A58D0; // 0x10(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_LockInPlaceTrue_18_1FA6565D4BC9F11CB51AC584EFDE6999; // 0x14(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_LockInPlaceFalse_20_B578575C4157F18CAD94EEBB4BA45E71; // 0x18(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_RescueStart_28_F37EAFF4488E12ABFE11299818466044; // 0x1c(0x04)
	struct FGameplayTag NPC_Ability_NonAttack_RescueFinish_29_7B19BD2348AA524234D34493C53321F3; // 0x20(0x04)
};

