// AnimBlueprintGeneratedClass SwimmingAnimBP.SwimmingAnimBP_C
// Size: 0x56d0 (Inherited: 0x9a0)
struct USwimmingAnimBP_C : UFortSwimmingLayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x9a0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x9a8(0x108)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xab0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xab8(0x08)
	struct FAnimNode_Root ; // 0xac0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xae0(0xc0)
	struct FAnimNode_BlendListByBool ; // 0xba0(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xbe8(0x110)
	struct FAnimNode_BlendListByEnum ; // 0xcf8(0x48)
	struct FAnimNode_LinkedInputPose ; // 0xd40(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xe00(0x100)
	struct FAnimNode_UseCachedPose ; // 0xf00(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf28(0x28)
	struct FAnimNode_Root ; // 0xf50(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xf70(0xc0)
	struct FAnimNode_RotateRootBone ; // 0x1030(0xa8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x10d8(0x110)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x11e8(0x110)
	struct FAnimNode_TransitionResult ; // 0x12f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1320(0x28)
	struct FAnimNode_TransitionResult ; // 0x1348(0x28)
	struct FAnimNode_TransitionResult ; // 0x1370(0x28)
	struct FAnimNode_TransitionResult ; // 0x1398(0x28)
	struct FAnimNode_SequencePlayer ; // 0x13c0(0x40)
	struct FAnimNode_StateResult ; // 0x1400(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1420(0x40)
	struct FAnimNode_StateResult ; // 0x1460(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1480(0x40)
	struct FAnimNode_StateResult ; // 0x14c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x14e0(0x40)
	struct FAnimNode_StateResult ; // 0x1520(0x20)
	struct FAnimNode_StateMachine ; // 0x1540(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x1608(0x100)
	struct FAnimNode_BlendListByBool ; // 0x1708(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1750(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x1778(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x1858(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1880(0x40)
	struct FAnimNode_TwoWayBlend ; // 0x18c0(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x1980(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1a80(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x1aa8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1af0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1b18(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1be0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1c20(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1c68(0x28)
	struct FAnimNode_Root ; // 0x1c90(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1cb0(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x1d70(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1e70(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e98(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ec0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ee8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f10(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f38(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f60(0x28)
	struct FAnimNode_TransitionResult ; // 0x1f88(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1fd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2000(0x28)
	struct FAnimNode_TransitionResult ; // 0x2028(0x28)
	struct FAnimNode_TransitionResult ; // 0x2050(0x28)
	struct FAnimNode_TransitionResult ; // 0x2078(0x28)
	struct FAnimNode_TransitionResult ; // 0x20a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x20c8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x20f0(0x20)
	struct FAnimNode_ModifyBone ; // 0x2110(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2238(0x20)
	struct FAnimNode_TransitionResult ; // 0x2258(0x28)
	struct FAnimNode_TransitionResult ; // 0x2280(0x28)
	struct FAnimNode_TransitionResult ; // 0x22a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x22d0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x22f8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2338(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2380(0x40)
	struct FAnimNode_StateResult ; // 0x23c0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x23e0(0x68)
	struct FAnimNode_StateResult ; // 0x2448(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2468(0x40)
	struct FAnimNode_StateResult ; // 0x24a8(0x20)
	struct FAnimNode_StateMachine ; // 0x24c8(0xc8)
	struct FAnimNode_StateResult ; // 0x2590(0x20)
	struct FAnimNode_TransitionResult ; // 0x25b0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x25d8(0x40)
	struct FAnimNode_StateResult ; // 0x2618(0x20)
	struct FAnimNode_UseCachedPose ; // 0x2638(0x28)
	struct FAnimNode_StateResult ; // 0x2660(0x20)
	struct FAnimNode_UseCachedPose ; // 0x2680(0x28)
	struct FAnimNode_StateResult ; // 0x26a8(0x20)
	struct FAnimNode_StateMachine ; // 0x26c8(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x2790(0x100)
	struct FAnimNode_TwoWayBlend ; // 0x2890(0xc0)
	struct FAnimNode_TransitionResult ; // 0x2950(0x28)
	struct FAnimNode_TransitionResult ; // 0x2978(0x28)
	struct FAnimNode_TransitionResult ; // 0x29a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x29c8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x29f0(0x68)
	struct FAnimNode_StateResult ; // 0x2a58(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2a78(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x2ae0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2b28(0x68)
	struct FAnimNode_StateResult ; // 0x2b90(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2bb0(0x68)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2c18(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2c60(0x68)
	struct FAnimNode_StateResult ; // 0x2cc8(0x20)
	struct FAnimNode_StateMachine ; // 0x2ce8(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2db0(0xa8)
	struct FAnimNode_Root ; // 0x2e58(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2e78(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2f38(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2ff8(0xc0)
	struct FAnimNode_TransitionResult ; // 0x30b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x30e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3108(0x28)
	struct FAnimNode_TransitionResult ; // 0x3130(0x28)
	struct FAnimNode_TransitionResult ; // 0x3158(0x28)
	struct FAnimNode_TransitionResult ; // 0x3180(0x28)
	struct FAnimNode_TransitionResult ; // 0x31a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x31d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x31f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3220(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3248(0x40)
	struct FAnimNode_StateResult ; // 0x3288(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x32a8(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x33b8(0x20)
	struct FAnimNode_ModifyBone ; // 0x33d8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3500(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3520(0x68)
	struct FAnimNode_StateResult ; // 0x3588(0x20)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x35a8(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x36b8(0x20)
	struct FAnimNode_ModifyBone ; // 0x36d8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3800(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3820(0x68)
	struct FAnimNode_StateResult ; // 0x3888(0x20)
	struct FAnimNode_SequencePlayer ; // 0x38a8(0x40)
	struct FAnimNode_StateResult ; // 0x38e8(0x20)
	struct FAnimNode_ModifyBone ; // 0x3908(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3a30(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3a50(0x20)
	struct FAnimNode_ModifyBone ; // 0x3a70(0x128)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x3b98(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3c98(0x28)
	struct FAnimNode_TwoWayBlend ; // 0x3cc0(0xc0)
	struct FAnimNode_UseCachedPose ; // 0x3d80(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3da8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x3df0(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3e18(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3e60(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3e80(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3ea0(0x128)
	struct FAnimNode_UseCachedPose ; // 0x3fc8(0x28)
	struct FAnimNode_StateResult ; // 0x3ff0(0x20)
	struct FAnimNode_StateMachine ; // 0x4010(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x40d8(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x41d8(0x100)
	struct FAnimNode_BlendSpacePlayer ; // 0x42d8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4340(0x48)
	struct FAnimNode_TwoWayBlend ; // 0x4388(0xc0)
	struct FAnimNode_Root ; // 0x4448(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4468(0xc0)
	struct FAnimNode_TransitionResult ; // 0x4528(0x28)
	struct FAnimNode_TransitionResult ; // 0x4550(0x28)
	struct FAnimNode_TransitionResult ; // 0x4578(0x28)
	struct FAnimNode_TransitionResult ; // 0x45a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x45c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x45f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x4618(0x28)
	struct FAnimNode_TransitionResult ; // 0x4640(0x28)
	struct FAnimNode_TransitionResult ; // 0x4668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4690(0x28)
	struct FAnimNode_SequencePlayer ; // 0x46b8(0x40)
	struct FAnimNode_StateResult ; // 0x46f8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x4718(0x68)
	struct FAnimNode_StateResult ; // 0x4780(0x20)
	struct FAnimNode_SequencePlayer ; // 0x47a0(0x40)
	struct FAnimNode_StateResult ; // 0x47e0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4800(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4840(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4880(0x48)
	struct FAnimNode_BlendListByBool ; // 0x48c8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4910(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4950(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4998(0x40)
	struct FAnimNode_BlendListByBool ; // 0x49d8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4a20(0x40)
	struct FAnimNode_StateResult ; // 0x4a60(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x4a80(0x68)
	struct FAnimNode_StateResult ; // 0x4ae8(0x20)
	struct FAnimNode_StateMachine ; // 0x4b08(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x4bd0(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x4c18(0xe0)
	struct FAnimNode_RefPose ; // 0x4cf8(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x4d08(0xe0)
	struct FAnimNode_RefPose ; // 0x4de8(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x4df8(0xe0)
	struct FAnimNode_RefPose ; // 0x4ed8(0x10)
	struct FAnimNode_TwoWayBlend ; // 0x4ee8(0xc0)
	struct FAnimNode_BlendListByBool ; // 0x4fa8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4ff0(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5058(0x68)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x50c0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x50e0(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x51a8(0xe0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5288(0x10)
	struct FAnimNode_Root ; // 0x5298(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x52b8(0xc0)
	struct FAnimNode_SequenceEvaluator ; // 0x5378(0x40)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x53b8(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x5478(0x40)
	struct FAnimNode_BlendListByBool ; // 0x54b8(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5500(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5548(0x100)
	struct FAnimNode_UseCachedPose ; // 0x5648(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5670(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5698(0x20)
	bool AllowSprintStop; // 0x56b8(0x01)
	bool ChangeMovementToVelocityFromAccel; // 0x56b9(0x01)
	char pad_56BA[0x6]; // 0x56ba(0x06)
	double LocalAccelYawAngleAtStart; // 0x56c0(0x08)
	double PivotAngle; // 0x56c8(0x08)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink& MovementMode_FullBodyOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_LowerBodyOverride(struct FPoseLink InLowerBodyPose, struct FPoseLink InSourcePose, struct FPoseLink InSourcePosePreUpperBodySlot, struct FPoseLink& MovementMode_LowerBodyOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_LowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_LocomotionAdditives(struct FPoseLink InLocomotionAdditivesPose, struct FPoseLink& MovementMode_LocomotionAdditives); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_LocomotionAdditives // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void MovementMode_SourcePose(struct FPoseLink InSourcePoseBase, struct FPoseLink& MovementMode_SourcePose); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_SourcePose // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void On Dive Jump Ground Land Update(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function SwimmingAnimBP.SwimmingAnimBP_C.On Dive Jump Ground Land Update // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_63C0C596447D773617BA3F81E189DD6A(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_63C0C596447D773617BA3F81E189DD6A // (BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_A2BC0C1C4C08F505008D78822E2CDA35(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_A2BC0C1C4C08F505008D78822E2CDA35 // (BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimSprintStart_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimSprintStart_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimSprint_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprint_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimSprintSlow_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintSlow_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimStartAdditive_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimStartAdditive_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void AnimNotify_SwimMovementAccelAdditive_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimMovementAccelAdditive_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_SwimmingAnimBP(int32_t EntryPoint); // Function SwimmingAnimBP.SwimmingAnimBP_C.ExecuteUbergraph_SwimmingAnimBP // (Final|UbergraphFunction) // @ game+0xd67374
};

