// SolarisGeneratedEnum UnrealEngineExperimental.log_level
enum class log_level : uint8 {
	Debug = 0,
	Verbose = 1,
	Normal = 2,
	Warning = 3,
	Error = 4
};

// VerseStruct UnrealEngineExperimental.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
// Size: 0x49 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x10(0x02)
	char pad_12[0x6]; // 0x12(0x06)
	OptionProperty __verse_0x932BF92E_Elem2; // 0x18(0x09)
	char pad_21[0x7]; // 0x21(0x07)
	OptionProperty __verse_0xF64C4596_Elem3; // 0x28(0x21)
};

// VerseStruct UnrealEngineExperimental.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
// Size: 0x12 (Inherited: 0x00)
struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R {
	VerseStringProperty __verse_0x18E3F084_Elem0; // 0x00(0x10)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x10(0x02)
};

// VerseStruct UnrealEngineExperimental.tuple_L_QLevel_Nlog__level_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
// Size: 0x39 (Inherited: 0x00)
struct Ftuple_L_QLevel_Nlog__level_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R {
	OptionProperty __verse_0x18E3F084_Elem0; // 0x00(0x02)
	char pad_2[0x6]; // 0x02(0x06)
	OptionProperty __verse_0x7D844C3C_Elem1; // 0x08(0x09)
	char pad_11[0x7]; // 0x11(0x07)
	OptionProperty __verse_0x932BF92E_Elem2; // 0x18(0x21)
};

