// ScriptStruct WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x410 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ; // 0x04(0x04)
	struct UBlendSpace* ; // 0x08(0x08)
	struct FName ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UBlendProfile* ; // 0x18(0x08)
	struct UAnimSequenceBase* ; // 0x20(0x08)
	struct UAnimSequenceBase* ; // 0x28(0x08)
	struct UAnimSequenceBase* ; // 0x30(0x08)
	struct UAnimSequenceBase* ; // 0x38(0x08)
	struct UAnimSequenceBase* ; // 0x40(0x08)
	struct UAnimSequenceBase* ; // 0x48(0x08)
	struct UAnimSequenceBase* ; // 0x50(0x08)
	struct UAnimSequenceBase* ; // 0x58(0x08)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	struct UBlendSpace* ; // 0x68(0x08)
	struct UAnimSequenceBase* ; // 0x70(0x08)
	struct UAnimSequenceBase* ; // 0x78(0x08)
	struct UAnimSequenceBase* ; // 0x80(0x08)
	struct UAnimSequenceBase* ; // 0x88(0x08)
	struct UAnimSequenceBase* ; // 0x90(0x08)
	struct UAnimSequenceBase* ; // 0x98(0x08)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	struct UAnimSequenceBase* ; // 0xa8(0x08)
	struct UAnimSequenceBase* ; // 0xb0(0x08)
	struct UAnimSequenceBase* ; // 0xb8(0x08)
	struct UAnimSequenceBase* ; // 0xc0(0x08)
	struct FName ; // 0xc8(0x04)
	struct FName ; // 0xcc(0x04)
	struct UAnimSequenceBase* ; // 0xd0(0x08)
	struct UBlendSpace* ; // 0xd8(0x08)
	struct UBlendSpace* ; // 0xe0(0x08)
	struct UAnimSequenceBase* ; // 0xe8(0x08)
	struct UBlendSpace* ; // 0xf0(0x08)
	struct FName ; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UBlendSpace* ; // 0x100(0x08)
	struct FName ; // 0x108(0x04)
	struct FName ; // 0x10c(0x04)
	struct UBlendSpace* ; // 0x110(0x08)
	struct UAnimSequenceBase* ; // 0x118(0x08)
	struct UAnimSequenceBase* ; // 0x120(0x08)
	struct FName ; // 0x128(0x04)
	int32_t ; // 0x12c(0x04)
	struct UAnimSequenceBase* ; // 0x130(0x08)
	struct UAnimSequenceBase* ; // 0x138(0x08)
	struct FName ; // 0x140(0x04)
	int32_t ; // 0x144(0x04)
	struct UAnimSequenceBase* ; // 0x148(0x08)
	struct FName ; // 0x150(0x04)
	int32_t ; // 0x154(0x04)
	struct UAnimSequenceBase* ; // 0x158(0x08)
	struct UAnimSequenceBase* ; // 0x160(0x08)
	struct FName ; // 0x168(0x04)
	int32_t ; // 0x16c(0x04)
	struct UAnimSequenceBase* ; // 0x170(0x08)
	struct FName ; // 0x178(0x04)
	char pad_17C[0x4]; // 0x17c(0x04)
	struct UAnimSequenceBase* ; // 0x180(0x08)
	struct FName ; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct UAnimSequenceBase* ; // 0x190(0x08)
	struct FName ; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct UAnimSequenceBase* ; // 0x1a0(0x08)
	struct FName ; // 0x1a8(0x04)
	struct FName ; // 0x1ac(0x04)
	struct UAnimSequenceBase* ; // 0x1b0(0x08)
	struct FName ; // 0x1b8(0x04)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct UAnimSequenceBase* ; // 0x1c0(0x08)
	struct FName ; // 0x1c8(0x04)
	char pad_1CC[0x4]; // 0x1cc(0x04)
	struct UAnimSequenceBase* ; // 0x1d0(0x08)
	struct FName ; // 0x1d8(0x04)
	struct FName ; // 0x1dc(0x04)
	int32_t ; // 0x1e0(0x04)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	struct UAnimSequenceBase* ; // 0x1e8(0x08)
	struct FName ; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct UAnimSequenceBase* ; // 0x1f8(0x08)
	struct UAnimSequenceBase* ; // 0x200(0x08)
	struct UAnimSequenceBase* ; // 0x208(0x08)
	struct TArray<float> ; // 0x210(0x10)
	enum class EBlendListTransitionType ; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
	struct TArray<float> ; // 0x228(0x10)
	struct FName ; // 0x238(0x04)
	int32_t ; // 0x23c(0x04)
	struct UAnimSequenceBase* ; // 0x240(0x08)
	struct FName ; // 0x248(0x04)
	int32_t ; // 0x24c(0x04)
	struct UAnimSequenceBase* ; // 0x250(0x08)
	struct TArray<float> ; // 0x258(0x10)
	struct UAnimSequenceBase* ; // 0x268(0x08)
	struct TArray<float> ; // 0x270(0x10)
	struct UBlendSpace* ; // 0x280(0x08)
	enum class EAnimSyncMethod ; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	struct FName ; // 0x28c(0x04)
	struct FName ; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct UBlendSpace* ; // 0x298(0x08)
	struct UBlendSpace* ; // 0x2a0(0x08)
	struct UBlendSpace* ; // 0x2a8(0x08)
	struct UBlendSpace* ; // 0x2b0(0x08)
	struct UBlendProfile* ; // 0x2b8(0x08)
	struct UCurveFloat* ; // 0x2c0(0x08)
	enum class EAlphaBlendOption ; // 0x2c8(0x01)
	enum class EBlendListTransitionType ; // 0x2c9(0x01)
	char pad_2CA[0x6]; // 0x2ca(0x06)
	struct TArray<float> ; // 0x2d0(0x10)
	struct FName ; // 0x2e0(0x04)
	struct FInputScaleBiasClampConstants ; // 0x2e4(0x2c)
	struct UAnimSequenceBase* ; // 0x310(0x08)
	struct FName ; // 0x318(0x04)
	int32_t ; // 0x31c(0x04)
	enum class ERefPoseType ; // 0x320(0x01)
	char pad_321[0x3]; // 0x321(0x03)
	struct FName ; // 0x324(0x04)
	int32_t ; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct UBlendSpace* ; // 0x330(0x08)
	bool ; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	float ; // 0x33c(0x04)
	float ; // 0x340(0x04)
	bool ; // 0x344(0x01)
	enum class EAnimSyncMethod ; // 0x345(0x01)
	enum class EAnimGroupRole ; // 0x346(0x01)
	char pad_347[0x1]; // 0x347(0x01)
	struct FName ; // 0x348(0x04)
	struct FName ; // 0x34c(0x04)
	struct FName ; // 0x350(0x04)
	struct FName ; // 0x354(0x04)
	struct FAnimNodeFunctionRef ; // 0x358(0x18)
	struct FName ; // 0x370(0x04)
	struct FName ; // 0x374(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x378(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x3f8(0x18)
};

// ScriptStruct WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0xa8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float ; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<float> ; // 0x10(0x10)
	bool ; // 0x20(0x01)
	bool ; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	float ; // 0x24(0x04)
	float ; // 0x28(0x04)
	bool ; // 0x2c(0x01)
	bool ; // 0x2d(0x01)
	bool ; // 0x2e(0x01)
	char pad_2F[0x1]; // 0x2f(0x01)
	float ; // 0x30(0x04)
	float ; // 0x34(0x04)
	bool ; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float ; // 0x3c(0x04)
	bool ; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ; // 0x44(0x04)
	bool ; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float ; // 0x4c(0x04)
	float ; // 0x50(0x04)
	float ; // 0x54(0x04)
	float ; // 0x58(0x04)
	float ; // 0x5c(0x04)
	float ; // 0x60(0x04)
	float ; // 0x64(0x04)
	bool ; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ; // 0x6c(0x04)
	float ; // 0x70(0x04)
	bool ; // 0x74(0x01)
	bool ; // 0x75(0x01)
	bool ; // 0x76(0x01)
	bool ; // 0x77(0x01)
	bool ; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float ; // 0x7c(0x04)
	bool ; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float ; // 0x84(0x04)
	float ; // 0x88(0x04)
	float ; // 0x8c(0x04)
	float ; // 0x90(0x04)
	bool ; // 0x94(0x01)
	bool ; // 0x95(0x01)
	char pad_96[0x2]; // 0x96(0x02)
	float ; // 0x98(0x04)
	float ; // 0x9c(0x04)
	bool ; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float ; // 0xa4(0x04)
};

