// AnimBlueprintGeneratedClass WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C
// Size: 0x557c (Inherited: 0xa90)
struct UWolfRidingPlayerLayerAnimBP_C : UFortVehicleLayerAnimInstance_Riding {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa90(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xa98(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xb40(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xb48(0x08)
	struct FAnimNode_Root ; // 0xb50(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xb70(0xc0)
	struct FAnimNode_ModifyBone ; // 0xc30(0x128)
	struct FAnimNode_ModifyBone ; // 0xd58(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xe80(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xea0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xec0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0xf28(0xc8)
	struct FAnimNode_Root ; // 0xff0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1010(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x10d0(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x11d0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x11f0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x1210(0x48)
	struct FAnimNode_ModifyBone ; // 0x1258(0x128)
	struct FAnimNode_ModifyBone ; // 0x1380(0x128)
	struct FAnimNode_ModifyBone ; // 0x14a8(0x128)
	struct FAnimNode_ModifyBone ; // 0x15d0(0x128)
	struct FAnimNode_TransitionResult ; // 0x16f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1720(0x28)
	struct FAnimNode_TransitionResult ; // 0x1748(0x28)
	struct FAnimNode_TransitionResult ; // 0x1770(0x28)
	struct FAnimNode_TransitionResult ; // 0x1798(0x28)
	struct FAnimNode_TransitionResult ; // 0x17c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x17e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1810(0x28)
	struct FAnimNode_TransitionResult ; // 0x1838(0x28)
	struct FAnimNode_TransitionResult ; // 0x1860(0x28)
	struct FAnimNode_TransitionResult ; // 0x1888(0x28)
	struct FAnimNode_TransitionResult ; // 0x18b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x18d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1900(0x28)
	struct FAnimNode_TransitionResult ; // 0x1928(0x28)
	struct FAnimNode_TransitionResult ; // 0x1950(0x28)
	struct FAnimNode_TransitionResult ; // 0x1978(0x28)
	struct FAnimNode_TransitionResult ; // 0x19a0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x19c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1a08(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1a48(0x48)
	struct FAnimNode_StateResult ; // 0x1a90(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1ab0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1af0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1b30(0x48)
	struct FAnimNode_StateResult ; // 0x1b78(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1b98(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1bd8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1c18(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1c60(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1ca0(0x48)
	struct FAnimNode_StateResult ; // 0x1ce8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1d08(0x40)
	struct FAnimNode_StateResult ; // 0x1d48(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1d68(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x1da8(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1e10(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x1ed8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1f20(0x40)
	struct FAnimNode_StateResult ; // 0x1f60(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1f80(0x40)
	struct FAnimNode_StateResult ; // 0x1fc0(0x20)
	struct FAnimNode_TransitionResult ; // 0x1fe0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2008(0x28)
	struct FAnimNode_TransitionResult ; // 0x2030(0x28)
	struct FAnimNode_TransitionResult ; // 0x2058(0x28)
	struct FAnimNode_TransitionResult ; // 0x2080(0x28)
	struct FAnimNode_TransitionResult ; // 0x20a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x20d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x20f8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2120(0x40)
	struct FAnimNode_StateResult ; // 0x2160(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2180(0x40)
	struct FAnimNode_StateResult ; // 0x21c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x21e0(0x40)
	struct FAnimNode_StateResult ; // 0x2220(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2240(0x40)
	struct FAnimNode_StateResult ; // 0x2280(0x20)
	struct FAnimNode_TransitionResult ; // 0x22a0(0x28)
	struct FAnimNode_StateMachine ; // 0x22c8(0xc8)
	struct FAnimNode_StateResult ; // 0x2390(0x20)
	struct FAnimNode_SequencePlayer ; // 0x23b0(0x40)
	struct FAnimNode_StateResult ; // 0x23f0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2410(0x40)
	struct FAnimNode_StateResult ; // 0x2450(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2470(0x40)
	struct FAnimNode_StateResult ; // 0x24b0(0x20)
	struct FAnimNode_TransitionResult ; // 0x24d0(0x28)
	struct FAnimNode_StateMachine ; // 0x24f8(0xc8)
	struct FAnimNode_StateResult ; // 0x25c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x25e0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2620(0x48)
	struct FAnimNode_TransitionResult ; // 0x2668(0x28)
	struct FAnimNode_TransitionResult ; // 0x2690(0x28)
	struct FAnimNode_SequencePlayer ; // 0x26b8(0x40)
	struct FAnimNode_StateResult ; // 0x26f8(0x20)
	struct FAnimNode_RefPose ; // 0x2718(0x10)
	struct FAnimNode_StateResult ; // 0x2728(0x20)
	struct FAnimNode_StateMachine ; // 0x2748(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x2810(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x28d8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2918(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2960(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x29c8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2a90(0x68)
	struct FAnimNode_StateResult ; // 0x2af8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2b18(0x40)
	struct FAnimNode_StateResult ; // 0x2b58(0x20)
	struct FAnimNode_StateMachine ; // 0x2b78(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x2c40(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x2d20(0x28)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x2d48(0x100)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x2e48(0x110)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2f58(0xe0)
	struct FAnimNode_TransitionResult ; // 0x3038(0x28)
	struct FAnimNode_TransitionResult ; // 0x3060(0x28)
	struct FAnimNode_TransitionResult ; // 0x3088(0x28)
	struct FAnimNode_UseCachedPose ; // 0x30b0(0x28)
	struct FAnimNode_StateResult ; // 0x30d8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x30f8(0x68)
	struct FAnimNode_StateResult ; // 0x3160(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3180(0x28)
	struct FAnimNode_StateResult ; // 0x31a8(0x20)
	struct FAnimNode_StateMachine ; // 0x31c8(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x3290(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3390(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x33b8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x34b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x34e0(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x3508(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x35d8(0x110)
	struct FAnimNode_TransitionResult ; // 0x36e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3710(0x28)
	struct FAnimNode_TransitionResult ; // 0x3738(0x28)
	struct FAnimNode_TransitionResult ; // 0x3760(0x28)
	struct FAnimNode_TransitionResult ; // 0x3788(0x28)
	struct FAnimNode_TransitionResult ; // 0x37b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x37d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3800(0x28)
	struct FAnimNode_TransitionResult ; // 0x3828(0x28)
	struct FAnimNode_TransitionResult ; // 0x3850(0x28)
	struct FAnimNode_TransitionResult ; // 0x3878(0x28)
	struct FAnimNode_TransitionResult ; // 0x38a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x38c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x38f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3918(0x28)
	struct FAnimNode_TransitionResult ; // 0x3940(0x28)
	struct FAnimNode_TransitionResult ; // 0x3968(0x28)
	struct FAnimNode_TransitionResult ; // 0x3990(0x28)
	struct FAnimNode_SequencePlayer ; // 0x39b8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x39f8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3a38(0x48)
	struct FAnimNode_StateResult ; // 0x3a80(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3aa0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3ae0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3b20(0x48)
	struct FAnimNode_StateResult ; // 0x3b68(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3b88(0x40)
	struct FAnimNode_StateResult ; // 0x3bc8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3be8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3c28(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3c70(0x40)
	struct FAnimNode_StateResult ; // 0x3cb0(0x20)
	struct FAnimNode_TransitionResult ; // 0x3cd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3cf8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d20(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d48(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d70(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d98(0x28)
	struct FAnimNode_TransitionResult ; // 0x3dc0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3de8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3e10(0x40)
	struct FAnimNode_StateResult ; // 0x3e50(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3e70(0x40)
	struct FAnimNode_StateResult ; // 0x3eb0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3ed0(0x40)
	struct FAnimNode_StateResult ; // 0x3f10(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3f30(0x40)
	struct FAnimNode_StateResult ; // 0x3f70(0x20)
	struct FAnimNode_TransitionResult ; // 0x3f90(0x28)
	struct FAnimNode_StateMachine ; // 0x3fb8(0xc8)
	struct FAnimNode_StateResult ; // 0x4080(0x20)
	struct FAnimNode_SequencePlayer ; // 0x40a0(0x40)
	struct FAnimNode_StateResult ; // 0x40e0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4100(0x40)
	struct FAnimNode_StateResult ; // 0x4140(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4160(0x40)
	struct FAnimNode_StateResult ; // 0x41a0(0x20)
	struct FAnimNode_TransitionResult ; // 0x41c0(0x28)
	struct FAnimNode_StateMachine ; // 0x41e8(0xc8)
	struct FAnimNode_StateResult ; // 0x42b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x42d0(0x40)
	struct FAnimNode_StateResult ; // 0x4310(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4330(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4370(0x40)
	struct FAnimNode_SequencePlayer ; // 0x43b0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x43f0(0x48)
	struct FAnimNode_BlendListByBool ; // 0x4438(0x48)
	struct FAnimNode_StateResult ; // 0x4480(0x20)
	struct FAnimNode_SequencePlayer ; // 0x44a0(0x40)
	struct FAnimNode_StateResult ; // 0x44e0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4500(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4540(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4588(0x40)
	struct FAnimNode_BlendListByBool ; // 0x45c8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4610(0x68)
	struct FAnimNode_StateResult ; // 0x4678(0x20)
	struct FAnimNode_StateMachine ; // 0x4698(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4760(0x128)
	struct FAnimNode_ApplyAdditive ; // 0x4888(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4950(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x49b8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4a80(0x68)
	struct FAnimNode_RefPose ; // 0x4ae8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x4af8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x4b40(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4b88(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4bf0(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4c58(0x48)
	struct FAnimNode_StateResult ; // 0x4ca0(0x20)
	struct FAnimNode_StateMachine ; // 0x4cc0(0xc8)
	struct FAnimNode_TransitionResult ; // 0x4d88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4db0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4dd8(0x40)
	struct FAnimNode_StateResult ; // 0x4e18(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4e38(0x10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4e48(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4e68(0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x4f30(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x5000(0x110)
	struct FAnimNode_Root ; // 0x5110(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x5130(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x51f0(0xc0)
	struct FAnimNode_Root ; // 0x52b0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x52d0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5390(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5450(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5510(0x20)
	bool State Rule Moving Idle; // 0x5530(0x01)
	bool State Rule Idle Moving; // 0x5531(0x01)
	bool Is Jumping; // 0x5532(0x01)
	bool State Rule Fall Idle; // 0x5533(0x01)
	bool Is Falling; // 0x5534(0x01)
	bool State Rule Fall Moving; // 0x5535(0x01)
	bool State Rule Jump Land Moving; // 0x5536(0x01)
	bool Is Surface Swimming; // 0x5537(0x01)
	bool State Rule Swim Idle Swim Loco; // 0x5538(0x01)
	char pad_5539[0x7]; // 0x5539(0x07)
	double BodyRoll; // 0x5540(0x08)
	double WolfSpeed2D; // 0x5548(0x08)
	bool Is Boosting; // 0x5550(0x01)
	bool Play Land Additive; // 0x5551(0x01)
	bool Is Moving Backwards; // 0x5552(0x01)
	bool Should Play Stop Backwards; // 0x5553(0x01)
	bool Is Turning in Place; // 0x5554(0x01)
	char pad_5555[0x3]; // 0x5555(0x03)
	double Turn in Place Angle Delta; // 0x5558(0x08)
	bool Was Turning Right; // 0x5560(0x01)
	char pad_5561[0x7]; // 0x5561(0x07)
	double Turn in Place Rotation Speed; // 0x5568(0x08)
	double Backwards Play Rate; // 0x5570(0x08)
	float SlopeRoll; // 0x5578(0x04)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xd67374
	void AnimGraph(struct FPoseLink& AnimGraph); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void GetMainAnimBPData_Wolf(struct UObject* AnimInstance); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Wolf // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_0A1EFC344EF1A6E586A54FAEC4F5F766(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_0A1EFC344EF1A6E586A54FAEC4F5F766 // (BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_4EDCD4F04E8D5963547EB2BE1F10FA2D(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_4EDCD4F04E8D5963547EB2BE1F10FA2D // (BlueprintEvent) // @ game+0xd67374
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D7C43EB141CFE2929E3D23914954FA93(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D7C43EB141CFE2929E3D23914954FA93 // (BlueprintEvent) // @ game+0xd67374
	void BlueprintCollectRidableAnimBPData(struct UAnimInstance* RidableAnimInstance); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void UpdateBoostPlayRate(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.UpdateBoostPlayRate // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void PlaceHandIKTargets(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.PlaceHandIKTargets // (Event|Protected|BlueprintEvent) // @ game+0xd67374
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xd67374
	void ExecuteUbergraph_WolfRidingPlayerLayerAnimBP(int32_t EntryPoint); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.ExecuteUbergraph_WolfRidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xd67374
};

