// WidgetBlueprintGeneratedClass XpBarToolTip.XpBarToolTip_C
// Size: 0x3a8 (Inherited: 0x2e0)
struct UXpBarToolTip_C : UCommonUserWidget {
	struct UCommonTextBlock* ; // 0x2e0(0x08)
	struct UCommonTextBlock* ; // 0x2e8(0x08)
	struct UCommonTextBlock* ; // 0x2f0(0x08)
	struct UCommonTextBlock* ; // 0x2f8(0x08)
	struct UCommonTextBlock* ; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UImage* ; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct FText HeaderText; // 0x330(0x18)
	struct FText CommanderXPText; // 0x348(0x18)
	struct FText BoostXPText; // 0x360(0x18)
	struct FText RestedXPText; // 0x378(0x18)
	struct FText BodyText; // 0x390(0x18)

	struct FText GetBodyText(); // Function XpBarToolTip.XpBarToolTip_C.GetBodyText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
	struct FText GetRestedXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetRestedXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
	struct FText GetBoostXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetBoostXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
	struct FText GetCommanderXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetCommanderXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
	struct FText GetHeaderText(); // Function XpBarToolTip.XpBarToolTip_C.GetHeaderText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xd67374
};

